/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = unsafe {
            *(core::ptr::addr_of!((*this).storage) as *const u8)
                .offset(byte_index as isize)
        };
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {

pub const PERL_UNICODE_STDERR: u8 = 69u8;
pub const PERL_UNICODE_STD: u8 = 83u8;
pub const PERL_UNICODE_IN: u8 = 105u8;
pub const PERL_UNICODE_OUT: u8 = 111u8;
pub const PERL_UNICODE_INOUT: u8 = 68u8;
pub const PERL_UNICODE_ARGV: u8 = 65u8;
pub const PERL_UNICODE_LOCALE: u8 = 76u8;
pub const PERL_UNICODE_WIDESYSCALLS: u8 = 87u8;
pub const PERL_UNICODE_UTF8CACHEASSERT: u8 = 97u8;
pub const PERL_SIGNALS_UNSAFE_FLAG: u32 = 1;
pub const PERL_PV_ESCAPE_QUOTE: u32 = 1;
pub const PERL_PV_PRETTY_QUOTE: u32 = 1;
pub const PERL_PV_PRETTY_ELLIPSES: u32 = 2;
pub const PERL_PV_PRETTY_LTGT: u32 = 4;
pub const PERL_PV_PRETTY_EXACTSIZE: u32 = 8;
pub const PERL_PV_ESCAPE_UNI: u32 = 256;
pub const PERL_PV_ESCAPE_UNI_DETECT: u32 = 512;
pub const PERL_PV_ESCAPE_NONASCII: u32 = 1024;
pub const PERL_PV_ESCAPE_FIRSTCHAR: u32 = 2048;
pub const PERL_PV_ESCAPE_ALL: u32 = 4096;
pub const PERL_PV_ESCAPE_NOBACKSLASH: u32 = 8192;
pub const PERL_PV_ESCAPE_NOCLEAR: u32 = 16384;
pub const PERL_PV_PRETTY_NOCLEAR: u32 = 16384;
pub const PERL_PV_ESCAPE_RE: u32 = 32768;
pub const PERL_PV_ESCAPE_DWIM: u32 = 65536;
pub const PERL_PV_ESCAPE_DWIM_ALL_HEX: u32 = 131072;
pub const PERL_PV_ESCAPE_NON_WC: u32 = 262144;
pub const PERL_PV_ESCAPE_TRUNC_MIDDLE: u32 = 524288;
pub const PERL_PV_PRETTY_QUOTEDPREFIX: u32 = 787459;
pub const PERL_PV_PRETTY_DUMP: u32 = 3;
pub const PERL_PV_PRETTY_REGPROP: u32 = 33798;
pub const NV_NAN_BITS: u32 = 51;
pub const NV_NAN_QS_BYTE_OFFSET: u32 = 6;
pub const NV_NAN_QS_BIT_SHIFT: u32 = 3;
pub const NV_NAN_QS_BIT: u32 = 8;
pub const NV_NAN_QS_BIT_OFFSET: u32 = 51;
pub const PERL_MAX_NESTED_EVAL_BEGIN_BLOCKS_DEFAULT: u32 = 1000;
pub const PERL_VAR_MAX_NESTED_EVAL_BEGIN_BLOCKS: &[u8; 29] = b"\rAX_NESTED_EVAL_BEGIN_BLOCKS\0";
pub const PERL_STOP_PARSING_AFTER_N_ERRORS: u32 = 10;
pub const G_ARRAY: u32 = 3;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
pub type __clock_t = ::std::os::raw::c_long;
pub type __time_t = ::std::os::raw::c_long;
pub type __key_t = ::std::os::raw::c_int;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type gid_t = __gid_t;
pub type uid_t = __uid_t;
pub type off64_t = __off64_t;
pub type pid_t = __pid_t;
pub type time_t = __time_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigset_t"][::std::mem::size_of::<__sigset_t>() - 128usize];
    ["Alignment of __sigset_t"][::std::mem::align_of::<__sigset_t>() - 8usize];
    [
        "Offset of field: __sigset_t::__val",
    ][::std::mem::offset_of!(__sigset_t, __val) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    [
        "Offset of field: timespec::tv_sec",
    ][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    [
        "Offset of field: timespec::tv_nsec",
    ][::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::std::os::raw::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of __atomic_wide_counter__bindgen_ty_1",
    ][::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>() - 8usize];
    [
        "Alignment of __atomic_wide_counter__bindgen_ty_1",
    ][::std::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>() - 4usize];
    [
        "Offset of field: __atomic_wide_counter__bindgen_ty_1::__low",
    ][::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __low) - 0usize];
    [
        "Offset of field: __atomic_wide_counter__bindgen_ty_1::__high",
    ][::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __high) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of __atomic_wide_counter",
    ][::std::mem::size_of::<__atomic_wide_counter>() - 8usize];
    [
        "Alignment of __atomic_wide_counter",
    ][::std::mem::align_of::<__atomic_wide_counter>() - 8usize];
    [
        "Offset of field: __atomic_wide_counter::__value64",
    ][::std::mem::offset_of!(__atomic_wide_counter, __value64) - 0usize];
    [
        "Offset of field: __atomic_wide_counter::__value32",
    ][::std::mem::offset_of!(__atomic_wide_counter, __value32) - 0usize];
};
impl ::std::fmt::Debug for __atomic_wide_counter {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "__atomic_wide_counter {{ union }}")
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of __pthread_internal_list",
    ][::std::mem::size_of::<__pthread_internal_list>() - 16usize];
    [
        "Alignment of __pthread_internal_list",
    ][::std::mem::align_of::<__pthread_internal_list>() - 8usize];
    [
        "Offset of field: __pthread_internal_list::__prev",
    ][::std::mem::offset_of!(__pthread_internal_list, __prev) - 0usize];
    [
        "Offset of field: __pthread_internal_list::__next",
    ][::std::mem::offset_of!(__pthread_internal_list, __next) - 8usize];
};
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_mutex_s"][::std::mem::size_of::<__pthread_mutex_s>() - 40usize];
    [
        "Alignment of __pthread_mutex_s",
    ][::std::mem::align_of::<__pthread_mutex_s>() - 8usize];
    [
        "Offset of field: __pthread_mutex_s::__lock",
    ][::std::mem::offset_of!(__pthread_mutex_s, __lock) - 0usize];
    [
        "Offset of field: __pthread_mutex_s::__count",
    ][::std::mem::offset_of!(__pthread_mutex_s, __count) - 4usize];
    [
        "Offset of field: __pthread_mutex_s::__owner",
    ][::std::mem::offset_of!(__pthread_mutex_s, __owner) - 8usize];
    [
        "Offset of field: __pthread_mutex_s::__nusers",
    ][::std::mem::offset_of!(__pthread_mutex_s, __nusers) - 12usize];
    [
        "Offset of field: __pthread_mutex_s::__kind",
    ][::std::mem::offset_of!(__pthread_mutex_s, __kind) - 16usize];
    [
        "Offset of field: __pthread_mutex_s::__spins",
    ][::std::mem::offset_of!(__pthread_mutex_s, __spins) - 20usize];
    [
        "Offset of field: __pthread_mutex_s::__elision",
    ][::std::mem::offset_of!(__pthread_mutex_s, __elision) - 22usize];
    [
        "Offset of field: __pthread_mutex_s::__list",
    ][::std::mem::offset_of!(__pthread_mutex_s, __list) - 24usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
    pub __unused_initialized_1: ::std::os::raw::c_uint,
    pub __unused_initialized_2: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cond_s"][::std::mem::size_of::<__pthread_cond_s>() - 48usize];
    [
        "Alignment of __pthread_cond_s",
    ][::std::mem::align_of::<__pthread_cond_s>() - 8usize];
    [
        "Offset of field: __pthread_cond_s::__wseq",
    ][::std::mem::offset_of!(__pthread_cond_s, __wseq) - 0usize];
    [
        "Offset of field: __pthread_cond_s::__g1_start",
    ][::std::mem::offset_of!(__pthread_cond_s, __g1_start) - 8usize];
    [
        "Offset of field: __pthread_cond_s::__g_size",
    ][::std::mem::offset_of!(__pthread_cond_s, __g_size) - 16usize];
    [
        "Offset of field: __pthread_cond_s::__g1_orig_size",
    ][::std::mem::offset_of!(__pthread_cond_s, __g1_orig_size) - 24usize];
    [
        "Offset of field: __pthread_cond_s::__wrefs",
    ][::std::mem::offset_of!(__pthread_cond_s, __wrefs) - 28usize];
    [
        "Offset of field: __pthread_cond_s::__g_signals",
    ][::std::mem::offset_of!(__pthread_cond_s, __g_signals) - 32usize];
    [
        "Offset of field: __pthread_cond_s::__unused_initialized_1",
    ][::std::mem::offset_of!(__pthread_cond_s, __unused_initialized_1) - 40usize];
    [
        "Offset of field: __pthread_cond_s::__unused_initialized_2",
    ][::std::mem::offset_of!(__pthread_cond_s, __unused_initialized_2) - 44usize];
};
impl ::std::fmt::Debug for __pthread_cond_s {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "__pthread_cond_s {{ __wseq: {:?}, __g1_start: {:?}, __g_size: {:?}, __g1_orig_size: {:?}, __wrefs: {:?}, __g_signals: {:?}, __unused_initialized_1: {:?}, __unused_initialized_2: {:?} }}",
            self.__wseq,
            self.__g1_start,
            self.__g_size,
            self.__g1_orig_size,
            self.__wrefs,
            self.__g_signals,
            self.__unused_initialized_1,
            self.__unused_initialized_2,
        )
    }
}
pub type pthread_t = ::std::os::raw::c_ulong;
pub type pthread_key_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutex_t"][::std::mem::size_of::<pthread_mutex_t>() - 40usize];
    ["Alignment of pthread_mutex_t"][::std::mem::align_of::<pthread_mutex_t>() - 8usize];
    [
        "Offset of field: pthread_mutex_t::__data",
    ][::std::mem::offset_of!(pthread_mutex_t, __data) - 0usize];
    [
        "Offset of field: pthread_mutex_t::__size",
    ][::std::mem::offset_of!(pthread_mutex_t, __size) - 0usize];
    [
        "Offset of field: pthread_mutex_t::__align",
    ][::std::mem::offset_of!(pthread_mutex_t, __align) - 0usize];
};
impl ::std::fmt::Debug for pthread_mutex_t {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "pthread_mutex_t {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_cond_t"][::std::mem::size_of::<pthread_cond_t>() - 48usize];
    ["Alignment of pthread_cond_t"][::std::mem::align_of::<pthread_cond_t>() - 8usize];
    [
        "Offset of field: pthread_cond_t::__data",
    ][::std::mem::offset_of!(pthread_cond_t, __data) - 0usize];
    [
        "Offset of field: pthread_cond_t::__size",
    ][::std::mem::offset_of!(pthread_cond_t, __size) - 0usize];
    [
        "Offset of field: pthread_cond_t::__align",
    ][::std::mem::offset_of!(pthread_cond_t, __align) - 0usize];
};
impl ::std::fmt::Debug for pthread_cond_t {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "pthread_cond_t {{ union }}")
    }
}
pub type wchar_t = ::std::os::raw::c_int;
pub type __gnuc_va_list = __builtin_va_list;
pub type va_list = __gnuc_va_list;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of __mbstate_t__bindgen_ty_1",
    ][::std::mem::size_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    [
        "Alignment of __mbstate_t__bindgen_ty_1",
    ][::std::mem::align_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    [
        "Offset of field: __mbstate_t__bindgen_ty_1::__wch",
    ][::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wch) - 0usize];
    [
        "Offset of field: __mbstate_t__bindgen_ty_1::__wchb",
    ][::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wchb) - 0usize];
};
impl ::std::fmt::Debug for __mbstate_t__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "__mbstate_t__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t"][::std::mem::size_of::<__mbstate_t>() - 8usize];
    ["Alignment of __mbstate_t"][::std::mem::align_of::<__mbstate_t>() - 4usize];
    [
        "Offset of field: __mbstate_t::__count",
    ][::std::mem::offset_of!(__mbstate_t, __count) - 0usize];
    [
        "Offset of field: __mbstate_t::__value",
    ][::std::mem::offset_of!(__mbstate_t, __value) - 4usize];
};
impl ::std::fmt::Debug for __mbstate_t {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "__mbstate_t {{ __count: {:?}, __value: {:?} }}",
            self.__count,
            self.__value,
        )
    }
}
pub type mbstate_t = __mbstate_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __locale_struct"][::std::mem::size_of::<__locale_struct>() - 232usize];
    ["Alignment of __locale_struct"][::std::mem::align_of::<__locale_struct>() - 8usize];
    [
        "Offset of field: __locale_struct::__locales",
    ][::std::mem::offset_of!(__locale_struct, __locales) - 0usize];
    [
        "Offset of field: __locale_struct::__ctype_b",
    ][::std::mem::offset_of!(__locale_struct, __ctype_b) - 104usize];
    [
        "Offset of field: __locale_struct::__ctype_tolower",
    ][::std::mem::offset_of!(__locale_struct, __ctype_tolower) - 112usize];
    [
        "Offset of field: __locale_struct::__ctype_toupper",
    ][::std::mem::offset_of!(__locale_struct, __ctype_toupper) - 120usize];
    [
        "Offset of field: __locale_struct::__names",
    ][::std::mem::offset_of!(__locale_struct, __names) - 128usize];
};
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type nl_item = ::std::os::raw::c_int;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum locale_category_index {
    LC_CTYPE_INDEX_ = 0,
    LC_NUMERIC_INDEX_ = 1,
    LC_COLLATE_INDEX_ = 2,
    LC_TIME_INDEX_ = 3,
    LC_MESSAGES_INDEX_ = 4,
    LC_MONETARY_INDEX_ = 5,
    LC_ADDRESS_INDEX_ = 6,
    LC_IDENTIFICATION_INDEX_ = 7,
    LC_MEASUREMENT_INDEX_ = 8,
    LC_PAPER_INDEX_ = 9,
    LC_TELEPHONE_INDEX_ = 10,
    LC_NAME_INDEX_ = 11,
    LC_ALL_INDEX_ = 12,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum locale_utf8ness_t {
    LOCALE_NOT_UTF8 = 0,
    LOCALE_IS_UTF8 = 1,
    LOCALE_UTF8NESS_UNKNOWN = 2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lconv_offset_t {
    pub name: *const ::std::os::raw::c_char,
    pub offset: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lconv_offset_t"][::std::mem::size_of::<lconv_offset_t>() - 16usize];
    ["Alignment of lconv_offset_t"][::std::mem::align_of::<lconv_offset_t>() - 8usize];
    [
        "Offset of field: lconv_offset_t::name",
    ][::std::mem::offset_of!(lconv_offset_t, name) - 0usize];
    [
        "Offset of field: lconv_offset_t::offset",
    ][::std::mem::offset_of!(lconv_offset_t, offset) - 8usize];
};
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum calc_LC_ALL_format {
    INTERNAL_FORMAT = 0,
    EXTERNAL_FORMAT_FOR_SET = 1,
    EXTERNAL_FORMAT_FOR_QUERY = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum calc_LC_ALL_return {
    WANT_VOID = 0,
    WANT_TEMP_PV = 1,
    WANT_PL_setlocale_buf = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum parse_LC_ALL_STRING_action {
    no_override = 0,
    override_if_ignored = 1,
    check_that_overridden = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum parse_LC_ALL_string_return {
    invalid = 0,
    no_array = 1,
    only_element_0 = 2,
    full_array = 3,
}
pub type __jmp_buf = [::std::os::raw::c_long; 8usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __jmp_buf_tag {
    pub __jmpbuf: __jmp_buf,
    pub __mask_was_saved: ::std::os::raw::c_int,
    pub __saved_mask: __sigset_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __jmp_buf_tag"][::std::mem::size_of::<__jmp_buf_tag>() - 200usize];
    ["Alignment of __jmp_buf_tag"][::std::mem::align_of::<__jmp_buf_tag>() - 8usize];
    [
        "Offset of field: __jmp_buf_tag::__jmpbuf",
    ][::std::mem::offset_of!(__jmp_buf_tag, __jmpbuf) - 0usize];
    [
        "Offset of field: __jmp_buf_tag::__mask_was_saved",
    ][::std::mem::offset_of!(__jmp_buf_tag, __mask_was_saved) - 64usize];
    [
        "Offset of field: __jmp_buf_tag::__saved_mask",
    ][::std::mem::offset_of!(__jmp_buf_tag, __saved_mask) - 72usize];
};
pub type sigjmp_buf = [__jmp_buf_tag; 1usize];
#[repr(C)]
#[derive(Copy, Clone)]
pub union sigval {
    pub sival_int: ::std::os::raw::c_int,
    pub sival_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigval"][::std::mem::size_of::<sigval>() - 8usize];
    ["Alignment of sigval"][::std::mem::align_of::<sigval>() - 8usize];
    [
        "Offset of field: sigval::sival_int",
    ][::std::mem::offset_of!(sigval, sival_int) - 0usize];
    [
        "Offset of field: sigval::sival_ptr",
    ][::std::mem::offset_of!(sigval, sival_ptr) - 0usize];
};
impl ::std::fmt::Debug for sigval {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "sigval {{ union }}")
    }
}
pub type __sigval_t = sigval;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct siginfo_t {
    pub si_signo: ::std::os::raw::c_int,
    pub si_errno: ::std::os::raw::c_int,
    pub si_code: ::std::os::raw::c_int,
    pub __pad0: ::std::os::raw::c_int,
    pub _sifields: siginfo_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union siginfo_t__bindgen_ty_1 {
    pub _pad: [::std::os::raw::c_int; 28usize],
    pub _kill: siginfo_t__bindgen_ty_1__bindgen_ty_1,
    pub _timer: siginfo_t__bindgen_ty_1__bindgen_ty_2,
    pub _rt: siginfo_t__bindgen_ty_1__bindgen_ty_3,
    pub _sigchld: siginfo_t__bindgen_ty_1__bindgen_ty_4,
    pub _sigfault: siginfo_t__bindgen_ty_1__bindgen_ty_5,
    pub _sigpoll: siginfo_t__bindgen_ty_1__bindgen_ty_6,
    pub _sigsys: siginfo_t__bindgen_ty_1__bindgen_ty_7,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_1 {
    pub si_pid: __pid_t,
    pub si_uid: __uid_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of siginfo_t__bindgen_ty_1__bindgen_ty_1",
    ][::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    [
        "Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_1",
    ][::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    [
        "Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_1::si_pid",
    ][::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_1, si_pid) - 0usize];
    [
        "Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_1::si_uid",
    ][::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_1, si_uid) - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_2 {
    pub si_tid: ::std::os::raw::c_int,
    pub si_overrun: ::std::os::raw::c_int,
    pub si_sigval: __sigval_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of siginfo_t__bindgen_ty_1__bindgen_ty_2",
    ][::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_2>() - 16usize];
    [
        "Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_2",
    ][::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    [
        "Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_2::si_tid",
    ][::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_2, si_tid) - 0usize];
    [
        "Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_2::si_overrun",
    ][::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_2, si_overrun)
        - 4usize];
    [
        "Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_2::si_sigval",
    ][::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_2, si_sigval) - 8usize];
};
impl ::std::fmt::Debug for siginfo_t__bindgen_ty_1__bindgen_ty_2 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "siginfo_t__bindgen_ty_1__bindgen_ty_2 {{ si_tid: {:?}, si_overrun: {:?}, si_sigval: {:?} }}",
            self.si_tid,
            self.si_overrun,
            self.si_sigval,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_3 {
    pub si_pid: __pid_t,
    pub si_uid: __uid_t,
    pub si_sigval: __sigval_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of siginfo_t__bindgen_ty_1__bindgen_ty_3",
    ][::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_3>() - 16usize];
    [
        "Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_3",
    ][::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_3>() - 8usize];
    [
        "Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_3::si_pid",
    ][::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_3, si_pid) - 0usize];
    [
        "Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_3::si_uid",
    ][::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_3, si_uid) - 4usize];
    [
        "Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_3::si_sigval",
    ][::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_3, si_sigval) - 8usize];
};
impl ::std::fmt::Debug for siginfo_t__bindgen_ty_1__bindgen_ty_3 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "siginfo_t__bindgen_ty_1__bindgen_ty_3 {{ si_pid: {:?}, si_uid: {:?}, si_sigval: {:?} }}",
            self.si_pid,
            self.si_uid,
            self.si_sigval,
        )
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_4 {
    pub si_pid: __pid_t,
    pub si_uid: __uid_t,
    pub si_status: ::std::os::raw::c_int,
    pub si_utime: __clock_t,
    pub si_stime: __clock_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of siginfo_t__bindgen_ty_1__bindgen_ty_4",
    ][::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_4>() - 32usize];
    [
        "Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_4",
    ][::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_4>() - 8usize];
    [
        "Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_4::si_pid",
    ][::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_4, si_pid) - 0usize];
    [
        "Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_4::si_uid",
    ][::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_4, si_uid) - 4usize];
    [
        "Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_4::si_status",
    ][::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_4, si_status) - 8usize];
    [
        "Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_4::si_utime",
    ][::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_4, si_utime) - 16usize];
    [
        "Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_4::si_stime",
    ][::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_4, si_stime) - 24usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_5 {
    pub si_addr: *mut ::std::os::raw::c_void,
    pub si_addr_lsb: ::std::os::raw::c_short,
    pub _bounds: siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1 {
    pub _addr_bnd: siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1,
    pub _pkey: __uint32_t,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1 {
    pub _lower: *mut ::std::os::raw::c_void,
    pub _upper: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1",
    ][::std::mem::size_of::<
        siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1,
    >() - 16usize];
    [
        "Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1",
    ][::std::mem::align_of::<
        siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1,
    >() - 8usize];
    [
        "Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1::_lower",
    ][::std::mem::offset_of!(
        siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1, _lower
    ) - 0usize];
    [
        "Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1::_upper",
    ][::std::mem::offset_of!(
        siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1, _upper
    ) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1",
    ][::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1>()
        - 16usize];
    [
        "Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1",
    ][::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1>()
        - 8usize];
    [
        "Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1::_addr_bnd",
    ][::std::mem::offset_of!(
        siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1, _addr_bnd
    ) - 0usize];
    [
        "Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1::_pkey",
    ][::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1, _pkey)
        - 0usize];
};
impl ::std::fmt::Debug for siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of siginfo_t__bindgen_ty_1__bindgen_ty_5",
    ][::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_5>() - 32usize];
    [
        "Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_5",
    ][::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_5>() - 8usize];
    [
        "Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_5::si_addr",
    ][::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_5, si_addr) - 0usize];
    [
        "Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_5::si_addr_lsb",
    ][::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_5, si_addr_lsb)
        - 8usize];
    [
        "Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_5::_bounds",
    ][::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_5, _bounds) - 16usize];
};
impl ::std::fmt::Debug for siginfo_t__bindgen_ty_1__bindgen_ty_5 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "siginfo_t__bindgen_ty_1__bindgen_ty_5 {{ si_addr: {:?}, si_addr_lsb: {:?}, _bounds: {:?} }}",
            self.si_addr,
            self.si_addr_lsb,
            self._bounds,
        )
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_6 {
    pub si_band: ::std::os::raw::c_long,
    pub si_fd: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of siginfo_t__bindgen_ty_1__bindgen_ty_6",
    ][::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_6>() - 16usize];
    [
        "Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_6",
    ][::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_6>() - 8usize];
    [
        "Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_6::si_band",
    ][::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_6, si_band) - 0usize];
    [
        "Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_6::si_fd",
    ][::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_6, si_fd) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_7 {
    pub _call_addr: *mut ::std::os::raw::c_void,
    pub _syscall: ::std::os::raw::c_int,
    pub _arch: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of siginfo_t__bindgen_ty_1__bindgen_ty_7",
    ][::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_7>() - 16usize];
    [
        "Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_7",
    ][::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_7>() - 8usize];
    [
        "Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_7::_call_addr",
    ][::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_7, _call_addr)
        - 0usize];
    [
        "Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_7::_syscall",
    ][::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_7, _syscall) - 8usize];
    [
        "Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_7::_arch",
    ][::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_7, _arch) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of siginfo_t__bindgen_ty_1",
    ][::std::mem::size_of::<siginfo_t__bindgen_ty_1>() - 112usize];
    [
        "Alignment of siginfo_t__bindgen_ty_1",
    ][::std::mem::align_of::<siginfo_t__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: siginfo_t__bindgen_ty_1::_pad",
    ][::std::mem::offset_of!(siginfo_t__bindgen_ty_1, _pad) - 0usize];
    [
        "Offset of field: siginfo_t__bindgen_ty_1::_kill",
    ][::std::mem::offset_of!(siginfo_t__bindgen_ty_1, _kill) - 0usize];
    [
        "Offset of field: siginfo_t__bindgen_ty_1::_timer",
    ][::std::mem::offset_of!(siginfo_t__bindgen_ty_1, _timer) - 0usize];
    [
        "Offset of field: siginfo_t__bindgen_ty_1::_rt",
    ][::std::mem::offset_of!(siginfo_t__bindgen_ty_1, _rt) - 0usize];
    [
        "Offset of field: siginfo_t__bindgen_ty_1::_sigchld",
    ][::std::mem::offset_of!(siginfo_t__bindgen_ty_1, _sigchld) - 0usize];
    [
        "Offset of field: siginfo_t__bindgen_ty_1::_sigfault",
    ][::std::mem::offset_of!(siginfo_t__bindgen_ty_1, _sigfault) - 0usize];
    [
        "Offset of field: siginfo_t__bindgen_ty_1::_sigpoll",
    ][::std::mem::offset_of!(siginfo_t__bindgen_ty_1, _sigpoll) - 0usize];
    [
        "Offset of field: siginfo_t__bindgen_ty_1::_sigsys",
    ][::std::mem::offset_of!(siginfo_t__bindgen_ty_1, _sigsys) - 0usize];
};
impl ::std::fmt::Debug for siginfo_t__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "siginfo_t__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t"][::std::mem::size_of::<siginfo_t>() - 128usize];
    ["Alignment of siginfo_t"][::std::mem::align_of::<siginfo_t>() - 8usize];
    [
        "Offset of field: siginfo_t::si_signo",
    ][::std::mem::offset_of!(siginfo_t, si_signo) - 0usize];
    [
        "Offset of field: siginfo_t::si_errno",
    ][::std::mem::offset_of!(siginfo_t, si_errno) - 4usize];
    [
        "Offset of field: siginfo_t::si_code",
    ][::std::mem::offset_of!(siginfo_t, si_code) - 8usize];
    [
        "Offset of field: siginfo_t::__pad0",
    ][::std::mem::offset_of!(siginfo_t, __pad0) - 12usize];
    [
        "Offset of field: siginfo_t::_sifields",
    ][::std::mem::offset_of!(siginfo_t, _sifields) - 16usize];
};
impl ::std::fmt::Debug for siginfo_t {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "siginfo_t {{ si_signo: {:?}, si_errno: {:?}, si_code: {:?}, __pad0: {:?}, _sifields: {:?} }}",
            self.si_signo,
            self.si_errno,
            self.si_code,
            self.__pad0,
            self._sifields,
        )
    }
}
pub type __sighandler_t = ::std::option::Option<
    unsafe extern "C" fn(arg1: ::std::os::raw::c_int),
>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sigaction {
    pub __sigaction_handler: sigaction__bindgen_ty_1,
    pub sa_mask: __sigset_t,
    pub sa_flags: ::std::os::raw::c_int,
    pub sa_restorer: ::std::option::Option<unsafe extern "C" fn()>,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union sigaction__bindgen_ty_1 {
    pub sa_handler: __sighandler_t,
    pub sa_sigaction: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: ::std::os::raw::c_int,
            arg2: *mut siginfo_t,
            arg3: *mut ::std::os::raw::c_void,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of sigaction__bindgen_ty_1",
    ][::std::mem::size_of::<sigaction__bindgen_ty_1>() - 8usize];
    [
        "Alignment of sigaction__bindgen_ty_1",
    ][::std::mem::align_of::<sigaction__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: sigaction__bindgen_ty_1::sa_handler",
    ][::std::mem::offset_of!(sigaction__bindgen_ty_1, sa_handler) - 0usize];
    [
        "Offset of field: sigaction__bindgen_ty_1::sa_sigaction",
    ][::std::mem::offset_of!(sigaction__bindgen_ty_1, sa_sigaction) - 0usize];
};
impl ::std::fmt::Debug for sigaction__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "sigaction__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigaction"][::std::mem::size_of::<sigaction>() - 152usize];
    ["Alignment of sigaction"][::std::mem::align_of::<sigaction>() - 8usize];
    [
        "Offset of field: sigaction::__sigaction_handler",
    ][::std::mem::offset_of!(sigaction, __sigaction_handler) - 0usize];
    [
        "Offset of field: sigaction::sa_mask",
    ][::std::mem::offset_of!(sigaction, sa_mask) - 8usize];
    [
        "Offset of field: sigaction::sa_flags",
    ][::std::mem::offset_of!(sigaction, sa_flags) - 136usize];
    [
        "Offset of field: sigaction::sa_restorer",
    ][::std::mem::offset_of!(sigaction, sa_restorer) - 144usize];
};
impl ::std::fmt::Debug for sigaction {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "sigaction {{ __sigaction_handler: {:?}, sa_mask: {:?}, sa_flags: {:?}, sa_restorer: {:?} }}",
            self.__sigaction_handler,
            self.sa_mask,
            self.sa_flags,
            self.sa_restorer,
        )
    }
}
pub type PERL_INTMAX_T = intmax_t;
pub type PERL_UINTMAX_T = uintmax_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stat {
    pub st_dev: __dev_t,
    pub st_ino: __ino_t,
    pub st_nlink: __nlink_t,
    pub st_mode: __mode_t,
    pub st_uid: __uid_t,
    pub st_gid: __gid_t,
    pub __pad0: ::std::os::raw::c_int,
    pub st_rdev: __dev_t,
    pub st_size: __off_t,
    pub st_blksize: __blksize_t,
    pub st_blocks: __blkcnt_t,
    pub st_atim: timespec,
    pub st_mtim: timespec,
    pub st_ctim: timespec,
    pub __glibc_reserved: [__syscall_slong_t; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of stat"][::std::mem::size_of::<stat>() - 144usize];
    ["Alignment of stat"][::std::mem::align_of::<stat>() - 8usize];
    ["Offset of field: stat::st_dev"][::std::mem::offset_of!(stat, st_dev) - 0usize];
    ["Offset of field: stat::st_ino"][::std::mem::offset_of!(stat, st_ino) - 8usize];
    [
        "Offset of field: stat::st_nlink",
    ][::std::mem::offset_of!(stat, st_nlink) - 16usize];
    ["Offset of field: stat::st_mode"][::std::mem::offset_of!(stat, st_mode) - 24usize];
    ["Offset of field: stat::st_uid"][::std::mem::offset_of!(stat, st_uid) - 28usize];
    ["Offset of field: stat::st_gid"][::std::mem::offset_of!(stat, st_gid) - 32usize];
    ["Offset of field: stat::__pad0"][::std::mem::offset_of!(stat, __pad0) - 36usize];
    ["Offset of field: stat::st_rdev"][::std::mem::offset_of!(stat, st_rdev) - 40usize];
    ["Offset of field: stat::st_size"][::std::mem::offset_of!(stat, st_size) - 48usize];
    [
        "Offset of field: stat::st_blksize",
    ][::std::mem::offset_of!(stat, st_blksize) - 56usize];
    [
        "Offset of field: stat::st_blocks",
    ][::std::mem::offset_of!(stat, st_blocks) - 64usize];
    ["Offset of field: stat::st_atim"][::std::mem::offset_of!(stat, st_atim) - 72usize];
    ["Offset of field: stat::st_mtim"][::std::mem::offset_of!(stat, st_mtim) - 88usize];
    ["Offset of field: stat::st_ctim"][::std::mem::offset_of!(stat, st_ctim) - 104usize];
    [
        "Offset of field: stat::__glibc_reserved",
    ][::std::mem::offset_of!(stat, __glibc_reserved) - 120usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_long,
    pub tm_zone: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tm"][::std::mem::size_of::<tm>() - 56usize];
    ["Alignment of tm"][::std::mem::align_of::<tm>() - 8usize];
    ["Offset of field: tm::tm_sec"][::std::mem::offset_of!(tm, tm_sec) - 0usize];
    ["Offset of field: tm::tm_min"][::std::mem::offset_of!(tm, tm_min) - 4usize];
    ["Offset of field: tm::tm_hour"][::std::mem::offset_of!(tm, tm_hour) - 8usize];
    ["Offset of field: tm::tm_mday"][::std::mem::offset_of!(tm, tm_mday) - 12usize];
    ["Offset of field: tm::tm_mon"][::std::mem::offset_of!(tm, tm_mon) - 16usize];
    ["Offset of field: tm::tm_year"][::std::mem::offset_of!(tm, tm_year) - 20usize];
    ["Offset of field: tm::tm_wday"][::std::mem::offset_of!(tm, tm_wday) - 24usize];
    ["Offset of field: tm::tm_yday"][::std::mem::offset_of!(tm, tm_yday) - 28usize];
    ["Offset of field: tm::tm_isdst"][::std::mem::offset_of!(tm, tm_isdst) - 32usize];
    ["Offset of field: tm::tm_gmtoff"][::std::mem::offset_of!(tm, tm_gmtoff) - 40usize];
    ["Offset of field: tm::tm_zone"][::std::mem::offset_of!(tm, tm_zone) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct netent {
    pub n_name: *mut ::std::os::raw::c_char,
    pub n_aliases: *mut *mut ::std::os::raw::c_char,
    pub n_addrtype: ::std::os::raw::c_int,
    pub n_net: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of netent"][::std::mem::size_of::<netent>() - 24usize];
    ["Alignment of netent"][::std::mem::align_of::<netent>() - 8usize];
    ["Offset of field: netent::n_name"][::std::mem::offset_of!(netent, n_name) - 0usize];
    [
        "Offset of field: netent::n_aliases",
    ][::std::mem::offset_of!(netent, n_aliases) - 8usize];
    [
        "Offset of field: netent::n_addrtype",
    ][::std::mem::offset_of!(netent, n_addrtype) - 16usize];
    ["Offset of field: netent::n_net"][::std::mem::offset_of!(netent, n_net) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hostent {
    pub h_name: *mut ::std::os::raw::c_char,
    pub h_aliases: *mut *mut ::std::os::raw::c_char,
    pub h_addrtype: ::std::os::raw::c_int,
    pub h_length: ::std::os::raw::c_int,
    pub h_addr_list: *mut *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hostent"][::std::mem::size_of::<hostent>() - 32usize];
    ["Alignment of hostent"][::std::mem::align_of::<hostent>() - 8usize];
    [
        "Offset of field: hostent::h_name",
    ][::std::mem::offset_of!(hostent, h_name) - 0usize];
    [
        "Offset of field: hostent::h_aliases",
    ][::std::mem::offset_of!(hostent, h_aliases) - 8usize];
    [
        "Offset of field: hostent::h_addrtype",
    ][::std::mem::offset_of!(hostent, h_addrtype) - 16usize];
    [
        "Offset of field: hostent::h_length",
    ][::std::mem::offset_of!(hostent, h_length) - 20usize];
    [
        "Offset of field: hostent::h_addr_list",
    ][::std::mem::offset_of!(hostent, h_addr_list) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct servent {
    pub s_name: *mut ::std::os::raw::c_char,
    pub s_aliases: *mut *mut ::std::os::raw::c_char,
    pub s_port: ::std::os::raw::c_int,
    pub s_proto: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of servent"][::std::mem::size_of::<servent>() - 32usize];
    ["Alignment of servent"][::std::mem::align_of::<servent>() - 8usize];
    [
        "Offset of field: servent::s_name",
    ][::std::mem::offset_of!(servent, s_name) - 0usize];
    [
        "Offset of field: servent::s_aliases",
    ][::std::mem::offset_of!(servent, s_aliases) - 8usize];
    [
        "Offset of field: servent::s_port",
    ][::std::mem::offset_of!(servent, s_port) - 16usize];
    [
        "Offset of field: servent::s_proto",
    ][::std::mem::offset_of!(servent, s_proto) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct protoent {
    pub p_name: *mut ::std::os::raw::c_char,
    pub p_aliases: *mut *mut ::std::os::raw::c_char,
    pub p_proto: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of protoent"][::std::mem::size_of::<protoent>() - 24usize];
    ["Alignment of protoent"][::std::mem::align_of::<protoent>() - 8usize];
    [
        "Offset of field: protoent::p_name",
    ][::std::mem::offset_of!(protoent, p_name) - 0usize];
    [
        "Offset of field: protoent::p_aliases",
    ][::std::mem::offset_of!(protoent, p_aliases) - 8usize];
    [
        "Offset of field: protoent::p_proto",
    ][::std::mem::offset_of!(protoent, p_proto) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __dirstream {
    _unused: [u8; 0],
}
pub type DIR = __dirstream;
pub type IV = ::std::os::raw::c_long;
pub type UV = ::std::os::raw::c_ulong;
pub type NV = f64;
pub type STRLEN = usize;
pub type OP = op;
pub type COP = cop;
pub type UNOP = unop;
pub type UNOP_AUX = unop_aux;
pub type BINOP = binop;
pub type LISTOP = listop;
pub type LOGOP = logop;
pub type PMOP = pmop;
pub type SVOP = svop;
pub type PADOP = padop;
pub type PVOP = pvop;
pub type LOOP = loop_;
pub type METHOP = methop;
pub type OPSLAB = opslab;
pub type OPSLOT = opslot;
pub type BHK = block_hooks;
pub type XOP = custom_op;
pub type PerlInterpreter = interpreter;
pub type SV = sv;
pub type AV = av;
pub type HV = hv;
pub type CV = cv;
pub type REGEXP = p5rx;
pub type GP = gp;
pub type GV = gv;
pub type IO = io;
pub type PERL_CONTEXT = context;
pub type BLOCK = block;
pub type INVLIST = invlist;
pub type MAGIC = magic;
pub type XPV = xpv;
pub type XPVIV = xpviv;
pub type XPVUV = xpvuv;
pub type XPVNV = xpvnv;
pub type XPVMG = xpvmg;
pub type XPVLV = xpvlv;
pub type XINVLIST = xpvinvlist;
pub type XPVAV = xpvav;
pub type XPVHV = xpvhv;
pub type XPVGV = xpvgv;
pub type XPVCV = xpvcv;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xpvbm {
    _unused: [u8; 0],
}
pub type XPVBM = xpvbm;
pub type XPVFM = xpvfm;
pub type XPVIO = xpvio;
pub type XPVOBJ = xobject;
pub type MGVTBL = mgvtbl;
pub type ANY = any;
pub type PTR_TBL_ENT_t = ptr_tbl_ent;
pub type PTR_TBL_t = ptr_tbl;
pub type CLONE_PARAMS = clone_params;
pub type PADLIST = padlist;
pub type PAD = AV;
pub type PADNAMELIST = padnamelist;
pub type PADNAME = padname;
pub type I8 = ::std::os::raw::c_schar;
pub type U8 = ::std::os::raw::c_uchar;
pub type I16 = ::std::os::raw::c_short;
pub type U16 = ::std::os::raw::c_ushort;
pub type I32 = ::std::os::raw::c_int;
pub type U32 = ::std::os::raw::c_uint;
pub type U64 = ::std::os::raw::c_ulong;
pub type PERL_INT_FAST8_T = int_fast8_t;
pub type PERL_UINT_FAST8_T = uint_fast8_t;
unsafe extern "C" {
    pub static PL_charclass: [U32; 256usize];
}
pub type line_t = U32;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum SCX_enum {
    SCX_Unknown = 0,
    SCX_Adlam = 1,
    SCX_Ahom = 2,
    SCX_Anatolian_Hieroglyphs = 3,
    SCX_Arabic = 4,
    SCX_Armenian = 5,
    SCX_Avestan = 6,
    SCX_Balinese = 7,
    SCX_Bamum = 8,
    SCX_Bassa_Vah = 9,
    SCX_Batak = 10,
    SCX_Bengali = 11,
    SCX_Bhaiksuki = 12,
    SCX_Bopomofo = 13,
    SCX_Brahmi = 14,
    SCX_Braille = 15,
    SCX_Buginese = 16,
    SCX_Buhid = 17,
    SCX_Canadian_Aboriginal = 18,
    SCX_Carian = 19,
    SCX_Caucasian_Albanian = 20,
    SCX_Chakma = 21,
    SCX_Cham = 22,
    SCX_Cherokee = 23,
    SCX_Chorasmian = 24,
    SCX_Common = 25,
    SCX_Coptic = 26,
    SCX_Cuneiform = 27,
    SCX_Cypriot = 28,
    SCX_Cypro_Minoan = 29,
    SCX_Cyrillic = 30,
    SCX_Deseret = 31,
    SCX_Devanagari = 32,
    SCX_Dives_Akuru = 33,
    SCX_Dogra = 34,
    SCX_Duployan = 35,
    SCX_Egyptian_Hieroglyphs = 36,
    SCX_Elbasan = 37,
    SCX_Elymaic = 38,
    SCX_Ethiopic = 39,
    SCX_Georgian = 40,
    SCX_Glagolitic = 41,
    SCX_Gothic = 42,
    SCX_Grantha = 43,
    SCX_Greek = 44,
    SCX_Gujarati = 45,
    SCX_Gunjala_Gondi = 46,
    SCX_Gurmukhi = 47,
    SCX_Han = 48,
    SCX_Hanb = 49,
    SCX_Hangul = 50,
    SCX_Hanifi_Rohingya = 51,
    SCX_Hanunoo = 52,
    SCX_Hatran = 53,
    SCX_Hebrew = 54,
    SCX_Hiragana = 55,
    SCX_Imperial_Aramaic = 56,
    SCX_Inherited = 57,
    SCX_Inscriptional_Pahlavi = 58,
    SCX_Inscriptional_Parthian = 59,
    SCX_INVALID = 60,
    SCX_Javanese = 61,
    SCX_Jpan = 62,
    SCX_Kaithi = 63,
    SCX_Kannada = 64,
    SCX_Katakana = 65,
    SCX_Kawi = 66,
    SCX_Kayah_Li = 67,
    SCX_Kharoshthi = 68,
    SCX_Khitan_Small_Script = 69,
    SCX_Khmer = 70,
    SCX_Khojki = 71,
    SCX_Khudawadi = 72,
    SCX_Kore = 73,
    SCX_Lao = 74,
    SCX_Latin = 75,
    SCX_Lepcha = 76,
    SCX_Limbu = 77,
    SCX_Linear_A = 78,
    SCX_Linear_B = 79,
    SCX_Lisu = 80,
    SCX_Lycian = 81,
    SCX_Lydian = 82,
    SCX_Mahajani = 83,
    SCX_Makasar = 84,
    SCX_Malayalam = 85,
    SCX_Mandaic = 86,
    SCX_Manichaean = 87,
    SCX_Marchen = 88,
    SCX_Masaram_Gondi = 89,
    SCX_Medefaidrin = 90,
    SCX_Meetei_Mayek = 91,
    SCX_Mende_Kikakui = 92,
    SCX_Meroitic_Cursive = 93,
    SCX_Meroitic_Hieroglyphs = 94,
    SCX_Miao = 95,
    SCX_Modi = 96,
    SCX_Mongolian = 97,
    SCX_Mro = 98,
    SCX_Multani = 99,
    SCX_Myanmar = 100,
    SCX_Nabataean = 101,
    SCX_Nag_Mundari = 102,
    SCX_Nandinagari = 103,
    SCX_New_Tai_Lue = 104,
    SCX_Newa = 105,
    SCX_Nko = 106,
    SCX_Nushu = 107,
    SCX_Nyiakeng_Puachue_Hmong = 108,
    SCX_Ogham = 109,
    SCX_Ol_Chiki = 110,
    SCX_Old_Hungarian = 111,
    SCX_Old_Italic = 112,
    SCX_Old_North_Arabian = 113,
    SCX_Old_Permic = 114,
    SCX_Old_Persian = 115,
    SCX_Old_Sogdian = 116,
    SCX_Old_South_Arabian = 117,
    SCX_Old_Turkic = 118,
    SCX_Old_Uyghur = 119,
    SCX_Oriya = 120,
    SCX_Osage = 121,
    SCX_Osmanya = 122,
    SCX_Pahawh_Hmong = 123,
    SCX_Palmyrene = 124,
    SCX_Pau_Cin_Hau = 125,
    SCX_Phags_Pa = 126,
    SCX_Phoenician = 127,
    SCX_Psalter_Pahlavi = 128,
    SCX_Rejang = 129,
    SCX_Runic = 130,
    SCX_Samaritan = 131,
    SCX_Saurashtra = 132,
    SCX_Sharada = 133,
    SCX_Shavian = 134,
    SCX_Siddham = 135,
    SCX_SignWriting = 136,
    SCX_Sinhala = 137,
    SCX_Sogdian = 138,
    SCX_Sora_Sompeng = 139,
    SCX_Soyombo = 140,
    SCX_Sundanese = 141,
    SCX_Syloti_Nagri = 142,
    SCX_Syriac = 143,
    SCX_Tagalog = 144,
    SCX_Tagbanwa = 145,
    SCX_Tai_Le = 146,
    SCX_Tai_Tham = 147,
    SCX_Tai_Viet = 148,
    SCX_Takri = 149,
    SCX_Tamil = 150,
    SCX_Tangsa = 151,
    SCX_Tangut = 152,
    SCX_Telugu = 153,
    SCX_Thaana = 154,
    SCX_Thai = 155,
    SCX_Tibetan = 156,
    SCX_Tifinagh = 157,
    SCX_Tirhuta = 158,
    SCX_Toto = 159,
    SCX_Ugaritic = 160,
    SCX_Vai = 161,
    SCX_Vithkuqi = 162,
    SCX_Wancho = 163,
    SCX_Warang_Citi = 164,
    SCX_Yezidi = 165,
    SCX_Yi = 166,
    SCX_Zanabazar_Square = 167,
    SCX_use_AUX_TABLE_1 = -1,
    SCX_use_AUX_TABLE_2 = -2,
    SCX_use_AUX_TABLE_3 = -3,
    SCX_use_AUX_TABLE_4 = -4,
    SCX_use_AUX_TABLE_5 = -5,
    SCX_use_AUX_TABLE_6 = -6,
    SCX_use_AUX_TABLE_7 = -7,
    SCX_use_AUX_TABLE_8 = -8,
    SCX_use_AUX_TABLE_9 = -9,
    SCX_use_AUX_TABLE_10 = -10,
    SCX_use_AUX_TABLE_11 = -11,
    SCX_use_AUX_TABLE_12 = -12,
    SCX_use_AUX_TABLE_13 = -13,
    SCX_use_AUX_TABLE_14 = -14,
    SCX_use_AUX_TABLE_15 = -15,
    SCX_use_AUX_TABLE_16 = -16,
    SCX_use_AUX_TABLE_17 = -17,
    SCX_use_AUX_TABLE_18 = -18,
    SCX_use_AUX_TABLE_19 = -19,
    SCX_use_AUX_TABLE_20 = -20,
    SCX_use_AUX_TABLE_21 = -21,
    SCX_use_AUX_TABLE_22 = -22,
    SCX_use_AUX_TABLE_23 = -23,
    SCX_use_AUX_TABLE_24 = -24,
    SCX_use_AUX_TABLE_25 = -25,
    SCX_use_AUX_TABLE_26 = -26,
    SCX_use_AUX_TABLE_27 = -27,
    SCX_use_AUX_TABLE_28 = -28,
    SCX_use_AUX_TABLE_29 = -29,
    SCX_use_AUX_TABLE_30 = -30,
    SCX_use_AUX_TABLE_31 = -31,
    SCX_use_AUX_TABLE_32 = -32,
    SCX_use_AUX_TABLE_33 = -33,
    SCX_use_AUX_TABLE_34 = -34,
    SCX_use_AUX_TABLE_35 = -35,
    SCX_use_AUX_TABLE_36 = -36,
    SCX_use_AUX_TABLE_37 = -37,
    SCX_use_AUX_TABLE_38 = -38,
    SCX_use_AUX_TABLE_39 = -39,
    SCX_use_AUX_TABLE_40 = -40,
    SCX_use_AUX_TABLE_41 = -41,
    SCX_use_AUX_TABLE_42 = -42,
    SCX_use_AUX_TABLE_43 = -43,
    SCX_use_AUX_TABLE_44 = -44,
    SCX_use_AUX_TABLE_45 = -45,
    SCX_use_AUX_TABLE_46 = -46,
    SCX_use_AUX_TABLE_47 = -47,
    SCX_use_AUX_TABLE_48 = -48,
    SCX_use_AUX_TABLE_49 = -49,
    SCX_use_AUX_TABLE_50 = -50,
    SCX_use_AUX_TABLE_51 = -51,
    SCX_use_AUX_TABLE_52 = -52,
    SCX_use_AUX_TABLE_53 = -53,
    SCX_use_AUX_TABLE_54 = -54,
    SCX_use_AUX_TABLE_55 = -55,
    SCX_use_AUX_TABLE_56 = -56,
    SCX_use_AUX_TABLE_57 = -57,
    SCX_use_AUX_TABLE_58 = -58,
    SCX_use_AUX_TABLE_59 = -59,
}
pub type Siginfo_t = siginfo_t;
pub type perl_os_thread = pthread_t;
pub type perl_mutex = pthread_mutex_t;
pub type perl_cond = pthread_cond_t;
pub type perl_key = pthread_key_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct perl_RnW1_mutex_t {
    pub lock: perl_mutex,
    pub wakeup: perl_cond,
    pub readers_count: isize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of perl_RnW1_mutex_t"][::std::mem::size_of::<perl_RnW1_mutex_t>() - 96usize];
    [
        "Alignment of perl_RnW1_mutex_t",
    ][::std::mem::align_of::<perl_RnW1_mutex_t>() - 8usize];
    [
        "Offset of field: perl_RnW1_mutex_t::lock",
    ][::std::mem::offset_of!(perl_RnW1_mutex_t, lock) - 0usize];
    [
        "Offset of field: perl_RnW1_mutex_t::wakeup",
    ][::std::mem::offset_of!(perl_RnW1_mutex_t, wakeup) - 40usize];
    [
        "Offset of field: perl_RnW1_mutex_t::readers_count",
    ][::std::mem::offset_of!(perl_RnW1_mutex_t, readers_count) - 88usize];
};
impl ::std::fmt::Debug for perl_RnW1_mutex_t {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "perl_RnW1_mutex_t {{ lock: {:?}, wakeup: {:?} }}",
            self.lock,
            self.wakeup,
        )
    }
}
unsafe extern "C" {
    pub fn perl_tsa_mutex_lock(mutex: *mut perl_mutex) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn perl_tsa_mutex_unlock(mutex: *mut perl_mutex) -> ::std::os::raw::c_int;
}
pub type Stack_off_t = I32;
#[repr(C)]
#[derive(Copy, Clone)]
pub union any {
    pub any_ptr: *mut ::std::os::raw::c_void,
    pub any_sv: *mut SV,
    pub any_svp: *mut *mut SV,
    pub any_gv: *mut GV,
    pub any_av: *mut AV,
    pub any_hv: *mut HV,
    pub any_op: *mut OP,
    pub any_pv: *mut ::std::os::raw::c_char,
    pub any_pvp: *mut *mut ::std::os::raw::c_char,
    pub any_i32: I32,
    pub any_u32: U32,
    pub any_iv: IV,
    pub any_uv: UV,
    pub any_long: ::std::os::raw::c_long,
    pub any_bool: bool,
    pub any_size: usize,
    pub any_ssize: isize,
    pub any_strlen: STRLEN,
    pub any_dptr: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void),
    >,
    pub any_dxptr: ::std::option::Option<
        unsafe extern "C" fn(
            my_perl: *mut PerlInterpreter,
            arg1: *mut ::std::os::raw::c_void,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of any"][::std::mem::size_of::<any>() - 8usize];
    ["Alignment of any"][::std::mem::align_of::<any>() - 8usize];
    ["Offset of field: any::any_ptr"][::std::mem::offset_of!(any, any_ptr) - 0usize];
    ["Offset of field: any::any_sv"][::std::mem::offset_of!(any, any_sv) - 0usize];
    ["Offset of field: any::any_svp"][::std::mem::offset_of!(any, any_svp) - 0usize];
    ["Offset of field: any::any_gv"][::std::mem::offset_of!(any, any_gv) - 0usize];
    ["Offset of field: any::any_av"][::std::mem::offset_of!(any, any_av) - 0usize];
    ["Offset of field: any::any_hv"][::std::mem::offset_of!(any, any_hv) - 0usize];
    ["Offset of field: any::any_op"][::std::mem::offset_of!(any, any_op) - 0usize];
    ["Offset of field: any::any_pv"][::std::mem::offset_of!(any, any_pv) - 0usize];
    ["Offset of field: any::any_pvp"][::std::mem::offset_of!(any, any_pvp) - 0usize];
    ["Offset of field: any::any_i32"][::std::mem::offset_of!(any, any_i32) - 0usize];
    ["Offset of field: any::any_u32"][::std::mem::offset_of!(any, any_u32) - 0usize];
    ["Offset of field: any::any_iv"][::std::mem::offset_of!(any, any_iv) - 0usize];
    ["Offset of field: any::any_uv"][::std::mem::offset_of!(any, any_uv) - 0usize];
    ["Offset of field: any::any_long"][::std::mem::offset_of!(any, any_long) - 0usize];
    ["Offset of field: any::any_bool"][::std::mem::offset_of!(any, any_bool) - 0usize];
    ["Offset of field: any::any_size"][::std::mem::offset_of!(any, any_size) - 0usize];
    ["Offset of field: any::any_ssize"][::std::mem::offset_of!(any, any_ssize) - 0usize];
    [
        "Offset of field: any::any_strlen",
    ][::std::mem::offset_of!(any, any_strlen) - 0usize];
    ["Offset of field: any::any_dptr"][::std::mem::offset_of!(any, any_dptr) - 0usize];
    ["Offset of field: any::any_dxptr"][::std::mem::offset_of!(any, any_dxptr) - 0usize];
};
impl ::std::fmt::Debug for any {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "any {{ union }}")
    }
}
pub type filter_t = ::std::option::Option<
    unsafe extern "C" fn(
        my_perl: *mut PerlInterpreter,
        arg1: ::std::os::raw::c_int,
        arg2: *mut SV,
        arg3: ::std::os::raw::c_int,
    ) -> I32,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PerlIO {
    _unused: [u8; 0],
}
pub type PerlIOl = _PerlIO;
pub type PerlIO = *mut PerlIOl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PerlIO_list_s {
    _unused: [u8; 0],
}
pub type PerlIO_list_t = PerlIO_list_s;
pub type Sighandler1_t = ::std::option::Option<
    unsafe extern "C" fn(arg1: ::std::os::raw::c_int),
>;
pub type Sighandler3_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: ::std::os::raw::c_int,
        arg2: *mut Siginfo_t,
        arg3: *mut ::std::os::raw::c_void,
    ),
>;
pub type Sighandler_t = Sighandler1_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union YYSTYPE {
    pub ival: I32,
    pub pval: *mut ::std::os::raw::c_void,
    pub opval: *mut OP,
    pub gvval: *mut GV,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of YYSTYPE"][::std::mem::size_of::<YYSTYPE>() - 8usize];
    ["Alignment of YYSTYPE"][::std::mem::align_of::<YYSTYPE>() - 8usize];
    ["Offset of field: YYSTYPE::ival"][::std::mem::offset_of!(YYSTYPE, ival) - 0usize];
    ["Offset of field: YYSTYPE::pval"][::std::mem::offset_of!(YYSTYPE, pval) - 0usize];
    ["Offset of field: YYSTYPE::opval"][::std::mem::offset_of!(YYSTYPE, opval) - 0usize];
    ["Offset of field: YYSTYPE::gvval"][::std::mem::offset_of!(YYSTYPE, gvval) - 0usize];
};
impl ::std::fmt::Debug for YYSTYPE {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "YYSTYPE {{ union }}")
    }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum svtype {
    SVt_NULL = 0,
    SVt_IV = 1,
    SVt_NV = 2,
    SVt_PV = 3,
    SVt_INVLIST = 4,
    SVt_PVIV = 5,
    SVt_PVNV = 6,
    SVt_PVMG = 7,
    SVt_REGEXP = 8,
    SVt_PVGV = 9,
    SVt_PVLV = 10,
    SVt_PVAV = 11,
    SVt_PVHV = 12,
    SVt_PVCV = 13,
    SVt_PVFM = 14,
    SVt_PVIO = 15,
    SVt_PVOBJ = 16,
    SVt_LAST = 17,
}
pub type HE = he;
pub type HEK = hek;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sv {
    pub sv_any: *mut ::std::os::raw::c_void,
    pub sv_refcnt: U32,
    pub sv_flags: U32,
    pub sv_u: sv__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union sv__bindgen_ty_1 {
    pub svu_pv: *mut ::std::os::raw::c_char,
    pub svu_iv: IV,
    pub svu_uv: UV,
    pub svu_nv: NV,
    pub svu_rv: *mut SV,
    pub svu_array: *mut *mut SV,
    pub svu_hash: *mut *mut HE,
    pub svu_gp: *mut GP,
    pub svu_fp: *mut PerlIO,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sv__bindgen_ty_1"][::std::mem::size_of::<sv__bindgen_ty_1>() - 8usize];
    [
        "Alignment of sv__bindgen_ty_1",
    ][::std::mem::align_of::<sv__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: sv__bindgen_ty_1::svu_pv",
    ][::std::mem::offset_of!(sv__bindgen_ty_1, svu_pv) - 0usize];
    [
        "Offset of field: sv__bindgen_ty_1::svu_iv",
    ][::std::mem::offset_of!(sv__bindgen_ty_1, svu_iv) - 0usize];
    [
        "Offset of field: sv__bindgen_ty_1::svu_uv",
    ][::std::mem::offset_of!(sv__bindgen_ty_1, svu_uv) - 0usize];
    [
        "Offset of field: sv__bindgen_ty_1::svu_nv",
    ][::std::mem::offset_of!(sv__bindgen_ty_1, svu_nv) - 0usize];
    [
        "Offset of field: sv__bindgen_ty_1::svu_rv",
    ][::std::mem::offset_of!(sv__bindgen_ty_1, svu_rv) - 0usize];
    [
        "Offset of field: sv__bindgen_ty_1::svu_array",
    ][::std::mem::offset_of!(sv__bindgen_ty_1, svu_array) - 0usize];
    [
        "Offset of field: sv__bindgen_ty_1::svu_hash",
    ][::std::mem::offset_of!(sv__bindgen_ty_1, svu_hash) - 0usize];
    [
        "Offset of field: sv__bindgen_ty_1::svu_gp",
    ][::std::mem::offset_of!(sv__bindgen_ty_1, svu_gp) - 0usize];
    [
        "Offset of field: sv__bindgen_ty_1::svu_fp",
    ][::std::mem::offset_of!(sv__bindgen_ty_1, svu_fp) - 0usize];
};
impl ::std::fmt::Debug for sv__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "sv__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sv"][::std::mem::size_of::<sv>() - 24usize];
    ["Alignment of sv"][::std::mem::align_of::<sv>() - 8usize];
    ["Offset of field: sv::sv_any"][::std::mem::offset_of!(sv, sv_any) - 0usize];
    ["Offset of field: sv::sv_refcnt"][::std::mem::offset_of!(sv, sv_refcnt) - 8usize];
    ["Offset of field: sv::sv_flags"][::std::mem::offset_of!(sv, sv_flags) - 12usize];
    ["Offset of field: sv::sv_u"][::std::mem::offset_of!(sv, sv_u) - 16usize];
};
impl ::std::fmt::Debug for sv {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "sv {{ sv_any: {:?}, sv_refcnt: {:?}, sv_flags: {:?}, sv_u: {:?} }}",
            self.sv_any,
            self.sv_refcnt,
            self.sv_flags,
            self.sv_u,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct gv {
    pub sv_any: *mut XPVGV,
    pub sv_refcnt: U32,
    pub sv_flags: U32,
    pub sv_u: gv__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union gv__bindgen_ty_1 {
    pub svu_pv: *mut ::std::os::raw::c_char,
    pub svu_iv: IV,
    pub svu_uv: UV,
    pub svu_nv: NV,
    pub svu_rv: *mut SV,
    pub svu_array: *mut *mut SV,
    pub svu_hash: *mut *mut HE,
    pub svu_gp: *mut GP,
    pub svu_fp: *mut PerlIO,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gv__bindgen_ty_1"][::std::mem::size_of::<gv__bindgen_ty_1>() - 8usize];
    [
        "Alignment of gv__bindgen_ty_1",
    ][::std::mem::align_of::<gv__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: gv__bindgen_ty_1::svu_pv",
    ][::std::mem::offset_of!(gv__bindgen_ty_1, svu_pv) - 0usize];
    [
        "Offset of field: gv__bindgen_ty_1::svu_iv",
    ][::std::mem::offset_of!(gv__bindgen_ty_1, svu_iv) - 0usize];
    [
        "Offset of field: gv__bindgen_ty_1::svu_uv",
    ][::std::mem::offset_of!(gv__bindgen_ty_1, svu_uv) - 0usize];
    [
        "Offset of field: gv__bindgen_ty_1::svu_nv",
    ][::std::mem::offset_of!(gv__bindgen_ty_1, svu_nv) - 0usize];
    [
        "Offset of field: gv__bindgen_ty_1::svu_rv",
    ][::std::mem::offset_of!(gv__bindgen_ty_1, svu_rv) - 0usize];
    [
        "Offset of field: gv__bindgen_ty_1::svu_array",
    ][::std::mem::offset_of!(gv__bindgen_ty_1, svu_array) - 0usize];
    [
        "Offset of field: gv__bindgen_ty_1::svu_hash",
    ][::std::mem::offset_of!(gv__bindgen_ty_1, svu_hash) - 0usize];
    [
        "Offset of field: gv__bindgen_ty_1::svu_gp",
    ][::std::mem::offset_of!(gv__bindgen_ty_1, svu_gp) - 0usize];
    [
        "Offset of field: gv__bindgen_ty_1::svu_fp",
    ][::std::mem::offset_of!(gv__bindgen_ty_1, svu_fp) - 0usize];
};
impl ::std::fmt::Debug for gv__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "gv__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gv"][::std::mem::size_of::<gv>() - 24usize];
    ["Alignment of gv"][::std::mem::align_of::<gv>() - 8usize];
    ["Offset of field: gv::sv_any"][::std::mem::offset_of!(gv, sv_any) - 0usize];
    ["Offset of field: gv::sv_refcnt"][::std::mem::offset_of!(gv, sv_refcnt) - 8usize];
    ["Offset of field: gv::sv_flags"][::std::mem::offset_of!(gv, sv_flags) - 12usize];
    ["Offset of field: gv::sv_u"][::std::mem::offset_of!(gv, sv_u) - 16usize];
};
impl ::std::fmt::Debug for gv {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "gv {{ sv_any: {:?}, sv_refcnt: {:?}, sv_flags: {:?}, sv_u: {:?} }}",
            self.sv_any,
            self.sv_refcnt,
            self.sv_flags,
            self.sv_u,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cv {
    pub sv_any: *mut XPVCV,
    pub sv_refcnt: U32,
    pub sv_flags: U32,
    pub sv_u: cv__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cv__bindgen_ty_1 {
    pub svu_pv: *mut ::std::os::raw::c_char,
    pub svu_iv: IV,
    pub svu_uv: UV,
    pub svu_nv: NV,
    pub svu_rv: *mut SV,
    pub svu_array: *mut *mut SV,
    pub svu_hash: *mut *mut HE,
    pub svu_gp: *mut GP,
    pub svu_fp: *mut PerlIO,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cv__bindgen_ty_1"][::std::mem::size_of::<cv__bindgen_ty_1>() - 8usize];
    [
        "Alignment of cv__bindgen_ty_1",
    ][::std::mem::align_of::<cv__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: cv__bindgen_ty_1::svu_pv",
    ][::std::mem::offset_of!(cv__bindgen_ty_1, svu_pv) - 0usize];
    [
        "Offset of field: cv__bindgen_ty_1::svu_iv",
    ][::std::mem::offset_of!(cv__bindgen_ty_1, svu_iv) - 0usize];
    [
        "Offset of field: cv__bindgen_ty_1::svu_uv",
    ][::std::mem::offset_of!(cv__bindgen_ty_1, svu_uv) - 0usize];
    [
        "Offset of field: cv__bindgen_ty_1::svu_nv",
    ][::std::mem::offset_of!(cv__bindgen_ty_1, svu_nv) - 0usize];
    [
        "Offset of field: cv__bindgen_ty_1::svu_rv",
    ][::std::mem::offset_of!(cv__bindgen_ty_1, svu_rv) - 0usize];
    [
        "Offset of field: cv__bindgen_ty_1::svu_array",
    ][::std::mem::offset_of!(cv__bindgen_ty_1, svu_array) - 0usize];
    [
        "Offset of field: cv__bindgen_ty_1::svu_hash",
    ][::std::mem::offset_of!(cv__bindgen_ty_1, svu_hash) - 0usize];
    [
        "Offset of field: cv__bindgen_ty_1::svu_gp",
    ][::std::mem::offset_of!(cv__bindgen_ty_1, svu_gp) - 0usize];
    [
        "Offset of field: cv__bindgen_ty_1::svu_fp",
    ][::std::mem::offset_of!(cv__bindgen_ty_1, svu_fp) - 0usize];
};
impl ::std::fmt::Debug for cv__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "cv__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cv"][::std::mem::size_of::<cv>() - 24usize];
    ["Alignment of cv"][::std::mem::align_of::<cv>() - 8usize];
    ["Offset of field: cv::sv_any"][::std::mem::offset_of!(cv, sv_any) - 0usize];
    ["Offset of field: cv::sv_refcnt"][::std::mem::offset_of!(cv, sv_refcnt) - 8usize];
    ["Offset of field: cv::sv_flags"][::std::mem::offset_of!(cv, sv_flags) - 12usize];
    ["Offset of field: cv::sv_u"][::std::mem::offset_of!(cv, sv_u) - 16usize];
};
impl ::std::fmt::Debug for cv {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "cv {{ sv_any: {:?}, sv_refcnt: {:?}, sv_flags: {:?}, sv_u: {:?} }}",
            self.sv_any,
            self.sv_refcnt,
            self.sv_flags,
            self.sv_u,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct av {
    pub sv_any: *mut XPVAV,
    pub sv_refcnt: U32,
    pub sv_flags: U32,
    pub sv_u: av__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union av__bindgen_ty_1 {
    pub svu_pv: *mut ::std::os::raw::c_char,
    pub svu_iv: IV,
    pub svu_uv: UV,
    pub svu_nv: NV,
    pub svu_rv: *mut SV,
    pub svu_array: *mut *mut SV,
    pub svu_hash: *mut *mut HE,
    pub svu_gp: *mut GP,
    pub svu_fp: *mut PerlIO,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of av__bindgen_ty_1"][::std::mem::size_of::<av__bindgen_ty_1>() - 8usize];
    [
        "Alignment of av__bindgen_ty_1",
    ][::std::mem::align_of::<av__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: av__bindgen_ty_1::svu_pv",
    ][::std::mem::offset_of!(av__bindgen_ty_1, svu_pv) - 0usize];
    [
        "Offset of field: av__bindgen_ty_1::svu_iv",
    ][::std::mem::offset_of!(av__bindgen_ty_1, svu_iv) - 0usize];
    [
        "Offset of field: av__bindgen_ty_1::svu_uv",
    ][::std::mem::offset_of!(av__bindgen_ty_1, svu_uv) - 0usize];
    [
        "Offset of field: av__bindgen_ty_1::svu_nv",
    ][::std::mem::offset_of!(av__bindgen_ty_1, svu_nv) - 0usize];
    [
        "Offset of field: av__bindgen_ty_1::svu_rv",
    ][::std::mem::offset_of!(av__bindgen_ty_1, svu_rv) - 0usize];
    [
        "Offset of field: av__bindgen_ty_1::svu_array",
    ][::std::mem::offset_of!(av__bindgen_ty_1, svu_array) - 0usize];
    [
        "Offset of field: av__bindgen_ty_1::svu_hash",
    ][::std::mem::offset_of!(av__bindgen_ty_1, svu_hash) - 0usize];
    [
        "Offset of field: av__bindgen_ty_1::svu_gp",
    ][::std::mem::offset_of!(av__bindgen_ty_1, svu_gp) - 0usize];
    [
        "Offset of field: av__bindgen_ty_1::svu_fp",
    ][::std::mem::offset_of!(av__bindgen_ty_1, svu_fp) - 0usize];
};
impl ::std::fmt::Debug for av__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "av__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of av"][::std::mem::size_of::<av>() - 24usize];
    ["Alignment of av"][::std::mem::align_of::<av>() - 8usize];
    ["Offset of field: av::sv_any"][::std::mem::offset_of!(av, sv_any) - 0usize];
    ["Offset of field: av::sv_refcnt"][::std::mem::offset_of!(av, sv_refcnt) - 8usize];
    ["Offset of field: av::sv_flags"][::std::mem::offset_of!(av, sv_flags) - 12usize];
    ["Offset of field: av::sv_u"][::std::mem::offset_of!(av, sv_u) - 16usize];
};
impl ::std::fmt::Debug for av {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "av {{ sv_any: {:?}, sv_refcnt: {:?}, sv_flags: {:?}, sv_u: {:?} }}",
            self.sv_any,
            self.sv_refcnt,
            self.sv_flags,
            self.sv_u,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct hv {
    pub sv_any: *mut XPVHV,
    pub sv_refcnt: U32,
    pub sv_flags: U32,
    pub sv_u: hv__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union hv__bindgen_ty_1 {
    pub svu_pv: *mut ::std::os::raw::c_char,
    pub svu_iv: IV,
    pub svu_uv: UV,
    pub svu_nv: NV,
    pub svu_rv: *mut SV,
    pub svu_array: *mut *mut SV,
    pub svu_hash: *mut *mut HE,
    pub svu_gp: *mut GP,
    pub svu_fp: *mut PerlIO,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hv__bindgen_ty_1"][::std::mem::size_of::<hv__bindgen_ty_1>() - 8usize];
    [
        "Alignment of hv__bindgen_ty_1",
    ][::std::mem::align_of::<hv__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: hv__bindgen_ty_1::svu_pv",
    ][::std::mem::offset_of!(hv__bindgen_ty_1, svu_pv) - 0usize];
    [
        "Offset of field: hv__bindgen_ty_1::svu_iv",
    ][::std::mem::offset_of!(hv__bindgen_ty_1, svu_iv) - 0usize];
    [
        "Offset of field: hv__bindgen_ty_1::svu_uv",
    ][::std::mem::offset_of!(hv__bindgen_ty_1, svu_uv) - 0usize];
    [
        "Offset of field: hv__bindgen_ty_1::svu_nv",
    ][::std::mem::offset_of!(hv__bindgen_ty_1, svu_nv) - 0usize];
    [
        "Offset of field: hv__bindgen_ty_1::svu_rv",
    ][::std::mem::offset_of!(hv__bindgen_ty_1, svu_rv) - 0usize];
    [
        "Offset of field: hv__bindgen_ty_1::svu_array",
    ][::std::mem::offset_of!(hv__bindgen_ty_1, svu_array) - 0usize];
    [
        "Offset of field: hv__bindgen_ty_1::svu_hash",
    ][::std::mem::offset_of!(hv__bindgen_ty_1, svu_hash) - 0usize];
    [
        "Offset of field: hv__bindgen_ty_1::svu_gp",
    ][::std::mem::offset_of!(hv__bindgen_ty_1, svu_gp) - 0usize];
    [
        "Offset of field: hv__bindgen_ty_1::svu_fp",
    ][::std::mem::offset_of!(hv__bindgen_ty_1, svu_fp) - 0usize];
};
impl ::std::fmt::Debug for hv__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "hv__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hv"][::std::mem::size_of::<hv>() - 24usize];
    ["Alignment of hv"][::std::mem::align_of::<hv>() - 8usize];
    ["Offset of field: hv::sv_any"][::std::mem::offset_of!(hv, sv_any) - 0usize];
    ["Offset of field: hv::sv_refcnt"][::std::mem::offset_of!(hv, sv_refcnt) - 8usize];
    ["Offset of field: hv::sv_flags"][::std::mem::offset_of!(hv, sv_flags) - 12usize];
    ["Offset of field: hv::sv_u"][::std::mem::offset_of!(hv, sv_u) - 16usize];
};
impl ::std::fmt::Debug for hv {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "hv {{ sv_any: {:?}, sv_refcnt: {:?}, sv_flags: {:?}, sv_u: {:?} }}",
            self.sv_any,
            self.sv_refcnt,
            self.sv_flags,
            self.sv_u,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct io {
    pub sv_any: *mut XPVIO,
    pub sv_refcnt: U32,
    pub sv_flags: U32,
    pub sv_u: io__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union io__bindgen_ty_1 {
    pub svu_pv: *mut ::std::os::raw::c_char,
    pub svu_iv: IV,
    pub svu_uv: UV,
    pub svu_nv: NV,
    pub svu_rv: *mut SV,
    pub svu_array: *mut *mut SV,
    pub svu_hash: *mut *mut HE,
    pub svu_gp: *mut GP,
    pub svu_fp: *mut PerlIO,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io__bindgen_ty_1"][::std::mem::size_of::<io__bindgen_ty_1>() - 8usize];
    [
        "Alignment of io__bindgen_ty_1",
    ][::std::mem::align_of::<io__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: io__bindgen_ty_1::svu_pv",
    ][::std::mem::offset_of!(io__bindgen_ty_1, svu_pv) - 0usize];
    [
        "Offset of field: io__bindgen_ty_1::svu_iv",
    ][::std::mem::offset_of!(io__bindgen_ty_1, svu_iv) - 0usize];
    [
        "Offset of field: io__bindgen_ty_1::svu_uv",
    ][::std::mem::offset_of!(io__bindgen_ty_1, svu_uv) - 0usize];
    [
        "Offset of field: io__bindgen_ty_1::svu_nv",
    ][::std::mem::offset_of!(io__bindgen_ty_1, svu_nv) - 0usize];
    [
        "Offset of field: io__bindgen_ty_1::svu_rv",
    ][::std::mem::offset_of!(io__bindgen_ty_1, svu_rv) - 0usize];
    [
        "Offset of field: io__bindgen_ty_1::svu_array",
    ][::std::mem::offset_of!(io__bindgen_ty_1, svu_array) - 0usize];
    [
        "Offset of field: io__bindgen_ty_1::svu_hash",
    ][::std::mem::offset_of!(io__bindgen_ty_1, svu_hash) - 0usize];
    [
        "Offset of field: io__bindgen_ty_1::svu_gp",
    ][::std::mem::offset_of!(io__bindgen_ty_1, svu_gp) - 0usize];
    [
        "Offset of field: io__bindgen_ty_1::svu_fp",
    ][::std::mem::offset_of!(io__bindgen_ty_1, svu_fp) - 0usize];
};
impl ::std::fmt::Debug for io__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "io__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io"][::std::mem::size_of::<io>() - 24usize];
    ["Alignment of io"][::std::mem::align_of::<io>() - 8usize];
    ["Offset of field: io::sv_any"][::std::mem::offset_of!(io, sv_any) - 0usize];
    ["Offset of field: io::sv_refcnt"][::std::mem::offset_of!(io, sv_refcnt) - 8usize];
    ["Offset of field: io::sv_flags"][::std::mem::offset_of!(io, sv_flags) - 12usize];
    ["Offset of field: io::sv_u"][::std::mem::offset_of!(io, sv_u) - 16usize];
};
impl ::std::fmt::Debug for io {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "io {{ sv_any: {:?}, sv_refcnt: {:?}, sv_flags: {:?}, sv_u: {:?} }}",
            self.sv_any,
            self.sv_refcnt,
            self.sv_flags,
            self.sv_u,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct p5rx {
    pub sv_any: *mut regexp,
    pub sv_refcnt: U32,
    pub sv_flags: U32,
    pub sv_u: p5rx__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union p5rx__bindgen_ty_1 {
    pub svu_pv: *mut ::std::os::raw::c_char,
    pub svu_iv: IV,
    pub svu_uv: UV,
    pub svu_nv: NV,
    pub svu_rv: *mut SV,
    pub svu_array: *mut *mut SV,
    pub svu_hash: *mut *mut HE,
    pub svu_gp: *mut GP,
    pub svu_fp: *mut PerlIO,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of p5rx__bindgen_ty_1"][::std::mem::size_of::<p5rx__bindgen_ty_1>() - 8usize];
    [
        "Alignment of p5rx__bindgen_ty_1",
    ][::std::mem::align_of::<p5rx__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: p5rx__bindgen_ty_1::svu_pv",
    ][::std::mem::offset_of!(p5rx__bindgen_ty_1, svu_pv) - 0usize];
    [
        "Offset of field: p5rx__bindgen_ty_1::svu_iv",
    ][::std::mem::offset_of!(p5rx__bindgen_ty_1, svu_iv) - 0usize];
    [
        "Offset of field: p5rx__bindgen_ty_1::svu_uv",
    ][::std::mem::offset_of!(p5rx__bindgen_ty_1, svu_uv) - 0usize];
    [
        "Offset of field: p5rx__bindgen_ty_1::svu_nv",
    ][::std::mem::offset_of!(p5rx__bindgen_ty_1, svu_nv) - 0usize];
    [
        "Offset of field: p5rx__bindgen_ty_1::svu_rv",
    ][::std::mem::offset_of!(p5rx__bindgen_ty_1, svu_rv) - 0usize];
    [
        "Offset of field: p5rx__bindgen_ty_1::svu_array",
    ][::std::mem::offset_of!(p5rx__bindgen_ty_1, svu_array) - 0usize];
    [
        "Offset of field: p5rx__bindgen_ty_1::svu_hash",
    ][::std::mem::offset_of!(p5rx__bindgen_ty_1, svu_hash) - 0usize];
    [
        "Offset of field: p5rx__bindgen_ty_1::svu_gp",
    ][::std::mem::offset_of!(p5rx__bindgen_ty_1, svu_gp) - 0usize];
    [
        "Offset of field: p5rx__bindgen_ty_1::svu_fp",
    ][::std::mem::offset_of!(p5rx__bindgen_ty_1, svu_fp) - 0usize];
};
impl ::std::fmt::Debug for p5rx__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "p5rx__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of p5rx"][::std::mem::size_of::<p5rx>() - 24usize];
    ["Alignment of p5rx"][::std::mem::align_of::<p5rx>() - 8usize];
    ["Offset of field: p5rx::sv_any"][::std::mem::offset_of!(p5rx, sv_any) - 0usize];
    [
        "Offset of field: p5rx::sv_refcnt",
    ][::std::mem::offset_of!(p5rx, sv_refcnt) - 8usize];
    [
        "Offset of field: p5rx::sv_flags",
    ][::std::mem::offset_of!(p5rx, sv_flags) - 12usize];
    ["Offset of field: p5rx::sv_u"][::std::mem::offset_of!(p5rx, sv_u) - 16usize];
};
impl ::std::fmt::Debug for p5rx {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "p5rx {{ sv_any: {:?}, sv_refcnt: {:?}, sv_flags: {:?}, sv_u: {:?} }}",
            self.sv_any,
            self.sv_refcnt,
            self.sv_flags,
            self.sv_u,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct invlist {
    pub sv_any: *mut XINVLIST,
    pub sv_refcnt: U32,
    pub sv_flags: U32,
    pub sv_u: invlist__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union invlist__bindgen_ty_1 {
    pub svu_pv: *mut ::std::os::raw::c_char,
    pub svu_iv: IV,
    pub svu_uv: UV,
    pub svu_nv: NV,
    pub svu_rv: *mut SV,
    pub svu_array: *mut *mut SV,
    pub svu_hash: *mut *mut HE,
    pub svu_gp: *mut GP,
    pub svu_fp: *mut PerlIO,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of invlist__bindgen_ty_1",
    ][::std::mem::size_of::<invlist__bindgen_ty_1>() - 8usize];
    [
        "Alignment of invlist__bindgen_ty_1",
    ][::std::mem::align_of::<invlist__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: invlist__bindgen_ty_1::svu_pv",
    ][::std::mem::offset_of!(invlist__bindgen_ty_1, svu_pv) - 0usize];
    [
        "Offset of field: invlist__bindgen_ty_1::svu_iv",
    ][::std::mem::offset_of!(invlist__bindgen_ty_1, svu_iv) - 0usize];
    [
        "Offset of field: invlist__bindgen_ty_1::svu_uv",
    ][::std::mem::offset_of!(invlist__bindgen_ty_1, svu_uv) - 0usize];
    [
        "Offset of field: invlist__bindgen_ty_1::svu_nv",
    ][::std::mem::offset_of!(invlist__bindgen_ty_1, svu_nv) - 0usize];
    [
        "Offset of field: invlist__bindgen_ty_1::svu_rv",
    ][::std::mem::offset_of!(invlist__bindgen_ty_1, svu_rv) - 0usize];
    [
        "Offset of field: invlist__bindgen_ty_1::svu_array",
    ][::std::mem::offset_of!(invlist__bindgen_ty_1, svu_array) - 0usize];
    [
        "Offset of field: invlist__bindgen_ty_1::svu_hash",
    ][::std::mem::offset_of!(invlist__bindgen_ty_1, svu_hash) - 0usize];
    [
        "Offset of field: invlist__bindgen_ty_1::svu_gp",
    ][::std::mem::offset_of!(invlist__bindgen_ty_1, svu_gp) - 0usize];
    [
        "Offset of field: invlist__bindgen_ty_1::svu_fp",
    ][::std::mem::offset_of!(invlist__bindgen_ty_1, svu_fp) - 0usize];
};
impl ::std::fmt::Debug for invlist__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "invlist__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of invlist"][::std::mem::size_of::<invlist>() - 24usize];
    ["Alignment of invlist"][::std::mem::align_of::<invlist>() - 8usize];
    [
        "Offset of field: invlist::sv_any",
    ][::std::mem::offset_of!(invlist, sv_any) - 0usize];
    [
        "Offset of field: invlist::sv_refcnt",
    ][::std::mem::offset_of!(invlist, sv_refcnt) - 8usize];
    [
        "Offset of field: invlist::sv_flags",
    ][::std::mem::offset_of!(invlist, sv_flags) - 12usize];
    ["Offset of field: invlist::sv_u"][::std::mem::offset_of!(invlist, sv_u) - 16usize];
};
impl ::std::fmt::Debug for invlist {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "invlist {{ sv_any: {:?}, sv_refcnt: {:?}, sv_flags: {:?}, sv_u: {:?} }}",
            self.sv_any,
            self.sv_refcnt,
            self.sv_flags,
            self.sv_u,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _xnvu {
    pub xnv_nv: NV,
    pub xgv_stash: *mut HV,
    pub xnv_lines: line_t,
    pub xnv_bm_tail: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _xnvu"][::std::mem::size_of::<_xnvu>() - 8usize];
    ["Alignment of _xnvu"][::std::mem::align_of::<_xnvu>() - 8usize];
    ["Offset of field: _xnvu::xnv_nv"][::std::mem::offset_of!(_xnvu, xnv_nv) - 0usize];
    [
        "Offset of field: _xnvu::xgv_stash",
    ][::std::mem::offset_of!(_xnvu, xgv_stash) - 0usize];
    [
        "Offset of field: _xnvu::xnv_lines",
    ][::std::mem::offset_of!(_xnvu, xnv_lines) - 0usize];
    [
        "Offset of field: _xnvu::xnv_bm_tail",
    ][::std::mem::offset_of!(_xnvu, xnv_bm_tail) - 0usize];
};
impl ::std::fmt::Debug for _xnvu {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "_xnvu {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _xivu {
    pub xivu_iv: IV,
    pub xivu_uv: UV,
    pub xivu_namehek: *mut HEK,
    pub xivu_eval_seen: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _xivu"][::std::mem::size_of::<_xivu>() - 8usize];
    ["Alignment of _xivu"][::std::mem::align_of::<_xivu>() - 8usize];
    ["Offset of field: _xivu::xivu_iv"][::std::mem::offset_of!(_xivu, xivu_iv) - 0usize];
    ["Offset of field: _xivu::xivu_uv"][::std::mem::offset_of!(_xivu, xivu_uv) - 0usize];
    [
        "Offset of field: _xivu::xivu_namehek",
    ][::std::mem::offset_of!(_xivu, xivu_namehek) - 0usize];
    [
        "Offset of field: _xivu::xivu_eval_seen",
    ][::std::mem::offset_of!(_xivu, xivu_eval_seen) - 0usize];
};
impl ::std::fmt::Debug for _xivu {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "_xivu {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _xmgu {
    pub xmg_magic: *mut MAGIC,
    pub xmg_hash_index: STRLEN,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _xmgu"][::std::mem::size_of::<_xmgu>() - 8usize];
    ["Alignment of _xmgu"][::std::mem::align_of::<_xmgu>() - 8usize];
    [
        "Offset of field: _xmgu::xmg_magic",
    ][::std::mem::offset_of!(_xmgu, xmg_magic) - 0usize];
    [
        "Offset of field: _xmgu::xmg_hash_index",
    ][::std::mem::offset_of!(_xmgu, xmg_hash_index) - 0usize];
};
impl ::std::fmt::Debug for _xmgu {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "_xmgu {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct xpv {
    pub xmg_stash: *mut HV,
    pub xmg_u: _xmgu,
    pub xpv_cur: STRLEN,
    pub xpv_len_u: xpv__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpv__bindgen_ty_1 {
    pub xpvlenu_len: STRLEN,
    pub xpvlenu_rx: *mut regexp,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xpv__bindgen_ty_1"][::std::mem::size_of::<xpv__bindgen_ty_1>() - 8usize];
    [
        "Alignment of xpv__bindgen_ty_1",
    ][::std::mem::align_of::<xpv__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: xpv__bindgen_ty_1::xpvlenu_len",
    ][::std::mem::offset_of!(xpv__bindgen_ty_1, xpvlenu_len) - 0usize];
    [
        "Offset of field: xpv__bindgen_ty_1::xpvlenu_rx",
    ][::std::mem::offset_of!(xpv__bindgen_ty_1, xpvlenu_rx) - 0usize];
};
impl ::std::fmt::Debug for xpv__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpv__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xpv"][::std::mem::size_of::<xpv>() - 32usize];
    ["Alignment of xpv"][::std::mem::align_of::<xpv>() - 8usize];
    ["Offset of field: xpv::xmg_stash"][::std::mem::offset_of!(xpv, xmg_stash) - 0usize];
    ["Offset of field: xpv::xmg_u"][::std::mem::offset_of!(xpv, xmg_u) - 8usize];
    ["Offset of field: xpv::xpv_cur"][::std::mem::offset_of!(xpv, xpv_cur) - 16usize];
    [
        "Offset of field: xpv::xpv_len_u",
    ][::std::mem::offset_of!(xpv, xpv_len_u) - 24usize];
};
impl ::std::fmt::Debug for xpv {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "xpv {{ xmg_stash: {:?}, xmg_u: {:?}, xpv_len_u: {:?} }}",
            self.xmg_stash,
            self.xmg_u,
            self.xpv_len_u,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct xpviv {
    pub xmg_stash: *mut HV,
    pub xmg_u: _xmgu,
    pub xpv_cur: STRLEN,
    pub xpv_len_u: xpviv__bindgen_ty_1,
    pub xiv_u: _xivu,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpviv__bindgen_ty_1 {
    pub xpvlenu_len: STRLEN,
    pub xpvlenu_rx: *mut regexp,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of xpviv__bindgen_ty_1",
    ][::std::mem::size_of::<xpviv__bindgen_ty_1>() - 8usize];
    [
        "Alignment of xpviv__bindgen_ty_1",
    ][::std::mem::align_of::<xpviv__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: xpviv__bindgen_ty_1::xpvlenu_len",
    ][::std::mem::offset_of!(xpviv__bindgen_ty_1, xpvlenu_len) - 0usize];
    [
        "Offset of field: xpviv__bindgen_ty_1::xpvlenu_rx",
    ][::std::mem::offset_of!(xpviv__bindgen_ty_1, xpvlenu_rx) - 0usize];
};
impl ::std::fmt::Debug for xpviv__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpviv__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xpviv"][::std::mem::size_of::<xpviv>() - 40usize];
    ["Alignment of xpviv"][::std::mem::align_of::<xpviv>() - 8usize];
    [
        "Offset of field: xpviv::xmg_stash",
    ][::std::mem::offset_of!(xpviv, xmg_stash) - 0usize];
    ["Offset of field: xpviv::xmg_u"][::std::mem::offset_of!(xpviv, xmg_u) - 8usize];
    [
        "Offset of field: xpviv::xpv_cur",
    ][::std::mem::offset_of!(xpviv, xpv_cur) - 16usize];
    [
        "Offset of field: xpviv::xpv_len_u",
    ][::std::mem::offset_of!(xpviv, xpv_len_u) - 24usize];
    ["Offset of field: xpviv::xiv_u"][::std::mem::offset_of!(xpviv, xiv_u) - 32usize];
};
impl ::std::fmt::Debug for xpviv {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "xpviv {{ xmg_stash: {:?}, xmg_u: {:?}, xpv_len_u: {:?}, xiv_u: {:?} }}",
            self.xmg_stash,
            self.xmg_u,
            self.xpv_len_u,
            self.xiv_u,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct xpvuv {
    pub xmg_stash: *mut HV,
    pub xmg_u: _xmgu,
    pub xpv_cur: STRLEN,
    pub xpv_len_u: xpvuv__bindgen_ty_1,
    pub xuv_u: _xivu,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpvuv__bindgen_ty_1 {
    pub xpvlenu_len: STRLEN,
    pub xpvlenu_rx: *mut regexp,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of xpvuv__bindgen_ty_1",
    ][::std::mem::size_of::<xpvuv__bindgen_ty_1>() - 8usize];
    [
        "Alignment of xpvuv__bindgen_ty_1",
    ][::std::mem::align_of::<xpvuv__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: xpvuv__bindgen_ty_1::xpvlenu_len",
    ][::std::mem::offset_of!(xpvuv__bindgen_ty_1, xpvlenu_len) - 0usize];
    [
        "Offset of field: xpvuv__bindgen_ty_1::xpvlenu_rx",
    ][::std::mem::offset_of!(xpvuv__bindgen_ty_1, xpvlenu_rx) - 0usize];
};
impl ::std::fmt::Debug for xpvuv__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpvuv__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xpvuv"][::std::mem::size_of::<xpvuv>() - 40usize];
    ["Alignment of xpvuv"][::std::mem::align_of::<xpvuv>() - 8usize];
    [
        "Offset of field: xpvuv::xmg_stash",
    ][::std::mem::offset_of!(xpvuv, xmg_stash) - 0usize];
    ["Offset of field: xpvuv::xmg_u"][::std::mem::offset_of!(xpvuv, xmg_u) - 8usize];
    [
        "Offset of field: xpvuv::xpv_cur",
    ][::std::mem::offset_of!(xpvuv, xpv_cur) - 16usize];
    [
        "Offset of field: xpvuv::xpv_len_u",
    ][::std::mem::offset_of!(xpvuv, xpv_len_u) - 24usize];
    ["Offset of field: xpvuv::xuv_u"][::std::mem::offset_of!(xpvuv, xuv_u) - 32usize];
};
impl ::std::fmt::Debug for xpvuv {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "xpvuv {{ xmg_stash: {:?}, xmg_u: {:?}, xpv_len_u: {:?}, xuv_u: {:?} }}",
            self.xmg_stash,
            self.xmg_u,
            self.xpv_len_u,
            self.xuv_u,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct xpvnv {
    pub xmg_stash: *mut HV,
    pub xmg_u: _xmgu,
    pub xpv_cur: STRLEN,
    pub xpv_len_u: xpvnv__bindgen_ty_1,
    pub xiv_u: _xivu,
    pub xnv_u: _xnvu,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpvnv__bindgen_ty_1 {
    pub xpvlenu_len: STRLEN,
    pub xpvlenu_rx: *mut regexp,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of xpvnv__bindgen_ty_1",
    ][::std::mem::size_of::<xpvnv__bindgen_ty_1>() - 8usize];
    [
        "Alignment of xpvnv__bindgen_ty_1",
    ][::std::mem::align_of::<xpvnv__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: xpvnv__bindgen_ty_1::xpvlenu_len",
    ][::std::mem::offset_of!(xpvnv__bindgen_ty_1, xpvlenu_len) - 0usize];
    [
        "Offset of field: xpvnv__bindgen_ty_1::xpvlenu_rx",
    ][::std::mem::offset_of!(xpvnv__bindgen_ty_1, xpvlenu_rx) - 0usize];
};
impl ::std::fmt::Debug for xpvnv__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpvnv__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xpvnv"][::std::mem::size_of::<xpvnv>() - 48usize];
    ["Alignment of xpvnv"][::std::mem::align_of::<xpvnv>() - 8usize];
    [
        "Offset of field: xpvnv::xmg_stash",
    ][::std::mem::offset_of!(xpvnv, xmg_stash) - 0usize];
    ["Offset of field: xpvnv::xmg_u"][::std::mem::offset_of!(xpvnv, xmg_u) - 8usize];
    [
        "Offset of field: xpvnv::xpv_cur",
    ][::std::mem::offset_of!(xpvnv, xpv_cur) - 16usize];
    [
        "Offset of field: xpvnv::xpv_len_u",
    ][::std::mem::offset_of!(xpvnv, xpv_len_u) - 24usize];
    ["Offset of field: xpvnv::xiv_u"][::std::mem::offset_of!(xpvnv, xiv_u) - 32usize];
    ["Offset of field: xpvnv::xnv_u"][::std::mem::offset_of!(xpvnv, xnv_u) - 40usize];
};
impl ::std::fmt::Debug for xpvnv {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "xpvnv {{ xmg_stash: {:?}, xmg_u: {:?}, xpv_len_u: {:?}, xiv_u: {:?}, xnv_u: {:?} }}",
            self.xmg_stash,
            self.xmg_u,
            self.xpv_len_u,
            self.xiv_u,
            self.xnv_u,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct xpvmg {
    pub xmg_stash: *mut HV,
    pub xmg_u: _xmgu,
    pub xpv_cur: STRLEN,
    pub xpv_len_u: xpvmg__bindgen_ty_1,
    pub xiv_u: _xivu,
    pub xnv_u: _xnvu,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpvmg__bindgen_ty_1 {
    pub xpvlenu_len: STRLEN,
    pub xpvlenu_rx: *mut regexp,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of xpvmg__bindgen_ty_1",
    ][::std::mem::size_of::<xpvmg__bindgen_ty_1>() - 8usize];
    [
        "Alignment of xpvmg__bindgen_ty_1",
    ][::std::mem::align_of::<xpvmg__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: xpvmg__bindgen_ty_1::xpvlenu_len",
    ][::std::mem::offset_of!(xpvmg__bindgen_ty_1, xpvlenu_len) - 0usize];
    [
        "Offset of field: xpvmg__bindgen_ty_1::xpvlenu_rx",
    ][::std::mem::offset_of!(xpvmg__bindgen_ty_1, xpvlenu_rx) - 0usize];
};
impl ::std::fmt::Debug for xpvmg__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpvmg__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xpvmg"][::std::mem::size_of::<xpvmg>() - 48usize];
    ["Alignment of xpvmg"][::std::mem::align_of::<xpvmg>() - 8usize];
    [
        "Offset of field: xpvmg::xmg_stash",
    ][::std::mem::offset_of!(xpvmg, xmg_stash) - 0usize];
    ["Offset of field: xpvmg::xmg_u"][::std::mem::offset_of!(xpvmg, xmg_u) - 8usize];
    [
        "Offset of field: xpvmg::xpv_cur",
    ][::std::mem::offset_of!(xpvmg, xpv_cur) - 16usize];
    [
        "Offset of field: xpvmg::xpv_len_u",
    ][::std::mem::offset_of!(xpvmg, xpv_len_u) - 24usize];
    ["Offset of field: xpvmg::xiv_u"][::std::mem::offset_of!(xpvmg, xiv_u) - 32usize];
    ["Offset of field: xpvmg::xnv_u"][::std::mem::offset_of!(xpvmg, xnv_u) - 40usize];
};
impl ::std::fmt::Debug for xpvmg {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "xpvmg {{ xmg_stash: {:?}, xmg_u: {:?}, xpv_len_u: {:?}, xiv_u: {:?}, xnv_u: {:?} }}",
            self.xmg_stash,
            self.xmg_u,
            self.xpv_len_u,
            self.xiv_u,
            self.xnv_u,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct xpvlv {
    pub xmg_stash: *mut HV,
    pub xmg_u: _xmgu,
    pub xpv_cur: STRLEN,
    pub xpv_len_u: xpvlv__bindgen_ty_1,
    pub xiv_u: _xivu,
    pub xnv_u: _xnvu,
    pub xlv_targoff_u: xpvlv__bindgen_ty_2,
    pub xlv_targlen: STRLEN,
    pub xlv_targ: *mut SV,
    pub xlv_type: ::std::os::raw::c_char,
    pub xlv_flags: ::std::os::raw::c_char,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpvlv__bindgen_ty_1 {
    pub xpvlenu_len: STRLEN,
    pub xpvlenu_rx: *mut regexp,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of xpvlv__bindgen_ty_1",
    ][::std::mem::size_of::<xpvlv__bindgen_ty_1>() - 8usize];
    [
        "Alignment of xpvlv__bindgen_ty_1",
    ][::std::mem::align_of::<xpvlv__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: xpvlv__bindgen_ty_1::xpvlenu_len",
    ][::std::mem::offset_of!(xpvlv__bindgen_ty_1, xpvlenu_len) - 0usize];
    [
        "Offset of field: xpvlv__bindgen_ty_1::xpvlenu_rx",
    ][::std::mem::offset_of!(xpvlv__bindgen_ty_1, xpvlenu_rx) - 0usize];
};
impl ::std::fmt::Debug for xpvlv__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpvlv__bindgen_ty_1 {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpvlv__bindgen_ty_2 {
    pub xlvu_targoff: STRLEN,
    pub xlvu_stargoff: isize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of xpvlv__bindgen_ty_2",
    ][::std::mem::size_of::<xpvlv__bindgen_ty_2>() - 8usize];
    [
        "Alignment of xpvlv__bindgen_ty_2",
    ][::std::mem::align_of::<xpvlv__bindgen_ty_2>() - 8usize];
    [
        "Offset of field: xpvlv__bindgen_ty_2::xlvu_targoff",
    ][::std::mem::offset_of!(xpvlv__bindgen_ty_2, xlvu_targoff) - 0usize];
    [
        "Offset of field: xpvlv__bindgen_ty_2::xlvu_stargoff",
    ][::std::mem::offset_of!(xpvlv__bindgen_ty_2, xlvu_stargoff) - 0usize];
};
impl ::std::fmt::Debug for xpvlv__bindgen_ty_2 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpvlv__bindgen_ty_2 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xpvlv"][::std::mem::size_of::<xpvlv>() - 80usize];
    ["Alignment of xpvlv"][::std::mem::align_of::<xpvlv>() - 8usize];
    [
        "Offset of field: xpvlv::xmg_stash",
    ][::std::mem::offset_of!(xpvlv, xmg_stash) - 0usize];
    ["Offset of field: xpvlv::xmg_u"][::std::mem::offset_of!(xpvlv, xmg_u) - 8usize];
    [
        "Offset of field: xpvlv::xpv_cur",
    ][::std::mem::offset_of!(xpvlv, xpv_cur) - 16usize];
    [
        "Offset of field: xpvlv::xpv_len_u",
    ][::std::mem::offset_of!(xpvlv, xpv_len_u) - 24usize];
    ["Offset of field: xpvlv::xiv_u"][::std::mem::offset_of!(xpvlv, xiv_u) - 32usize];
    ["Offset of field: xpvlv::xnv_u"][::std::mem::offset_of!(xpvlv, xnv_u) - 40usize];
    [
        "Offset of field: xpvlv::xlv_targoff_u",
    ][::std::mem::offset_of!(xpvlv, xlv_targoff_u) - 48usize];
    [
        "Offset of field: xpvlv::xlv_targlen",
    ][::std::mem::offset_of!(xpvlv, xlv_targlen) - 56usize];
    [
        "Offset of field: xpvlv::xlv_targ",
    ][::std::mem::offset_of!(xpvlv, xlv_targ) - 64usize];
    [
        "Offset of field: xpvlv::xlv_type",
    ][::std::mem::offset_of!(xpvlv, xlv_type) - 72usize];
    [
        "Offset of field: xpvlv::xlv_flags",
    ][::std::mem::offset_of!(xpvlv, xlv_flags) - 73usize];
};
impl ::std::fmt::Debug for xpvlv {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "xpvlv {{ xmg_stash: {:?}, xmg_u: {:?}, xpv_len_u: {:?}, xiv_u: {:?}, xnv_u: {:?}, xlv_targoff_u: {:?}, xlv_targ: {:?}, xlv_type: {:?}, xlv_flags: {:?} }}",
            self.xmg_stash,
            self.xmg_u,
            self.xpv_len_u,
            self.xiv_u,
            self.xnv_u,
            self.xlv_targoff_u,
            self.xlv_targ,
            self.xlv_type,
            self.xlv_flags,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct xpvinvlist {
    pub xmg_stash: *mut HV,
    pub xmg_u: _xmgu,
    pub xpv_cur: STRLEN,
    pub xpv_len_u: xpvinvlist__bindgen_ty_1,
    pub prev_index: IV,
    pub iterator: STRLEN,
    pub is_offset: bool,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpvinvlist__bindgen_ty_1 {
    pub xpvlenu_len: STRLEN,
    pub xpvlenu_rx: *mut regexp,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of xpvinvlist__bindgen_ty_1",
    ][::std::mem::size_of::<xpvinvlist__bindgen_ty_1>() - 8usize];
    [
        "Alignment of xpvinvlist__bindgen_ty_1",
    ][::std::mem::align_of::<xpvinvlist__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: xpvinvlist__bindgen_ty_1::xpvlenu_len",
    ][::std::mem::offset_of!(xpvinvlist__bindgen_ty_1, xpvlenu_len) - 0usize];
    [
        "Offset of field: xpvinvlist__bindgen_ty_1::xpvlenu_rx",
    ][::std::mem::offset_of!(xpvinvlist__bindgen_ty_1, xpvlenu_rx) - 0usize];
};
impl ::std::fmt::Debug for xpvinvlist__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpvinvlist__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xpvinvlist"][::std::mem::size_of::<xpvinvlist>() - 56usize];
    ["Alignment of xpvinvlist"][::std::mem::align_of::<xpvinvlist>() - 8usize];
    [
        "Offset of field: xpvinvlist::xmg_stash",
    ][::std::mem::offset_of!(xpvinvlist, xmg_stash) - 0usize];
    [
        "Offset of field: xpvinvlist::xmg_u",
    ][::std::mem::offset_of!(xpvinvlist, xmg_u) - 8usize];
    [
        "Offset of field: xpvinvlist::xpv_cur",
    ][::std::mem::offset_of!(xpvinvlist, xpv_cur) - 16usize];
    [
        "Offset of field: xpvinvlist::xpv_len_u",
    ][::std::mem::offset_of!(xpvinvlist, xpv_len_u) - 24usize];
    [
        "Offset of field: xpvinvlist::prev_index",
    ][::std::mem::offset_of!(xpvinvlist, prev_index) - 32usize];
    [
        "Offset of field: xpvinvlist::iterator",
    ][::std::mem::offset_of!(xpvinvlist, iterator) - 40usize];
    [
        "Offset of field: xpvinvlist::is_offset",
    ][::std::mem::offset_of!(xpvinvlist, is_offset) - 48usize];
};
impl ::std::fmt::Debug for xpvinvlist {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "xpvinvlist {{ xmg_stash: {:?}, xmg_u: {:?}, xpv_len_u: {:?}, prev_index: {:?}, is_offset: {:?} }}",
            self.xmg_stash,
            self.xmg_u,
            self.xpv_len_u,
            self.prev_index,
            self.is_offset,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct xpvgv {
    pub xmg_stash: *mut HV,
    pub xmg_u: _xmgu,
    pub xpv_cur: STRLEN,
    pub xpv_len_u: xpvgv__bindgen_ty_1,
    pub xiv_u: _xivu,
    pub xnv_u: _xnvu,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpvgv__bindgen_ty_1 {
    pub xpvlenu_len: STRLEN,
    pub xpvlenu_rx: *mut regexp,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of xpvgv__bindgen_ty_1",
    ][::std::mem::size_of::<xpvgv__bindgen_ty_1>() - 8usize];
    [
        "Alignment of xpvgv__bindgen_ty_1",
    ][::std::mem::align_of::<xpvgv__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: xpvgv__bindgen_ty_1::xpvlenu_len",
    ][::std::mem::offset_of!(xpvgv__bindgen_ty_1, xpvlenu_len) - 0usize];
    [
        "Offset of field: xpvgv__bindgen_ty_1::xpvlenu_rx",
    ][::std::mem::offset_of!(xpvgv__bindgen_ty_1, xpvlenu_rx) - 0usize];
};
impl ::std::fmt::Debug for xpvgv__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpvgv__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xpvgv"][::std::mem::size_of::<xpvgv>() - 48usize];
    ["Alignment of xpvgv"][::std::mem::align_of::<xpvgv>() - 8usize];
    [
        "Offset of field: xpvgv::xmg_stash",
    ][::std::mem::offset_of!(xpvgv, xmg_stash) - 0usize];
    ["Offset of field: xpvgv::xmg_u"][::std::mem::offset_of!(xpvgv, xmg_u) - 8usize];
    [
        "Offset of field: xpvgv::xpv_cur",
    ][::std::mem::offset_of!(xpvgv, xpv_cur) - 16usize];
    [
        "Offset of field: xpvgv::xpv_len_u",
    ][::std::mem::offset_of!(xpvgv, xpv_len_u) - 24usize];
    ["Offset of field: xpvgv::xiv_u"][::std::mem::offset_of!(xpvgv, xiv_u) - 32usize];
    ["Offset of field: xpvgv::xnv_u"][::std::mem::offset_of!(xpvgv, xnv_u) - 40usize];
};
impl ::std::fmt::Debug for xpvgv {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "xpvgv {{ xmg_stash: {:?}, xmg_u: {:?}, xpv_len_u: {:?}, xiv_u: {:?}, xnv_u: {:?} }}",
            self.xmg_stash,
            self.xmg_u,
            self.xpv_len_u,
            self.xiv_u,
            self.xnv_u,
        )
    }
}
pub type cv_flags_t = U32;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct xpvfm {
    pub xmg_stash: *mut HV,
    pub xmg_u: _xmgu,
    pub xpv_cur: STRLEN,
    pub xpv_len_u: xpvfm__bindgen_ty_1,
    pub xcv_stash: *mut HV,
    pub xcv_start_u: xpvfm__bindgen_ty_2,
    pub xcv_root_u: xpvfm__bindgen_ty_3,
    pub xcv_gv_u: xpvfm__bindgen_ty_4,
    pub xcv_file: *mut ::std::os::raw::c_char,
    pub xcv_padlist_u: xpvfm__bindgen_ty_5,
    pub xcv_outside: *mut CV,
    pub xcv_outside_seq: U32,
    pub xcv_flags: cv_flags_t,
    pub xcv_depth: I32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpvfm__bindgen_ty_1 {
    pub xpvlenu_len: STRLEN,
    pub xpvlenu_rx: *mut regexp,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of xpvfm__bindgen_ty_1",
    ][::std::mem::size_of::<xpvfm__bindgen_ty_1>() - 8usize];
    [
        "Alignment of xpvfm__bindgen_ty_1",
    ][::std::mem::align_of::<xpvfm__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: xpvfm__bindgen_ty_1::xpvlenu_len",
    ][::std::mem::offset_of!(xpvfm__bindgen_ty_1, xpvlenu_len) - 0usize];
    [
        "Offset of field: xpvfm__bindgen_ty_1::xpvlenu_rx",
    ][::std::mem::offset_of!(xpvfm__bindgen_ty_1, xpvlenu_rx) - 0usize];
};
impl ::std::fmt::Debug for xpvfm__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpvfm__bindgen_ty_1 {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpvfm__bindgen_ty_2 {
    pub xcv_start: *mut OP,
    pub xcv_xsubany: ANY,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of xpvfm__bindgen_ty_2",
    ][::std::mem::size_of::<xpvfm__bindgen_ty_2>() - 8usize];
    [
        "Alignment of xpvfm__bindgen_ty_2",
    ][::std::mem::align_of::<xpvfm__bindgen_ty_2>() - 8usize];
    [
        "Offset of field: xpvfm__bindgen_ty_2::xcv_start",
    ][::std::mem::offset_of!(xpvfm__bindgen_ty_2, xcv_start) - 0usize];
    [
        "Offset of field: xpvfm__bindgen_ty_2::xcv_xsubany",
    ][::std::mem::offset_of!(xpvfm__bindgen_ty_2, xcv_xsubany) - 0usize];
};
impl ::std::fmt::Debug for xpvfm__bindgen_ty_2 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpvfm__bindgen_ty_2 {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpvfm__bindgen_ty_3 {
    pub xcv_root: *mut OP,
    pub xcv_xsub: ::std::option::Option<
        unsafe extern "C" fn(my_perl: *mut PerlInterpreter, arg1: *mut CV),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of xpvfm__bindgen_ty_3",
    ][::std::mem::size_of::<xpvfm__bindgen_ty_3>() - 8usize];
    [
        "Alignment of xpvfm__bindgen_ty_3",
    ][::std::mem::align_of::<xpvfm__bindgen_ty_3>() - 8usize];
    [
        "Offset of field: xpvfm__bindgen_ty_3::xcv_root",
    ][::std::mem::offset_of!(xpvfm__bindgen_ty_3, xcv_root) - 0usize];
    [
        "Offset of field: xpvfm__bindgen_ty_3::xcv_xsub",
    ][::std::mem::offset_of!(xpvfm__bindgen_ty_3, xcv_xsub) - 0usize];
};
impl ::std::fmt::Debug for xpvfm__bindgen_ty_3 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpvfm__bindgen_ty_3 {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpvfm__bindgen_ty_4 {
    pub xcv_gv: *mut GV,
    pub xcv_hek: *mut HEK,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of xpvfm__bindgen_ty_4",
    ][::std::mem::size_of::<xpvfm__bindgen_ty_4>() - 8usize];
    [
        "Alignment of xpvfm__bindgen_ty_4",
    ][::std::mem::align_of::<xpvfm__bindgen_ty_4>() - 8usize];
    [
        "Offset of field: xpvfm__bindgen_ty_4::xcv_gv",
    ][::std::mem::offset_of!(xpvfm__bindgen_ty_4, xcv_gv) - 0usize];
    [
        "Offset of field: xpvfm__bindgen_ty_4::xcv_hek",
    ][::std::mem::offset_of!(xpvfm__bindgen_ty_4, xcv_hek) - 0usize];
};
impl ::std::fmt::Debug for xpvfm__bindgen_ty_4 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpvfm__bindgen_ty_4 {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpvfm__bindgen_ty_5 {
    pub xcv_padlist: *mut PADLIST,
    pub xcv_hscxt: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of xpvfm__bindgen_ty_5",
    ][::std::mem::size_of::<xpvfm__bindgen_ty_5>() - 8usize];
    [
        "Alignment of xpvfm__bindgen_ty_5",
    ][::std::mem::align_of::<xpvfm__bindgen_ty_5>() - 8usize];
    [
        "Offset of field: xpvfm__bindgen_ty_5::xcv_padlist",
    ][::std::mem::offset_of!(xpvfm__bindgen_ty_5, xcv_padlist) - 0usize];
    [
        "Offset of field: xpvfm__bindgen_ty_5::xcv_hscxt",
    ][::std::mem::offset_of!(xpvfm__bindgen_ty_5, xcv_hscxt) - 0usize];
};
impl ::std::fmt::Debug for xpvfm__bindgen_ty_5 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpvfm__bindgen_ty_5 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xpvfm"][::std::mem::size_of::<xpvfm>() - 104usize];
    ["Alignment of xpvfm"][::std::mem::align_of::<xpvfm>() - 8usize];
    [
        "Offset of field: xpvfm::xmg_stash",
    ][::std::mem::offset_of!(xpvfm, xmg_stash) - 0usize];
    ["Offset of field: xpvfm::xmg_u"][::std::mem::offset_of!(xpvfm, xmg_u) - 8usize];
    [
        "Offset of field: xpvfm::xpv_cur",
    ][::std::mem::offset_of!(xpvfm, xpv_cur) - 16usize];
    [
        "Offset of field: xpvfm::xpv_len_u",
    ][::std::mem::offset_of!(xpvfm, xpv_len_u) - 24usize];
    [
        "Offset of field: xpvfm::xcv_stash",
    ][::std::mem::offset_of!(xpvfm, xcv_stash) - 32usize];
    [
        "Offset of field: xpvfm::xcv_start_u",
    ][::std::mem::offset_of!(xpvfm, xcv_start_u) - 40usize];
    [
        "Offset of field: xpvfm::xcv_root_u",
    ][::std::mem::offset_of!(xpvfm, xcv_root_u) - 48usize];
    [
        "Offset of field: xpvfm::xcv_gv_u",
    ][::std::mem::offset_of!(xpvfm, xcv_gv_u) - 56usize];
    [
        "Offset of field: xpvfm::xcv_file",
    ][::std::mem::offset_of!(xpvfm, xcv_file) - 64usize];
    [
        "Offset of field: xpvfm::xcv_padlist_u",
    ][::std::mem::offset_of!(xpvfm, xcv_padlist_u) - 72usize];
    [
        "Offset of field: xpvfm::xcv_outside",
    ][::std::mem::offset_of!(xpvfm, xcv_outside) - 80usize];
    [
        "Offset of field: xpvfm::xcv_outside_seq",
    ][::std::mem::offset_of!(xpvfm, xcv_outside_seq) - 88usize];
    [
        "Offset of field: xpvfm::xcv_flags",
    ][::std::mem::offset_of!(xpvfm, xcv_flags) - 92usize];
    [
        "Offset of field: xpvfm::xcv_depth",
    ][::std::mem::offset_of!(xpvfm, xcv_depth) - 96usize];
};
impl ::std::fmt::Debug for xpvfm {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "xpvfm {{ xmg_stash: {:?}, xmg_u: {:?}, xpv_len_u: {:?}, xcv_stash: {:?}, xcv_start_u: {:?}, xcv_root_u: {:?}, xcv_gv_u: {:?}, xcv_file: {:?}, xcv_padlist_u: {:?}, xcv_outside: {:?}, xcv_outside_seq: {:?}, xcv_flags: {:?}, xcv_depth: {:?} }}",
            self.xmg_stash,
            self.xmg_u,
            self.xpv_len_u,
            self.xcv_stash,
            self.xcv_start_u,
            self.xcv_root_u,
            self.xcv_gv_u,
            self.xcv_file,
            self.xcv_padlist_u,
            self.xcv_outside,
            self.xcv_outside_seq,
            self.xcv_flags,
            self.xcv_depth,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct xpvio {
    pub xmg_stash: *mut HV,
    pub xmg_u: _xmgu,
    pub xpv_cur: STRLEN,
    pub xpv_len_u: xpvio__bindgen_ty_1,
    pub xiv_u: _xivu,
    pub xio_ofp: *mut PerlIO,
    pub xio_dirpu: xpvio__bindgen_ty_2,
    pub xio_page: IV,
    pub xio_page_len: IV,
    pub xio_lines_left: IV,
    pub xio_top_name: *mut ::std::os::raw::c_char,
    pub xio_top_gv: *mut GV,
    pub xio_fmt_name: *mut ::std::os::raw::c_char,
    pub xio_fmt_gv: *mut GV,
    pub xio_bottom_name: *mut ::std::os::raw::c_char,
    pub xio_bottom_gv: *mut GV,
    pub xio_type: ::std::os::raw::c_char,
    pub xio_flags: U8,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpvio__bindgen_ty_1 {
    pub xpvlenu_len: STRLEN,
    pub xpvlenu_rx: *mut regexp,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of xpvio__bindgen_ty_1",
    ][::std::mem::size_of::<xpvio__bindgen_ty_1>() - 8usize];
    [
        "Alignment of xpvio__bindgen_ty_1",
    ][::std::mem::align_of::<xpvio__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: xpvio__bindgen_ty_1::xpvlenu_len",
    ][::std::mem::offset_of!(xpvio__bindgen_ty_1, xpvlenu_len) - 0usize];
    [
        "Offset of field: xpvio__bindgen_ty_1::xpvlenu_rx",
    ][::std::mem::offset_of!(xpvio__bindgen_ty_1, xpvlenu_rx) - 0usize];
};
impl ::std::fmt::Debug for xpvio__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpvio__bindgen_ty_1 {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpvio__bindgen_ty_2 {
    pub xiou_dirp: *mut DIR,
    pub xiou_any: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of xpvio__bindgen_ty_2",
    ][::std::mem::size_of::<xpvio__bindgen_ty_2>() - 8usize];
    [
        "Alignment of xpvio__bindgen_ty_2",
    ][::std::mem::align_of::<xpvio__bindgen_ty_2>() - 8usize];
    [
        "Offset of field: xpvio__bindgen_ty_2::xiou_dirp",
    ][::std::mem::offset_of!(xpvio__bindgen_ty_2, xiou_dirp) - 0usize];
    [
        "Offset of field: xpvio__bindgen_ty_2::xiou_any",
    ][::std::mem::offset_of!(xpvio__bindgen_ty_2, xiou_any) - 0usize];
};
impl ::std::fmt::Debug for xpvio__bindgen_ty_2 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpvio__bindgen_ty_2 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xpvio"][::std::mem::size_of::<xpvio>() - 136usize];
    ["Alignment of xpvio"][::std::mem::align_of::<xpvio>() - 8usize];
    [
        "Offset of field: xpvio::xmg_stash",
    ][::std::mem::offset_of!(xpvio, xmg_stash) - 0usize];
    ["Offset of field: xpvio::xmg_u"][::std::mem::offset_of!(xpvio, xmg_u) - 8usize];
    [
        "Offset of field: xpvio::xpv_cur",
    ][::std::mem::offset_of!(xpvio, xpv_cur) - 16usize];
    [
        "Offset of field: xpvio::xpv_len_u",
    ][::std::mem::offset_of!(xpvio, xpv_len_u) - 24usize];
    ["Offset of field: xpvio::xiv_u"][::std::mem::offset_of!(xpvio, xiv_u) - 32usize];
    [
        "Offset of field: xpvio::xio_ofp",
    ][::std::mem::offset_of!(xpvio, xio_ofp) - 40usize];
    [
        "Offset of field: xpvio::xio_dirpu",
    ][::std::mem::offset_of!(xpvio, xio_dirpu) - 48usize];
    [
        "Offset of field: xpvio::xio_page",
    ][::std::mem::offset_of!(xpvio, xio_page) - 56usize];
    [
        "Offset of field: xpvio::xio_page_len",
    ][::std::mem::offset_of!(xpvio, xio_page_len) - 64usize];
    [
        "Offset of field: xpvio::xio_lines_left",
    ][::std::mem::offset_of!(xpvio, xio_lines_left) - 72usize];
    [
        "Offset of field: xpvio::xio_top_name",
    ][::std::mem::offset_of!(xpvio, xio_top_name) - 80usize];
    [
        "Offset of field: xpvio::xio_top_gv",
    ][::std::mem::offset_of!(xpvio, xio_top_gv) - 88usize];
    [
        "Offset of field: xpvio::xio_fmt_name",
    ][::std::mem::offset_of!(xpvio, xio_fmt_name) - 96usize];
    [
        "Offset of field: xpvio::xio_fmt_gv",
    ][::std::mem::offset_of!(xpvio, xio_fmt_gv) - 104usize];
    [
        "Offset of field: xpvio::xio_bottom_name",
    ][::std::mem::offset_of!(xpvio, xio_bottom_name) - 112usize];
    [
        "Offset of field: xpvio::xio_bottom_gv",
    ][::std::mem::offset_of!(xpvio, xio_bottom_gv) - 120usize];
    [
        "Offset of field: xpvio::xio_type",
    ][::std::mem::offset_of!(xpvio, xio_type) - 128usize];
    [
        "Offset of field: xpvio::xio_flags",
    ][::std::mem::offset_of!(xpvio, xio_flags) - 129usize];
};
impl ::std::fmt::Debug for xpvio {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "xpvio {{ xmg_stash: {:?}, xmg_u: {:?}, xpv_len_u: {:?}, xiv_u: {:?}, xio_ofp: {:?}, xio_dirpu: {:?}, xio_page: {:?}, xio_page_len: {:?}, xio_lines_left: {:?}, xio_top_name: {:?}, xio_top_gv: {:?}, xio_fmt_name: {:?}, xio_fmt_gv: {:?}, xio_bottom_name: {:?}, xio_bottom_gv: {:?}, xio_type: {:?}, xio_flags: {:?} }}",
            self.xmg_stash,
            self.xmg_u,
            self.xpv_len_u,
            self.xiv_u,
            self.xio_ofp,
            self.xio_dirpu,
            self.xio_page,
            self.xio_page_len,
            self.xio_lines_left,
            self.xio_top_name,
            self.xio_top_gv,
            self.xio_fmt_name,
            self.xio_fmt_gv,
            self.xio_bottom_name,
            self.xio_bottom_gv,
            self.xio_type,
            self.xio_flags,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct xobject {
    pub xmg_stash: *mut HV,
    pub xmg_u: _xmgu,
    pub xobject_maxfield: isize,
    pub xobject_iter_sv_at: isize,
    pub xobject_fields: *mut *mut SV,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xobject"][::std::mem::size_of::<xobject>() - 40usize];
    ["Alignment of xobject"][::std::mem::align_of::<xobject>() - 8usize];
    [
        "Offset of field: xobject::xmg_stash",
    ][::std::mem::offset_of!(xobject, xmg_stash) - 0usize];
    ["Offset of field: xobject::xmg_u"][::std::mem::offset_of!(xobject, xmg_u) - 8usize];
    [
        "Offset of field: xobject::xobject_maxfield",
    ][::std::mem::offset_of!(xobject, xobject_maxfield) - 16usize];
    [
        "Offset of field: xobject::xobject_iter_sv_at",
    ][::std::mem::offset_of!(xobject, xobject_iter_sv_at) - 24usize];
    [
        "Offset of field: xobject::xobject_fields",
    ][::std::mem::offset_of!(xobject, xobject_fields) - 32usize];
};
impl ::std::fmt::Debug for xobject {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "xobject {{ xmg_stash: {:?}, xmg_u: {:?}, xobject_fields: {:?} }}",
            self.xmg_stash,
            self.xmg_u,
            self.xobject_fields,
        )
    }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum PL_SvPVtype {
    SvPVutf8_type_ = 0,
    SvPVbyte_type_ = 1,
    SvPVnormal_type_ = 2,
    SvPVforce_type_ = 3,
    SvPVutf8_pure_type_ = 4,
    SvPVbyte_pure_type_ = 5,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct clone_params {
    pub stashes: *mut AV,
    pub flags: UV,
    pub proto_perl: *mut PerlInterpreter,
    pub new_perl: *mut PerlInterpreter,
    pub unreferenced: *mut AV,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of clone_params"][::std::mem::size_of::<clone_params>() - 40usize];
    ["Alignment of clone_params"][::std::mem::align_of::<clone_params>() - 8usize];
    [
        "Offset of field: clone_params::stashes",
    ][::std::mem::offset_of!(clone_params, stashes) - 0usize];
    [
        "Offset of field: clone_params::flags",
    ][::std::mem::offset_of!(clone_params, flags) - 8usize];
    [
        "Offset of field: clone_params::proto_perl",
    ][::std::mem::offset_of!(clone_params, proto_perl) - 16usize];
    [
        "Offset of field: clone_params::new_perl",
    ][::std::mem::offset_of!(clone_params, new_perl) - 24usize];
    [
        "Offset of field: clone_params::unreferenced",
    ][::std::mem::offset_of!(clone_params, unreferenced) - 32usize];
};
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum utf8ness_t {
    UTF8NESS_NO = 0,
    UTF8NESS_IMMATERIAL = 1,
    UTF8NESS_YES = 2,
    UTF8NESS_UNKNOWN = -1,
}
unsafe extern "C" {
    pub static PL_utf8skip: [::std::os::raw::c_uchar; 256usize];
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union regnode_head {
    pub data: regnode_head__bindgen_ty_1,
    pub data_u32: U32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct regnode_head__bindgen_ty_1 {
    pub u_8: regnode_head__bindgen_ty_1__bindgen_ty_1,
    pub type_: U8,
    pub next_off: U16,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union regnode_head__bindgen_ty_1__bindgen_ty_1 {
    pub flags: U8,
    pub str_len_u8: U8,
    pub first_byte: U8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of regnode_head__bindgen_ty_1__bindgen_ty_1",
    ][::std::mem::size_of::<regnode_head__bindgen_ty_1__bindgen_ty_1>() - 1usize];
    [
        "Alignment of regnode_head__bindgen_ty_1__bindgen_ty_1",
    ][::std::mem::align_of::<regnode_head__bindgen_ty_1__bindgen_ty_1>() - 1usize];
    [
        "Offset of field: regnode_head__bindgen_ty_1__bindgen_ty_1::flags",
    ][::std::mem::offset_of!(regnode_head__bindgen_ty_1__bindgen_ty_1, flags) - 0usize];
    [
        "Offset of field: regnode_head__bindgen_ty_1__bindgen_ty_1::str_len_u8",
    ][::std::mem::offset_of!(regnode_head__bindgen_ty_1__bindgen_ty_1, str_len_u8)
        - 0usize];
    [
        "Offset of field: regnode_head__bindgen_ty_1__bindgen_ty_1::first_byte",
    ][::std::mem::offset_of!(regnode_head__bindgen_ty_1__bindgen_ty_1, first_byte)
        - 0usize];
};
impl ::std::fmt::Debug for regnode_head__bindgen_ty_1__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "regnode_head__bindgen_ty_1__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of regnode_head__bindgen_ty_1",
    ][::std::mem::size_of::<regnode_head__bindgen_ty_1>() - 4usize];
    [
        "Alignment of regnode_head__bindgen_ty_1",
    ][::std::mem::align_of::<regnode_head__bindgen_ty_1>() - 2usize];
    [
        "Offset of field: regnode_head__bindgen_ty_1::u_8",
    ][::std::mem::offset_of!(regnode_head__bindgen_ty_1, u_8) - 0usize];
    [
        "Offset of field: regnode_head__bindgen_ty_1::type_",
    ][::std::mem::offset_of!(regnode_head__bindgen_ty_1, type_) - 1usize];
    [
        "Offset of field: regnode_head__bindgen_ty_1::next_off",
    ][::std::mem::offset_of!(regnode_head__bindgen_ty_1, next_off) - 2usize];
};
impl ::std::fmt::Debug for regnode_head__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "regnode_head__bindgen_ty_1 {{ u_8: {:?}, type: {:?}, next_off: {:?} }}",
            self.u_8,
            self.type_,
            self.next_off,
        )
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of regnode_head"][::std::mem::size_of::<regnode_head>() - 4usize];
    ["Alignment of regnode_head"][::std::mem::align_of::<regnode_head>() - 4usize];
    [
        "Offset of field: regnode_head::data",
    ][::std::mem::offset_of!(regnode_head, data) - 0usize];
    [
        "Offset of field: regnode_head::data_u32",
    ][::std::mem::offset_of!(regnode_head, data_u32) - 0usize];
};
impl ::std::fmt::Debug for regnode_head {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "regnode_head {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct regnode {
    pub head: regnode_head,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of regnode"][::std::mem::size_of::<regnode>() - 4usize];
    ["Alignment of regnode"][::std::mem::align_of::<regnode>() - 4usize];
    ["Offset of field: regnode::head"][::std::mem::offset_of!(regnode, head) - 0usize];
};
impl ::std::fmt::Debug for regnode {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "regnode {{ head: {:?} }}", self.head)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct reg_substr_datum {
    pub min_offset: isize,
    pub max_offset: isize,
    pub substr: *mut SV,
    pub utf8_substr: *mut SV,
    pub end_shift: isize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of reg_substr_datum"][::std::mem::size_of::<reg_substr_datum>() - 40usize];
    [
        "Alignment of reg_substr_datum",
    ][::std::mem::align_of::<reg_substr_datum>() - 8usize];
    [
        "Offset of field: reg_substr_datum::min_offset",
    ][::std::mem::offset_of!(reg_substr_datum, min_offset) - 0usize];
    [
        "Offset of field: reg_substr_datum::max_offset",
    ][::std::mem::offset_of!(reg_substr_datum, max_offset) - 8usize];
    [
        "Offset of field: reg_substr_datum::substr",
    ][::std::mem::offset_of!(reg_substr_datum, substr) - 16usize];
    [
        "Offset of field: reg_substr_datum::utf8_substr",
    ][::std::mem::offset_of!(reg_substr_datum, utf8_substr) - 24usize];
    [
        "Offset of field: reg_substr_datum::end_shift",
    ][::std::mem::offset_of!(reg_substr_datum, end_shift) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct reg_substr_data {
    pub check_ix: U8,
    pub data: [reg_substr_datum; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of reg_substr_data"][::std::mem::size_of::<reg_substr_data>() - 128usize];
    ["Alignment of reg_substr_data"][::std::mem::align_of::<reg_substr_data>() - 8usize];
    [
        "Offset of field: reg_substr_data::check_ix",
    ][::std::mem::offset_of!(reg_substr_data, check_ix) - 0usize];
    [
        "Offset of field: reg_substr_data::data",
    ][::std::mem::offset_of!(reg_substr_data, data) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regexp_paren_pair {
    pub start: isize,
    pub end: isize,
    pub start_tmp: isize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of regexp_paren_pair"][::std::mem::size_of::<regexp_paren_pair>() - 24usize];
    [
        "Alignment of regexp_paren_pair",
    ][::std::mem::align_of::<regexp_paren_pair>() - 8usize];
    [
        "Offset of field: regexp_paren_pair::start",
    ][::std::mem::offset_of!(regexp_paren_pair, start) - 0usize];
    [
        "Offset of field: regexp_paren_pair::end",
    ][::std::mem::offset_of!(regexp_paren_pair, end) - 8usize];
    [
        "Offset of field: regexp_paren_pair::start_tmp",
    ][::std::mem::offset_of!(regexp_paren_pair, start_tmp) - 16usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct regexp {
    pub xmg_stash: *mut HV,
    pub xmg_u: _xmgu,
    pub xpv_cur: STRLEN,
    pub xpv_len_u: regexp__bindgen_ty_1,
    pub engine: *const regexp_engine,
    pub mother_re: *mut REGEXP,
    pub paren_names: *mut HV,
    pub nparens: U32,
    pub logical_nparens: U32,
    pub logical_to_parno: *mut I32,
    pub parno_to_logical: *mut I32,
    pub parno_to_logical_next: *mut I32,
    pub maxlen: isize,
    pub minlen: isize,
    pub minlenret: isize,
    pub gofs: STRLEN,
    pub substrs: *mut reg_substr_data,
    pub pprivate: *mut ::std::os::raw::c_void,
    pub extflags: U32,
    pub intflags: U32,
    pub lastparen: U32,
    pub lastcloseparen: U32,
    pub offs: *mut regexp_paren_pair,
    pub recurse_locinput: *mut *mut ::std::os::raw::c_char,
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub subbeg: *mut ::std::os::raw::c_char,
    pub saved_copy: *mut SV,
    pub sublen: isize,
    pub suboffset: isize,
    pub subcoffset: isize,
    pub qr_anoncv: *mut CV,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union regexp__bindgen_ty_1 {
    pub xpvlenu_len: STRLEN,
    pub xpvlenu_rx: *mut regexp,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of regexp__bindgen_ty_1",
    ][::std::mem::size_of::<regexp__bindgen_ty_1>() - 8usize];
    [
        "Alignment of regexp__bindgen_ty_1",
    ][::std::mem::align_of::<regexp__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: regexp__bindgen_ty_1::xpvlenu_len",
    ][::std::mem::offset_of!(regexp__bindgen_ty_1, xpvlenu_len) - 0usize];
    [
        "Offset of field: regexp__bindgen_ty_1::xpvlenu_rx",
    ][::std::mem::offset_of!(regexp__bindgen_ty_1, xpvlenu_rx) - 0usize];
};
impl ::std::fmt::Debug for regexp__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "regexp__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of regexp"][::std::mem::size_of::<regexp>() - 224usize];
    ["Alignment of regexp"][::std::mem::align_of::<regexp>() - 8usize];
    [
        "Offset of field: regexp::xmg_stash",
    ][::std::mem::offset_of!(regexp, xmg_stash) - 0usize];
    ["Offset of field: regexp::xmg_u"][::std::mem::offset_of!(regexp, xmg_u) - 8usize];
    [
        "Offset of field: regexp::xpv_cur",
    ][::std::mem::offset_of!(regexp, xpv_cur) - 16usize];
    [
        "Offset of field: regexp::xpv_len_u",
    ][::std::mem::offset_of!(regexp, xpv_len_u) - 24usize];
    [
        "Offset of field: regexp::engine",
    ][::std::mem::offset_of!(regexp, engine) - 32usize];
    [
        "Offset of field: regexp::mother_re",
    ][::std::mem::offset_of!(regexp, mother_re) - 40usize];
    [
        "Offset of field: regexp::paren_names",
    ][::std::mem::offset_of!(regexp, paren_names) - 48usize];
    [
        "Offset of field: regexp::nparens",
    ][::std::mem::offset_of!(regexp, nparens) - 56usize];
    [
        "Offset of field: regexp::logical_nparens",
    ][::std::mem::offset_of!(regexp, logical_nparens) - 60usize];
    [
        "Offset of field: regexp::logical_to_parno",
    ][::std::mem::offset_of!(regexp, logical_to_parno) - 64usize];
    [
        "Offset of field: regexp::parno_to_logical",
    ][::std::mem::offset_of!(regexp, parno_to_logical) - 72usize];
    [
        "Offset of field: regexp::parno_to_logical_next",
    ][::std::mem::offset_of!(regexp, parno_to_logical_next) - 80usize];
    [
        "Offset of field: regexp::maxlen",
    ][::std::mem::offset_of!(regexp, maxlen) - 88usize];
    [
        "Offset of field: regexp::minlen",
    ][::std::mem::offset_of!(regexp, minlen) - 96usize];
    [
        "Offset of field: regexp::minlenret",
    ][::std::mem::offset_of!(regexp, minlenret) - 104usize];
    ["Offset of field: regexp::gofs"][::std::mem::offset_of!(regexp, gofs) - 112usize];
    [
        "Offset of field: regexp::substrs",
    ][::std::mem::offset_of!(regexp, substrs) - 120usize];
    [
        "Offset of field: regexp::pprivate",
    ][::std::mem::offset_of!(regexp, pprivate) - 128usize];
    [
        "Offset of field: regexp::extflags",
    ][::std::mem::offset_of!(regexp, extflags) - 136usize];
    [
        "Offset of field: regexp::intflags",
    ][::std::mem::offset_of!(regexp, intflags) - 140usize];
    [
        "Offset of field: regexp::lastparen",
    ][::std::mem::offset_of!(regexp, lastparen) - 144usize];
    [
        "Offset of field: regexp::lastcloseparen",
    ][::std::mem::offset_of!(regexp, lastcloseparen) - 148usize];
    ["Offset of field: regexp::offs"][::std::mem::offset_of!(regexp, offs) - 152usize];
    [
        "Offset of field: regexp::recurse_locinput",
    ][::std::mem::offset_of!(regexp, recurse_locinput) - 160usize];
    [
        "Offset of field: regexp::subbeg",
    ][::std::mem::offset_of!(regexp, subbeg) - 176usize];
    [
        "Offset of field: regexp::saved_copy",
    ][::std::mem::offset_of!(regexp, saved_copy) - 184usize];
    [
        "Offset of field: regexp::sublen",
    ][::std::mem::offset_of!(regexp, sublen) - 192usize];
    [
        "Offset of field: regexp::suboffset",
    ][::std::mem::offset_of!(regexp, suboffset) - 200usize];
    [
        "Offset of field: regexp::subcoffset",
    ][::std::mem::offset_of!(regexp, subcoffset) - 208usize];
    [
        "Offset of field: regexp::qr_anoncv",
    ][::std::mem::offset_of!(regexp, qr_anoncv) - 216usize];
};
impl ::std::fmt::Debug for regexp {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "regexp {{ xmg_stash: {:?}, xmg_u: {:?}, xpv_len_u: {:?}, engine: {:?}, mother_re: {:?}, paren_names: {:?}, nparens: {:?}, logical_nparens: {:?}, logical_to_parno: {:?}, parno_to_logical: {:?}, parno_to_logical_next: {:?}, substrs: {:?}, pprivate: {:?}, extflags: {:?}, intflags: {:?}, lastparen: {:?}, lastcloseparen: {:?}, offs: {:?}, recurse_locinput: {:?}, pre_prefix : {:?}, compflags : {:?}, subbeg: {:?}, saved_copy: {:?}, qr_anoncv: {:?} }}",
            self.xmg_stash,
            self.xmg_u,
            self.xpv_len_u,
            self.engine,
            self.mother_re,
            self.paren_names,
            self.nparens,
            self.logical_nparens,
            self.logical_to_parno,
            self.parno_to_logical,
            self.parno_to_logical_next,
            self.substrs,
            self.pprivate,
            self.extflags,
            self.intflags,
            self.lastparen,
            self.lastcloseparen,
            self.offs,
            self.recurse_locinput,
            self.pre_prefix(),
            self.compflags(),
            self.subbeg,
            self.saved_copy,
            self.qr_anoncv,
        )
    }
}
impl regexp {
    #[inline]
    pub fn pre_prefix(&self) -> U32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_pre_prefix(&mut self, val: U32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn pre_prefix_raw(this: *const Self) -> U32 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 0usize, 4u8)
                    as u32,
            )
        }
    }
    #[inline]
    pub unsafe fn set_pre_prefix_raw(this: *mut Self, val: U32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn compflags(&self) -> U32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 9u8) as u32) }
    }
    #[inline]
    pub fn set_compflags(&mut self, val: U32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn compflags_raw(this: *const Self) -> U32 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 4usize, 9u8)
                    as u32,
            )
        }
    }
    #[inline]
    pub unsafe fn set_compflags_raw(this: *mut Self, val: U32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                9u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        pre_prefix: U32,
        compflags: U32,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                4u8,
                {
                    let pre_prefix: u32 = unsafe { ::std::mem::transmute(pre_prefix) };
                    pre_prefix as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                4usize,
                9u8,
                {
                    let compflags: u32 = unsafe { ::std::mem::transmute(compflags) };
                    compflags as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct re_scream_pos_data_s {
    pub scream_olds: *mut *mut ::std::os::raw::c_char,
    pub scream_pos: *mut isize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of re_scream_pos_data_s",
    ][::std::mem::size_of::<re_scream_pos_data_s>() - 16usize];
    [
        "Alignment of re_scream_pos_data_s",
    ][::std::mem::align_of::<re_scream_pos_data_s>() - 8usize];
    [
        "Offset of field: re_scream_pos_data_s::scream_olds",
    ][::std::mem::offset_of!(re_scream_pos_data_s, scream_olds) - 0usize];
    [
        "Offset of field: re_scream_pos_data_s::scream_pos",
    ][::std::mem::offset_of!(re_scream_pos_data_s, scream_pos) - 8usize];
};
pub type re_scream_pos_data = re_scream_pos_data_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regexp_engine {
    pub comp: ::std::option::Option<
        unsafe extern "C" fn(
            my_perl: *mut PerlInterpreter,
            pattern: *mut SV,
            flags: U32,
        ) -> *mut REGEXP,
    >,
    pub exec: ::std::option::Option<
        unsafe extern "C" fn(
            my_perl: *mut PerlInterpreter,
            rx: *mut REGEXP,
            stringarg: *mut ::std::os::raw::c_char,
            strend: *mut ::std::os::raw::c_char,
            strbeg: *mut ::std::os::raw::c_char,
            minend: isize,
            sv: *mut SV,
            data: *mut ::std::os::raw::c_void,
            flags: U32,
        ) -> I32,
    >,
    pub intuit: ::std::option::Option<
        unsafe extern "C" fn(
            my_perl: *mut PerlInterpreter,
            rx: *mut REGEXP,
            sv: *mut SV,
            strbeg: *const ::std::os::raw::c_char,
            strpos: *mut ::std::os::raw::c_char,
            strend: *mut ::std::os::raw::c_char,
            flags: U32,
            data: *mut re_scream_pos_data,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub checkstr: ::std::option::Option<
        unsafe extern "C" fn(my_perl: *mut PerlInterpreter, rx: *mut REGEXP) -> *mut SV,
    >,
    pub rxfree: ::std::option::Option<
        unsafe extern "C" fn(my_perl: *mut PerlInterpreter, rx: *mut REGEXP),
    >,
    pub numbered_buff_FETCH: ::std::option::Option<
        unsafe extern "C" fn(
            my_perl: *mut PerlInterpreter,
            rx: *mut REGEXP,
            paren: I32,
            sv: *mut SV,
        ),
    >,
    pub numbered_buff_STORE: ::std::option::Option<
        unsafe extern "C" fn(
            my_perl: *mut PerlInterpreter,
            rx: *mut REGEXP,
            paren: I32,
            value: *const SV,
        ),
    >,
    pub numbered_buff_LENGTH: ::std::option::Option<
        unsafe extern "C" fn(
            my_perl: *mut PerlInterpreter,
            rx: *mut REGEXP,
            sv: *const SV,
            paren: I32,
        ) -> I32,
    >,
    pub named_buff: ::std::option::Option<
        unsafe extern "C" fn(
            my_perl: *mut PerlInterpreter,
            rx: *mut REGEXP,
            key: *mut SV,
            value: *mut SV,
            flags: U32,
        ) -> *mut SV,
    >,
    pub named_buff_iter: ::std::option::Option<
        unsafe extern "C" fn(
            my_perl: *mut PerlInterpreter,
            rx: *mut REGEXP,
            lastkey: *const SV,
            flags: U32,
        ) -> *mut SV,
    >,
    pub qr_package: ::std::option::Option<
        unsafe extern "C" fn(my_perl: *mut PerlInterpreter, rx: *mut REGEXP) -> *mut SV,
    >,
    pub dupe: ::std::option::Option<
        unsafe extern "C" fn(
            my_perl: *mut PerlInterpreter,
            rx: *mut REGEXP,
            param: *mut CLONE_PARAMS,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub op_comp: ::std::option::Option<
        unsafe extern "C" fn(
            my_perl: *mut PerlInterpreter,
            patternp: *mut *mut SV,
            pat_count: ::std::os::raw::c_int,
            expr: *mut OP,
            eng: *const regexp_engine,
            old_re: *mut REGEXP,
            is_bare_re: *mut bool,
            orig_rx_flags: U32,
            pm_flags: U32,
        ) -> *mut REGEXP,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of regexp_engine"][::std::mem::size_of::<regexp_engine>() - 104usize];
    ["Alignment of regexp_engine"][::std::mem::align_of::<regexp_engine>() - 8usize];
    [
        "Offset of field: regexp_engine::comp",
    ][::std::mem::offset_of!(regexp_engine, comp) - 0usize];
    [
        "Offset of field: regexp_engine::exec",
    ][::std::mem::offset_of!(regexp_engine, exec) - 8usize];
    [
        "Offset of field: regexp_engine::intuit",
    ][::std::mem::offset_of!(regexp_engine, intuit) - 16usize];
    [
        "Offset of field: regexp_engine::checkstr",
    ][::std::mem::offset_of!(regexp_engine, checkstr) - 24usize];
    [
        "Offset of field: regexp_engine::rxfree",
    ][::std::mem::offset_of!(regexp_engine, rxfree) - 32usize];
    [
        "Offset of field: regexp_engine::numbered_buff_FETCH",
    ][::std::mem::offset_of!(regexp_engine, numbered_buff_FETCH) - 40usize];
    [
        "Offset of field: regexp_engine::numbered_buff_STORE",
    ][::std::mem::offset_of!(regexp_engine, numbered_buff_STORE) - 48usize];
    [
        "Offset of field: regexp_engine::numbered_buff_LENGTH",
    ][::std::mem::offset_of!(regexp_engine, numbered_buff_LENGTH) - 56usize];
    [
        "Offset of field: regexp_engine::named_buff",
    ][::std::mem::offset_of!(regexp_engine, named_buff) - 64usize];
    [
        "Offset of field: regexp_engine::named_buff_iter",
    ][::std::mem::offset_of!(regexp_engine, named_buff_iter) - 72usize];
    [
        "Offset of field: regexp_engine::qr_package",
    ][::std::mem::offset_of!(regexp_engine, qr_package) - 80usize];
    [
        "Offset of field: regexp_engine::dupe",
    ][::std::mem::offset_of!(regexp_engine, dupe) - 88usize];
    [
        "Offset of field: regexp_engine::op_comp",
    ][::std::mem::offset_of!(regexp_engine, op_comp) - 96usize];
};
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum regex_charset {
    REGEX_DEPENDS_CHARSET = 0,
    REGEX_LOCALE_CHARSET = 1,
    REGEX_UNICODE_CHARSET = 2,
    REGEX_ASCII_RESTRICTED_CHARSET = 3,
    REGEX_ASCII_MORE_RESTRICTED_CHARSET = 4,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regmatch_info_aux_eval {
    pub rex: *mut regexp,
    pub curpm: *mut PMOP,
    pub saved_copy: *mut SV,
    pub subbeg: *mut ::std::os::raw::c_char,
    pub sublen: STRLEN,
    pub suboffset: STRLEN,
    pub subcoffset: STRLEN,
    pub sv: *mut SV,
    pub pos_magic: *mut MAGIC,
    pub pos: isize,
    pub pos_flags: U8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of regmatch_info_aux_eval",
    ][::std::mem::size_of::<regmatch_info_aux_eval>() - 88usize];
    [
        "Alignment of regmatch_info_aux_eval",
    ][::std::mem::align_of::<regmatch_info_aux_eval>() - 8usize];
    [
        "Offset of field: regmatch_info_aux_eval::rex",
    ][::std::mem::offset_of!(regmatch_info_aux_eval, rex) - 0usize];
    [
        "Offset of field: regmatch_info_aux_eval::curpm",
    ][::std::mem::offset_of!(regmatch_info_aux_eval, curpm) - 8usize];
    [
        "Offset of field: regmatch_info_aux_eval::saved_copy",
    ][::std::mem::offset_of!(regmatch_info_aux_eval, saved_copy) - 16usize];
    [
        "Offset of field: regmatch_info_aux_eval::subbeg",
    ][::std::mem::offset_of!(regmatch_info_aux_eval, subbeg) - 24usize];
    [
        "Offset of field: regmatch_info_aux_eval::sublen",
    ][::std::mem::offset_of!(regmatch_info_aux_eval, sublen) - 32usize];
    [
        "Offset of field: regmatch_info_aux_eval::suboffset",
    ][::std::mem::offset_of!(regmatch_info_aux_eval, suboffset) - 40usize];
    [
        "Offset of field: regmatch_info_aux_eval::subcoffset",
    ][::std::mem::offset_of!(regmatch_info_aux_eval, subcoffset) - 48usize];
    [
        "Offset of field: regmatch_info_aux_eval::sv",
    ][::std::mem::offset_of!(regmatch_info_aux_eval, sv) - 56usize];
    [
        "Offset of field: regmatch_info_aux_eval::pos_magic",
    ][::std::mem::offset_of!(regmatch_info_aux_eval, pos_magic) - 64usize];
    [
        "Offset of field: regmatch_info_aux_eval::pos",
    ][::std::mem::offset_of!(regmatch_info_aux_eval, pos) - 72usize];
    [
        "Offset of field: regmatch_info_aux_eval::pos_flags",
    ][::std::mem::offset_of!(regmatch_info_aux_eval, pos_flags) - 80usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regmatch_info_aux {
    pub info_aux_eval: *mut regmatch_info_aux_eval,
    pub old_regmatch_state: *mut regmatch_state,
    pub old_regmatch_slab: *mut regmatch_slab,
    pub poscache: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of regmatch_info_aux"][::std::mem::size_of::<regmatch_info_aux>() - 32usize];
    [
        "Alignment of regmatch_info_aux",
    ][::std::mem::align_of::<regmatch_info_aux>() - 8usize];
    [
        "Offset of field: regmatch_info_aux::info_aux_eval",
    ][::std::mem::offset_of!(regmatch_info_aux, info_aux_eval) - 0usize];
    [
        "Offset of field: regmatch_info_aux::old_regmatch_state",
    ][::std::mem::offset_of!(regmatch_info_aux, old_regmatch_state) - 8usize];
    [
        "Offset of field: regmatch_info_aux::old_regmatch_slab",
    ][::std::mem::offset_of!(regmatch_info_aux, old_regmatch_slab) - 16usize];
    [
        "Offset of field: regmatch_info_aux::poscache",
    ][::std::mem::offset_of!(regmatch_info_aux, poscache) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct next_matchable_info {
    pub first_byte_mask: U8,
    pub first_byte_anded: U8,
    pub mask32: U32,
    pub anded32: U32,
    pub count: PERL_INT_FAST8_T,
    pub min_length: PERL_UINT_FAST8_T,
    pub max_length: PERL_UINT_FAST8_T,
    pub initial_definitive: PERL_UINT_FAST8_T,
    pub initial_exact: PERL_UINT_FAST8_T,
    pub lengths: [PERL_UINT_FAST8_T; 6usize],
    pub matches: [U8; 18usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of next_matchable_info",
    ][::std::mem::size_of::<next_matchable_info>() - 44usize];
    [
        "Alignment of next_matchable_info",
    ][::std::mem::align_of::<next_matchable_info>() - 4usize];
    [
        "Offset of field: next_matchable_info::first_byte_mask",
    ][::std::mem::offset_of!(next_matchable_info, first_byte_mask) - 0usize];
    [
        "Offset of field: next_matchable_info::first_byte_anded",
    ][::std::mem::offset_of!(next_matchable_info, first_byte_anded) - 1usize];
    [
        "Offset of field: next_matchable_info::mask32",
    ][::std::mem::offset_of!(next_matchable_info, mask32) - 4usize];
    [
        "Offset of field: next_matchable_info::anded32",
    ][::std::mem::offset_of!(next_matchable_info, anded32) - 8usize];
    [
        "Offset of field: next_matchable_info::count",
    ][::std::mem::offset_of!(next_matchable_info, count) - 12usize];
    [
        "Offset of field: next_matchable_info::min_length",
    ][::std::mem::offset_of!(next_matchable_info, min_length) - 13usize];
    [
        "Offset of field: next_matchable_info::max_length",
    ][::std::mem::offset_of!(next_matchable_info, max_length) - 14usize];
    [
        "Offset of field: next_matchable_info::initial_definitive",
    ][::std::mem::offset_of!(next_matchable_info, initial_definitive) - 15usize];
    [
        "Offset of field: next_matchable_info::initial_exact",
    ][::std::mem::offset_of!(next_matchable_info, initial_exact) - 16usize];
    [
        "Offset of field: next_matchable_info::lengths",
    ][::std::mem::offset_of!(next_matchable_info, lengths) - 17usize];
    [
        "Offset of field: next_matchable_info::matches",
    ][::std::mem::offset_of!(next_matchable_info, matches) - 23usize];
};
pub type CHECKPOINT = I32;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct regmatch_state {
    pub resume_state: ::std::os::raw::c_int,
    pub locinput: *mut ::std::os::raw::c_char,
    pub loceol: *mut ::std::os::raw::c_char,
    pub sr0: *mut U8,
    pub u: regmatch_state__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union regmatch_state__bindgen_ty_1 {
    pub info_aux: regmatch_info_aux,
    pub info_aux_eval: regmatch_info_aux_eval,
    pub yes: regmatch_state__bindgen_ty_1__bindgen_ty_1,
    pub branchlike: regmatch_state__bindgen_ty_1__bindgen_ty_2,
    pub branch: regmatch_state__bindgen_ty_1__bindgen_ty_3,
    pub trie: regmatch_state__bindgen_ty_1__bindgen_ty_4,
    pub eval: regmatch_state__bindgen_ty_1__bindgen_ty_5,
    pub ifmatch: regmatch_state__bindgen_ty_1__bindgen_ty_6,
    pub mark: regmatch_state__bindgen_ty_1__bindgen_ty_7,
    pub keeper: regmatch_state__bindgen_ty_1__bindgen_ty_8,
    pub curlyx: regmatch_state__bindgen_ty_1__bindgen_ty_9,
    pub whilem: regmatch_state__bindgen_ty_1__bindgen_ty_10,
    pub curlym: regmatch_state__bindgen_ty_1__bindgen_ty_11,
    pub curly: regmatch_state__bindgen_ty_1__bindgen_ty_12,
    pub backref: regmatch_state__bindgen_ty_1__bindgen_ty_13,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regmatch_state__bindgen_ty_1__bindgen_ty_1 {
    pub prev_yes_state: *mut regmatch_state,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of regmatch_state__bindgen_ty_1__bindgen_ty_1",
    ][::std::mem::size_of::<regmatch_state__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    [
        "Alignment of regmatch_state__bindgen_ty_1__bindgen_ty_1",
    ][::std::mem::align_of::<regmatch_state__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_1::prev_yes_state",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_1, prev_yes_state)
        - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regmatch_state__bindgen_ty_1__bindgen_ty_2 {
    pub prev_yes_state: *mut regmatch_state,
    pub lastparen: U32,
    pub lastcloseparen: U32,
    pub cp: CHECKPOINT,
    pub lastcp: CHECKPOINT,
    pub before_paren: U16,
    pub after_paren: U16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of regmatch_state__bindgen_ty_1__bindgen_ty_2",
    ][::std::mem::size_of::<regmatch_state__bindgen_ty_1__bindgen_ty_2>() - 32usize];
    [
        "Alignment of regmatch_state__bindgen_ty_1__bindgen_ty_2",
    ][::std::mem::align_of::<regmatch_state__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_2::prev_yes_state",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_2, prev_yes_state)
        - 0usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_2::lastparen",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_2, lastparen)
        - 8usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_2::lastcloseparen",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_2, lastcloseparen)
        - 12usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_2::cp",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_2, cp) - 16usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_2::lastcp",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_2, lastcp)
        - 20usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_2::before_paren",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_2, before_paren)
        - 24usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_2::after_paren",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_2, after_paren)
        - 26usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regmatch_state__bindgen_ty_1__bindgen_ty_3 {
    pub prev_yes_state: *mut regmatch_state,
    pub lastparen: U32,
    pub lastcloseparen: U32,
    pub cp: CHECKPOINT,
    pub lastcp: CHECKPOINT,
    pub before_paren: U16,
    pub after_paren: U16,
    pub next_branch: *mut regnode,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of regmatch_state__bindgen_ty_1__bindgen_ty_3",
    ][::std::mem::size_of::<regmatch_state__bindgen_ty_1__bindgen_ty_3>() - 40usize];
    [
        "Alignment of regmatch_state__bindgen_ty_1__bindgen_ty_3",
    ][::std::mem::align_of::<regmatch_state__bindgen_ty_1__bindgen_ty_3>() - 8usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_3::prev_yes_state",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_3, prev_yes_state)
        - 0usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_3::lastparen",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_3, lastparen)
        - 8usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_3::lastcloseparen",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_3, lastcloseparen)
        - 12usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_3::cp",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_3, cp) - 16usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_3::lastcp",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_3, lastcp)
        - 20usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_3::before_paren",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_3, before_paren)
        - 24usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_3::after_paren",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_3, after_paren)
        - 26usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_3::next_branch",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_3, next_branch)
        - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regmatch_state__bindgen_ty_1__bindgen_ty_4 {
    pub prev_yes_state: *mut regmatch_state,
    pub lastparen: U32,
    pub lastcloseparen: U32,
    pub cp: CHECKPOINT,
    pub lastcp: CHECKPOINT,
    pub before_paren: U16,
    pub after_paren: U16,
    pub accepted: U32,
    pub longfold: bool,
    pub jump: *mut U16,
    pub j_before_paren: *mut U16,
    pub j_after_paren: *mut U16,
    pub me: *mut regnode,
    pub firstpos: *mut U8,
    pub firstchars: U32,
    pub nextword: U16,
    pub topword: U16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of regmatch_state__bindgen_ty_1__bindgen_ty_4",
    ][::std::mem::size_of::<regmatch_state__bindgen_ty_1__bindgen_ty_4>() - 88usize];
    [
        "Alignment of regmatch_state__bindgen_ty_1__bindgen_ty_4",
    ][::std::mem::align_of::<regmatch_state__bindgen_ty_1__bindgen_ty_4>() - 8usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_4::prev_yes_state",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_4, prev_yes_state)
        - 0usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_4::lastparen",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_4, lastparen)
        - 8usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_4::lastcloseparen",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_4, lastcloseparen)
        - 12usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_4::cp",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_4, cp) - 16usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_4::lastcp",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_4, lastcp)
        - 20usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_4::before_paren",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_4, before_paren)
        - 24usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_4::after_paren",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_4, after_paren)
        - 26usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_4::accepted",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_4, accepted)
        - 28usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_4::longfold",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_4, longfold)
        - 32usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_4::jump",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_4, jump)
        - 40usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_4::j_before_paren",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_4, j_before_paren)
        - 48usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_4::j_after_paren",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_4, j_after_paren)
        - 56usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_4::me",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_4, me) - 64usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_4::firstpos",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_4, firstpos)
        - 72usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_4::firstchars",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_4, firstchars)
        - 80usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_4::nextword",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_4, nextword)
        - 84usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_4::topword",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_4, topword)
        - 86usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regmatch_state__bindgen_ty_1__bindgen_ty_5 {
    pub prev_yes_state: *mut regmatch_state,
    pub prev_curlyx: *mut regmatch_state,
    pub prev_eval: *mut regmatch_state,
    pub prev_rex: *mut REGEXP,
    pub cp: CHECKPOINT,
    pub lastcp: CHECKPOINT,
    pub close_paren: U32,
    pub B: *mut regnode,
    pub prev_recurse_locinput: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of regmatch_state__bindgen_ty_1__bindgen_ty_5",
    ][::std::mem::size_of::<regmatch_state__bindgen_ty_1__bindgen_ty_5>() - 64usize];
    [
        "Alignment of regmatch_state__bindgen_ty_1__bindgen_ty_5",
    ][::std::mem::align_of::<regmatch_state__bindgen_ty_1__bindgen_ty_5>() - 8usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_5::prev_yes_state",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_5, prev_yes_state)
        - 0usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_5::prev_curlyx",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_5, prev_curlyx)
        - 8usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_5::prev_eval",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_5, prev_eval)
        - 16usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_5::prev_rex",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_5, prev_rex)
        - 24usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_5::cp",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_5, cp) - 32usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_5::lastcp",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_5, lastcp)
        - 36usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_5::close_paren",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_5, close_paren)
        - 40usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_5::B",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_5, B) - 48usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_5::prev_recurse_locinput",
    ][::std::mem::offset_of!(
        regmatch_state__bindgen_ty_1__bindgen_ty_5, prev_recurse_locinput
    ) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regmatch_state__bindgen_ty_1__bindgen_ty_6 {
    pub prev_yes_state: *mut regmatch_state,
    pub wanted: I32,
    pub logical: I32,
    pub count: U8,
    pub start: *mut ::std::os::raw::c_char,
    pub end: *mut ::std::os::raw::c_char,
    pub me: *mut regnode,
    pub prev_match_end: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of regmatch_state__bindgen_ty_1__bindgen_ty_6",
    ][::std::mem::size_of::<regmatch_state__bindgen_ty_1__bindgen_ty_6>() - 56usize];
    [
        "Alignment of regmatch_state__bindgen_ty_1__bindgen_ty_6",
    ][::std::mem::align_of::<regmatch_state__bindgen_ty_1__bindgen_ty_6>() - 8usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_6::prev_yes_state",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_6, prev_yes_state)
        - 0usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_6::wanted",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_6, wanted)
        - 8usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_6::logical",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_6, logical)
        - 12usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_6::count",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_6, count)
        - 16usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_6::start",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_6, start)
        - 24usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_6::end",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_6, end) - 32usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_6::me",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_6, me) - 40usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_6::prev_match_end",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_6, prev_match_end)
        - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regmatch_state__bindgen_ty_1__bindgen_ty_7 {
    pub prev_yes_state: *mut regmatch_state,
    pub prev_mark: *mut regmatch_state,
    pub mark_name: *mut SV,
    pub mark_loc: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of regmatch_state__bindgen_ty_1__bindgen_ty_7",
    ][::std::mem::size_of::<regmatch_state__bindgen_ty_1__bindgen_ty_7>() - 32usize];
    [
        "Alignment of regmatch_state__bindgen_ty_1__bindgen_ty_7",
    ][::std::mem::align_of::<regmatch_state__bindgen_ty_1__bindgen_ty_7>() - 8usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_7::prev_yes_state",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_7, prev_yes_state)
        - 0usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_7::prev_mark",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_7, prev_mark)
        - 8usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_7::mark_name",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_7, mark_name)
        - 16usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_7::mark_loc",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_7, mark_loc)
        - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regmatch_state__bindgen_ty_1__bindgen_ty_8 {
    pub val: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of regmatch_state__bindgen_ty_1__bindgen_ty_8",
    ][::std::mem::size_of::<regmatch_state__bindgen_ty_1__bindgen_ty_8>() - 4usize];
    [
        "Alignment of regmatch_state__bindgen_ty_1__bindgen_ty_8",
    ][::std::mem::align_of::<regmatch_state__bindgen_ty_1__bindgen_ty_8>() - 4usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_8::val",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_8, val) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regmatch_state__bindgen_ty_1__bindgen_ty_9 {
    pub prev_yes_state: *mut regmatch_state,
    pub prev_curlyx: *mut regmatch_state,
    pub me: *mut regnode,
    pub B: *mut regnode,
    pub cp: CHECKPOINT,
    pub lastcp: CHECKPOINT,
    pub minmod: bool,
    pub parenfloor: ::std::os::raw::c_int,
    pub count: ::std::os::raw::c_int,
    pub lastloc: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of regmatch_state__bindgen_ty_1__bindgen_ty_9",
    ][::std::mem::size_of::<regmatch_state__bindgen_ty_1__bindgen_ty_9>() - 64usize];
    [
        "Alignment of regmatch_state__bindgen_ty_1__bindgen_ty_9",
    ][::std::mem::align_of::<regmatch_state__bindgen_ty_1__bindgen_ty_9>() - 8usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_9::prev_yes_state",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_9, prev_yes_state)
        - 0usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_9::prev_curlyx",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_9, prev_curlyx)
        - 8usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_9::me",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_9, me) - 16usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_9::B",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_9, B) - 24usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_9::cp",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_9, cp) - 32usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_9::lastcp",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_9, lastcp)
        - 36usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_9::minmod",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_9, minmod)
        - 40usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_9::parenfloor",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_9, parenfloor)
        - 44usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_9::count",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_9, count)
        - 48usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_9::lastloc",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_9, lastloc)
        - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regmatch_state__bindgen_ty_1__bindgen_ty_10 {
    pub prev_yes_state: *mut regmatch_state,
    pub save_curlyx: *mut regmatch_state,
    pub cp: CHECKPOINT,
    pub lastcp: CHECKPOINT,
    pub save_lastloc: *mut ::std::os::raw::c_char,
    pub cache_offset: I32,
    pub cache_mask: I32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of regmatch_state__bindgen_ty_1__bindgen_ty_10",
    ][::std::mem::size_of::<regmatch_state__bindgen_ty_1__bindgen_ty_10>() - 40usize];
    [
        "Alignment of regmatch_state__bindgen_ty_1__bindgen_ty_10",
    ][::std::mem::align_of::<regmatch_state__bindgen_ty_1__bindgen_ty_10>() - 8usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_10::prev_yes_state",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_10, prev_yes_state)
        - 0usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_10::save_curlyx",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_10, save_curlyx)
        - 8usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_10::cp",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_10, cp) - 16usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_10::lastcp",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_10, lastcp)
        - 20usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_10::save_lastloc",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_10, save_lastloc)
        - 24usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_10::cache_offset",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_10, cache_offset)
        - 32usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_10::cache_mask",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_10, cache_mask)
        - 36usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regmatch_state__bindgen_ty_1__bindgen_ty_11 {
    pub prev_yes_state: *mut regmatch_state,
    pub lastparen: U32,
    pub lastcloseparen: U32,
    pub cp: CHECKPOINT,
    pub lastcp: CHECKPOINT,
    pub alen: I32,
    pub count: I32,
    pub minmod: bool,
    pub A: *mut regnode,
    pub B: *mut regnode,
    pub me: *mut regnode,
    pub Binfo: next_matchable_info,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of regmatch_state__bindgen_ty_1__bindgen_ty_11",
    ][::std::mem::size_of::<regmatch_state__bindgen_ty_1__bindgen_ty_11>() - 112usize];
    [
        "Alignment of regmatch_state__bindgen_ty_1__bindgen_ty_11",
    ][::std::mem::align_of::<regmatch_state__bindgen_ty_1__bindgen_ty_11>() - 8usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_11::prev_yes_state",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_11, prev_yes_state)
        - 0usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_11::lastparen",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_11, lastparen)
        - 8usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_11::lastcloseparen",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_11, lastcloseparen)
        - 12usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_11::cp",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_11, cp) - 16usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_11::lastcp",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_11, lastcp)
        - 20usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_11::alen",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_11, alen)
        - 24usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_11::count",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_11, count)
        - 28usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_11::minmod",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_11, minmod)
        - 32usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_11::A",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_11, A) - 40usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_11::B",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_11, B) - 48usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_11::me",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_11, me) - 56usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_11::Binfo",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_11, Binfo)
        - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regmatch_state__bindgen_ty_1__bindgen_ty_12 {
    pub paren: U32,
    pub lastparen: U32,
    pub lastcloseparen: U32,
    pub cp: CHECKPOINT,
    pub lastcp: CHECKPOINT,
    pub maxpos: *mut ::std::os::raw::c_char,
    pub oldloc: *mut ::std::os::raw::c_char,
    pub count: ::std::os::raw::c_int,
    pub min: ::std::os::raw::c_int,
    pub max: ::std::os::raw::c_int,
    pub A: *mut regnode,
    pub B: *mut regnode,
    pub Binfo: next_matchable_info,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of regmatch_state__bindgen_ty_1__bindgen_ty_12",
    ][::std::mem::size_of::<regmatch_state__bindgen_ty_1__bindgen_ty_12>() - 120usize];
    [
        "Alignment of regmatch_state__bindgen_ty_1__bindgen_ty_12",
    ][::std::mem::align_of::<regmatch_state__bindgen_ty_1__bindgen_ty_12>() - 8usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_12::paren",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_12, paren)
        - 0usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_12::lastparen",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_12, lastparen)
        - 4usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_12::lastcloseparen",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_12, lastcloseparen)
        - 8usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_12::cp",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_12, cp) - 12usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_12::lastcp",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_12, lastcp)
        - 16usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_12::maxpos",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_12, maxpos)
        - 24usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_12::oldloc",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_12, oldloc)
        - 32usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_12::count",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_12, count)
        - 40usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_12::min",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_12, min)
        - 44usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_12::max",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_12, max)
        - 48usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_12::A",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_12, A) - 56usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_12::B",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_12, B) - 64usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_12::Binfo",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_12, Binfo)
        - 72usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regmatch_state__bindgen_ty_1__bindgen_ty_13 {
    pub cp: CHECKPOINT,
    pub lastcp: CHECKPOINT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of regmatch_state__bindgen_ty_1__bindgen_ty_13",
    ][::std::mem::size_of::<regmatch_state__bindgen_ty_1__bindgen_ty_13>() - 8usize];
    [
        "Alignment of regmatch_state__bindgen_ty_1__bindgen_ty_13",
    ][::std::mem::align_of::<regmatch_state__bindgen_ty_1__bindgen_ty_13>() - 4usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_13::cp",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_13, cp) - 0usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1__bindgen_ty_13::lastcp",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1__bindgen_ty_13, lastcp)
        - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of regmatch_state__bindgen_ty_1",
    ][::std::mem::size_of::<regmatch_state__bindgen_ty_1>() - 120usize];
    [
        "Alignment of regmatch_state__bindgen_ty_1",
    ][::std::mem::align_of::<regmatch_state__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1::info_aux",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1, info_aux) - 0usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1::info_aux_eval",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1, info_aux_eval) - 0usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1::yes",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1, yes) - 0usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1::branchlike",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1, branchlike) - 0usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1::branch",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1, branch) - 0usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1::trie",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1, trie) - 0usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1::eval",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1, eval) - 0usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1::ifmatch",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1, ifmatch) - 0usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1::mark",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1, mark) - 0usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1::keeper",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1, keeper) - 0usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1::curlyx",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1, curlyx) - 0usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1::whilem",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1, whilem) - 0usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1::curlym",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1, curlym) - 0usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1::curly",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1, curly) - 0usize];
    [
        "Offset of field: regmatch_state__bindgen_ty_1::backref",
    ][::std::mem::offset_of!(regmatch_state__bindgen_ty_1, backref) - 0usize];
};
impl ::std::fmt::Debug for regmatch_state__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "regmatch_state__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of regmatch_state"][::std::mem::size_of::<regmatch_state>() - 152usize];
    ["Alignment of regmatch_state"][::std::mem::align_of::<regmatch_state>() - 8usize];
    [
        "Offset of field: regmatch_state::resume_state",
    ][::std::mem::offset_of!(regmatch_state, resume_state) - 0usize];
    [
        "Offset of field: regmatch_state::locinput",
    ][::std::mem::offset_of!(regmatch_state, locinput) - 8usize];
    [
        "Offset of field: regmatch_state::loceol",
    ][::std::mem::offset_of!(regmatch_state, loceol) - 16usize];
    [
        "Offset of field: regmatch_state::sr0",
    ][::std::mem::offset_of!(regmatch_state, sr0) - 24usize];
    [
        "Offset of field: regmatch_state::u",
    ][::std::mem::offset_of!(regmatch_state, u) - 32usize];
};
impl ::std::fmt::Debug for regmatch_state {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "regmatch_state {{ resume_state: {:?}, locinput: {:?}, loceol: {:?}, sr0: {:?}, u: {:?} }}",
            self.resume_state,
            self.locinput,
            self.loceol,
            self.sr0,
            self.u,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct regmatch_slab {
    pub states: [regmatch_state; 26usize],
    pub prev: *mut regmatch_slab,
    pub next: *mut regmatch_slab,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of regmatch_slab"][::std::mem::size_of::<regmatch_slab>() - 3968usize];
    ["Alignment of regmatch_slab"][::std::mem::align_of::<regmatch_slab>() - 8usize];
    [
        "Offset of field: regmatch_slab::states",
    ][::std::mem::offset_of!(regmatch_slab, states) - 0usize];
    [
        "Offset of field: regmatch_slab::prev",
    ][::std::mem::offset_of!(regmatch_slab, prev) - 3952usize];
    [
        "Offset of field: regmatch_slab::next",
    ][::std::mem::offset_of!(regmatch_slab, next) - 3960usize];
};
impl ::std::fmt::Debug for regmatch_slab {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "regmatch_slab {{ states: {:?}, prev: {:?}, next: {:?} }}",
            self.states,
            self.prev,
            self.next,
        )
    }
}
pub type perl_drand48_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gp {
    pub gp_sv: *mut SV,
    pub gp_io: *mut io,
    pub gp_cv: *mut CV,
    pub gp_cvgen: U32,
    pub gp_refcnt: U32,
    pub gp_hv: *mut HV,
    pub gp_av: *mut AV,
    pub gp_form: *mut CV,
    pub gp_egv: *mut GV,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    pub gp_file_hek: *mut HEK,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gp"][::std::mem::size_of::<gp>() - 80usize];
    ["Alignment of gp"][::std::mem::align_of::<gp>() - 8usize];
    ["Offset of field: gp::gp_sv"][::std::mem::offset_of!(gp, gp_sv) - 0usize];
    ["Offset of field: gp::gp_io"][::std::mem::offset_of!(gp, gp_io) - 8usize];
    ["Offset of field: gp::gp_cv"][::std::mem::offset_of!(gp, gp_cv) - 16usize];
    ["Offset of field: gp::gp_cvgen"][::std::mem::offset_of!(gp, gp_cvgen) - 24usize];
    ["Offset of field: gp::gp_refcnt"][::std::mem::offset_of!(gp, gp_refcnt) - 28usize];
    ["Offset of field: gp::gp_hv"][::std::mem::offset_of!(gp, gp_hv) - 32usize];
    ["Offset of field: gp::gp_av"][::std::mem::offset_of!(gp, gp_av) - 40usize];
    ["Offset of field: gp::gp_form"][::std::mem::offset_of!(gp, gp_form) - 48usize];
    ["Offset of field: gp::gp_egv"][::std::mem::offset_of!(gp, gp_egv) - 56usize];
    [
        "Offset of field: gp::gp_file_hek",
    ][::std::mem::offset_of!(gp, gp_file_hek) - 72usize];
};
impl gp {
    #[inline]
    pub fn gp_line(&self) -> U32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 31u8) as u32) }
    }
    #[inline]
    pub fn set_gp_line(&mut self, val: U32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 31u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn gp_line_raw(this: *const Self) -> U32 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 4usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 0usize, 31u8)
                    as u32,
            )
        }
    }
    #[inline]
    pub unsafe fn set_gp_line_raw(this: *mut Self, val: U32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 4usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                31u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn gp_flags(&self) -> U32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_gp_flags(&mut self, val: U32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn gp_flags_raw(this: *const Self) -> U32 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 4usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 31usize, 1u8)
                    as u32,
            )
        }
    }
    #[inline]
    pub unsafe fn set_gp_flags_raw(this: *mut Self, val: U32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 4usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                31usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        gp_line: U32,
        gp_flags: U32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                31u8,
                {
                    let gp_line: u32 = unsafe { ::std::mem::transmute(gp_line) };
                    gp_line as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                31usize,
                1u8,
                {
                    let gp_flags: u32 = unsafe { ::std::mem::transmute(gp_flags) };
                    gp_flags as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
pub type PADOFFSET = isize;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct padlist {
    pub xpadl_max: isize,
    pub xpadl_arr: padlist__bindgen_ty_1,
    pub xpadl_id: U32,
    pub xpadl_outid: U32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union padlist__bindgen_ty_1 {
    pub xpadlarr_alloc: *mut *mut PAD,
    pub xpadlarr_dbg: *mut padlist__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct padlist__bindgen_ty_1__bindgen_ty_1 {
    pub padnl: *mut PADNAMELIST,
    pub pad_1: *mut PAD,
    pub pad_2: *mut PAD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of padlist__bindgen_ty_1__bindgen_ty_1",
    ][::std::mem::size_of::<padlist__bindgen_ty_1__bindgen_ty_1>() - 24usize];
    [
        "Alignment of padlist__bindgen_ty_1__bindgen_ty_1",
    ][::std::mem::align_of::<padlist__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: padlist__bindgen_ty_1__bindgen_ty_1::padnl",
    ][::std::mem::offset_of!(padlist__bindgen_ty_1__bindgen_ty_1, padnl) - 0usize];
    [
        "Offset of field: padlist__bindgen_ty_1__bindgen_ty_1::pad_1",
    ][::std::mem::offset_of!(padlist__bindgen_ty_1__bindgen_ty_1, pad_1) - 8usize];
    [
        "Offset of field: padlist__bindgen_ty_1__bindgen_ty_1::pad_2",
    ][::std::mem::offset_of!(padlist__bindgen_ty_1__bindgen_ty_1, pad_2) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of padlist__bindgen_ty_1",
    ][::std::mem::size_of::<padlist__bindgen_ty_1>() - 8usize];
    [
        "Alignment of padlist__bindgen_ty_1",
    ][::std::mem::align_of::<padlist__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: padlist__bindgen_ty_1::xpadlarr_alloc",
    ][::std::mem::offset_of!(padlist__bindgen_ty_1, xpadlarr_alloc) - 0usize];
    [
        "Offset of field: padlist__bindgen_ty_1::xpadlarr_dbg",
    ][::std::mem::offset_of!(padlist__bindgen_ty_1, xpadlarr_dbg) - 0usize];
};
impl ::std::fmt::Debug for padlist__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "padlist__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of padlist"][::std::mem::size_of::<padlist>() - 24usize];
    ["Alignment of padlist"][::std::mem::align_of::<padlist>() - 8usize];
    [
        "Offset of field: padlist::xpadl_max",
    ][::std::mem::offset_of!(padlist, xpadl_max) - 0usize];
    [
        "Offset of field: padlist::xpadl_arr",
    ][::std::mem::offset_of!(padlist, xpadl_arr) - 8usize];
    [
        "Offset of field: padlist::xpadl_id",
    ][::std::mem::offset_of!(padlist, xpadl_id) - 16usize];
    [
        "Offset of field: padlist::xpadl_outid",
    ][::std::mem::offset_of!(padlist, xpadl_outid) - 20usize];
};
impl ::std::fmt::Debug for padlist {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "padlist {{ xpadl_arr: {:?}, xpadl_id: {:?}, xpadl_outid: {:?} }}",
            self.xpadl_arr,
            self.xpadl_id,
            self.xpadl_outid,
        )
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct padnamelist {
    pub xpadnl_fill: isize,
    pub xpadnl_alloc: *mut *mut PADNAME,
    pub xpadnl_max: isize,
    pub xpadnl_max_named: PADOFFSET,
    pub xpadnl_refcnt: U32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of padnamelist"][::std::mem::size_of::<padnamelist>() - 40usize];
    ["Alignment of padnamelist"][::std::mem::align_of::<padnamelist>() - 8usize];
    [
        "Offset of field: padnamelist::xpadnl_fill",
    ][::std::mem::offset_of!(padnamelist, xpadnl_fill) - 0usize];
    [
        "Offset of field: padnamelist::xpadnl_alloc",
    ][::std::mem::offset_of!(padnamelist, xpadnl_alloc) - 8usize];
    [
        "Offset of field: padnamelist::xpadnl_max",
    ][::std::mem::offset_of!(padnamelist, xpadnl_max) - 16usize];
    [
        "Offset of field: padnamelist::xpadnl_max_named",
    ][::std::mem::offset_of!(padnamelist, xpadnl_max_named) - 24usize];
    [
        "Offset of field: padnamelist::xpadnl_refcnt",
    ][::std::mem::offset_of!(padnamelist, xpadnl_refcnt) - 32usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct padname {
    pub xpadn_pv: *mut ::std::os::raw::c_char,
    pub xpadn_ourstash: *mut HV,
    pub xpadn_type_u: padname__bindgen_ty_1,
    pub xpadn_fieldinfo: *mut padname_fieldinfo,
    pub xpadn_low: U32,
    pub xpadn_high: U32,
    pub xpadn_refcnt: U32,
    pub xpadn_gen: ::std::os::raw::c_int,
    pub xpadn_len: U8,
    pub xpadn_flags: U8,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union padname__bindgen_ty_1 {
    pub xpadn_typestash: *mut HV,
    pub xpadn_protocv: *mut CV,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of padname__bindgen_ty_1",
    ][::std::mem::size_of::<padname__bindgen_ty_1>() - 8usize];
    [
        "Alignment of padname__bindgen_ty_1",
    ][::std::mem::align_of::<padname__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: padname__bindgen_ty_1::xpadn_typestash",
    ][::std::mem::offset_of!(padname__bindgen_ty_1, xpadn_typestash) - 0usize];
    [
        "Offset of field: padname__bindgen_ty_1::xpadn_protocv",
    ][::std::mem::offset_of!(padname__bindgen_ty_1, xpadn_protocv) - 0usize];
};
impl ::std::fmt::Debug for padname__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "padname__bindgen_ty_1 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of padname"][::std::mem::size_of::<padname>() - 56usize];
    ["Alignment of padname"][::std::mem::align_of::<padname>() - 8usize];
    [
        "Offset of field: padname::xpadn_pv",
    ][::std::mem::offset_of!(padname, xpadn_pv) - 0usize];
    [
        "Offset of field: padname::xpadn_ourstash",
    ][::std::mem::offset_of!(padname, xpadn_ourstash) - 8usize];
    [
        "Offset of field: padname::xpadn_type_u",
    ][::std::mem::offset_of!(padname, xpadn_type_u) - 16usize];
    [
        "Offset of field: padname::xpadn_fieldinfo",
    ][::std::mem::offset_of!(padname, xpadn_fieldinfo) - 24usize];
    [
        "Offset of field: padname::xpadn_low",
    ][::std::mem::offset_of!(padname, xpadn_low) - 32usize];
    [
        "Offset of field: padname::xpadn_high",
    ][::std::mem::offset_of!(padname, xpadn_high) - 36usize];
    [
        "Offset of field: padname::xpadn_refcnt",
    ][::std::mem::offset_of!(padname, xpadn_refcnt) - 40usize];
    [
        "Offset of field: padname::xpadn_gen",
    ][::std::mem::offset_of!(padname, xpadn_gen) - 44usize];
    [
        "Offset of field: padname::xpadn_len",
    ][::std::mem::offset_of!(padname, xpadn_len) - 48usize];
    [
        "Offset of field: padname::xpadn_flags",
    ][::std::mem::offset_of!(padname, xpadn_flags) - 49usize];
};
impl ::std::fmt::Debug for padname {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "padname {{ xpadn_pv: {:?}, xpadn_ourstash: {:?}, xpadn_type_u: {:?}, xpadn_fieldinfo: {:?}, xpadn_low: {:?}, xpadn_high: {:?}, xpadn_refcnt: {:?}, xpadn_gen: {:?}, xpadn_len: {:?}, xpadn_flags: {:?} }}",
            self.xpadn_pv,
            self.xpadn_ourstash,
            self.xpadn_type_u,
            self.xpadn_fieldinfo,
            self.xpadn_low,
            self.xpadn_high,
            self.xpadn_refcnt,
            self.xpadn_gen,
            self.xpadn_len,
            self.xpadn_flags,
        )
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct padname_fieldinfo {
    pub refcount: U32,
    pub fieldix: PADOFFSET,
    pub fieldstash: *mut HV,
    pub defop: *mut OP,
    pub paramname: *mut SV,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 7usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of padname_fieldinfo"][::std::mem::size_of::<padname_fieldinfo>() - 48usize];
    [
        "Alignment of padname_fieldinfo",
    ][::std::mem::align_of::<padname_fieldinfo>() - 8usize];
    [
        "Offset of field: padname_fieldinfo::refcount",
    ][::std::mem::offset_of!(padname_fieldinfo, refcount) - 0usize];
    [
        "Offset of field: padname_fieldinfo::fieldix",
    ][::std::mem::offset_of!(padname_fieldinfo, fieldix) - 8usize];
    [
        "Offset of field: padname_fieldinfo::fieldstash",
    ][::std::mem::offset_of!(padname_fieldinfo, fieldstash) - 16usize];
    [
        "Offset of field: padname_fieldinfo::defop",
    ][::std::mem::offset_of!(padname_fieldinfo, defop) - 24usize];
    [
        "Offset of field: padname_fieldinfo::paramname",
    ][::std::mem::offset_of!(padname_fieldinfo, paramname) - 32usize];
};
impl padname_fieldinfo {
    #[inline]
    pub fn def_if_undef(&self) -> ::std::os::raw::c_int {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_def_if_undef(&mut self, val: ::std::os::raw::c_int) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn def_if_undef_raw(this: *const Self) -> ::std::os::raw::c_int {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 1usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 0usize, 1u8)
                    as u32,
            )
        }
    }
    #[inline]
    pub unsafe fn set_def_if_undef_raw(this: *mut Self, val: ::std::os::raw::c_int) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 1usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn def_if_false(&self) -> ::std::os::raw::c_int {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_def_if_false(&mut self, val: ::std::os::raw::c_int) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn def_if_false_raw(this: *const Self) -> ::std::os::raw::c_int {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 1usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 1usize, 1u8)
                    as u32,
            )
        }
    }
    #[inline]
    pub unsafe fn set_def_if_false_raw(this: *mut Self, val: ::std::os::raw::c_int) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 1usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        def_if_undef: ::std::os::raw::c_int,
        def_if_false: ::std::os::raw::c_int,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                1u8,
                {
                    let def_if_undef: u32 = unsafe {
                        ::std::mem::transmute(def_if_undef)
                    };
                    def_if_undef as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                1usize,
                1u8,
                {
                    let def_if_false: u32 = unsafe {
                        ::std::mem::transmute(def_if_false)
                    };
                    def_if_false as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum padtidy_type {
    padtidy_SUB = 0,
    padtidy_SUBCLONE = 1,
    padtidy_FORMAT = 2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct suspended_compcv {
    pub compcv: *mut CV,
    pub padix: STRLEN,
    pub constpadix: STRLEN,
    pub comppad_name_fill: STRLEN,
    pub min_intro_pending: STRLEN,
    pub max_intro_pending: STRLEN,
    pub cv_has_eval: bool,
    pub pad_reset_pending: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of suspended_compcv"][::std::mem::size_of::<suspended_compcv>() - 56usize];
    [
        "Alignment of suspended_compcv",
    ][::std::mem::align_of::<suspended_compcv>() - 8usize];
    [
        "Offset of field: suspended_compcv::compcv",
    ][::std::mem::offset_of!(suspended_compcv, compcv) - 0usize];
    [
        "Offset of field: suspended_compcv::padix",
    ][::std::mem::offset_of!(suspended_compcv, padix) - 8usize];
    [
        "Offset of field: suspended_compcv::constpadix",
    ][::std::mem::offset_of!(suspended_compcv, constpadix) - 16usize];
    [
        "Offset of field: suspended_compcv::comppad_name_fill",
    ][::std::mem::offset_of!(suspended_compcv, comppad_name_fill) - 24usize];
    [
        "Offset of field: suspended_compcv::min_intro_pending",
    ][::std::mem::offset_of!(suspended_compcv, min_intro_pending) - 32usize];
    [
        "Offset of field: suspended_compcv::max_intro_pending",
    ][::std::mem::offset_of!(suspended_compcv, max_intro_pending) - 40usize];
    [
        "Offset of field: suspended_compcv::cv_has_eval",
    ][::std::mem::offset_of!(suspended_compcv, cv_has_eval) - 48usize];
    [
        "Offset of field: suspended_compcv::pad_reset_pending",
    ][::std::mem::offset_of!(suspended_compcv, pad_reset_pending) - 49usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct xpvcv {
    pub xmg_stash: *mut HV,
    pub xmg_u: _xmgu,
    pub xpv_cur: STRLEN,
    pub xpv_len_u: xpvcv__bindgen_ty_1,
    pub xcv_stash: *mut HV,
    pub xcv_start_u: xpvcv__bindgen_ty_2,
    pub xcv_root_u: xpvcv__bindgen_ty_3,
    pub xcv_gv_u: xpvcv__bindgen_ty_4,
    pub xcv_file: *mut ::std::os::raw::c_char,
    pub xcv_padlist_u: xpvcv__bindgen_ty_5,
    pub xcv_outside: *mut CV,
    pub xcv_outside_seq: U32,
    pub xcv_flags: cv_flags_t,
    pub xcv_depth: I32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpvcv__bindgen_ty_1 {
    pub xpvlenu_len: STRLEN,
    pub xpvlenu_rx: *mut regexp,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of xpvcv__bindgen_ty_1",
    ][::std::mem::size_of::<xpvcv__bindgen_ty_1>() - 8usize];
    [
        "Alignment of xpvcv__bindgen_ty_1",
    ][::std::mem::align_of::<xpvcv__bindgen_ty_1>() - 8usize];
    [
        "Offset of field: xpvcv__bindgen_ty_1::xpvlenu_len",
    ][::std::mem::offset_of!(xpvcv__bindgen_ty_1, xpvlenu_len) - 0usize];
    [
        "Offset of field: xpvcv__bindgen_ty_1::xpvlenu_rx",
    ][::std::mem::offset_of!(xpvcv__bindgen_ty_1, xpvlenu_rx) - 0usize];
};
impl ::std::fmt::Debug for xpvcv__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpvcv__bindgen_ty_1 {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpvcv__bindgen_ty_2 {
    pub xcv_start: *mut OP,
    pub xcv_xsubany: ANY,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of xpvcv__bindgen_ty_2",
    ][::std::mem::size_of::<xpvcv__bindgen_ty_2>() - 8usize];
    [
        "Alignment of xpvcv__bindgen_ty_2",
    ][::std::mem::align_of::<xpvcv__bindgen_ty_2>() - 8usize];
    [
        "Offset of field: xpvcv__bindgen_ty_2::xcv_start",
    ][::std::mem::offset_of!(xpvcv__bindgen_ty_2, xcv_start) - 0usize];
    [
        "Offset of field: xpvcv__bindgen_ty_2::xcv_xsubany",
    ][::std::mem::offset_of!(xpvcv__bindgen_ty_2, xcv_xsubany) - 0usize];
};
impl ::std::fmt::Debug for xpvcv__bindgen_ty_2 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpvcv__bindgen_ty_2 {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpvcv__bindgen_ty_3 {
    pub xcv_root: *mut OP,
    pub xcv_xsub: ::std::option::Option<
        unsafe extern "C" fn(my_perl: *mut PerlInterpreter, arg1: *mut CV),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of xpvcv__bindgen_ty_3",
    ][::std::mem::size_of::<xpvcv__bindgen_ty_3>() - 8usize];
    [
        "Alignment of xpvcv__bindgen_ty_3",
    ][::std::mem::align_of::<xpvcv__bindgen_ty_3>() - 8usize];
    [
        "Offset of field: xpvcv__bindgen_ty_3::xcv_root",
    ][::std::mem::offset_of!(xpvcv__bindgen_ty_3, xcv_root) - 0usize];
    [
        "Offset of field: xpvcv__bindgen_ty_3::xcv_xsub",
    ][::std::mem::offset_of!(xpvcv__bindgen_ty_3, xcv_xsub) - 0usize];
};
impl ::std::fmt::Debug for xpvcv__bindgen_ty_3 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpvcv__bindgen_ty_3 {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpvcv__bindgen_ty_4 {
    pub xcv_gv: *mut GV,
    pub xcv_hek: *mut HEK,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of xpvcv__bindgen_ty_4",
    ][::std::mem::size_of::<xpvcv__bindgen_ty_4>() - 8usize];
    [
        "Alignment of xpvcv__bindgen_ty_4",
    ][::std::mem::align_of::<xpvcv__bindgen_ty_4>() - 8usize];
    [
        "Offset of field: xpvcv__bindgen_ty_4::xcv_gv",
    ][::std::mem::offset_of!(xpvcv__bindgen_ty_4, xcv_gv) - 0usize];
    [
        "Offset of field: xpvcv__bindgen_ty_4::xcv_hek",
    ][::std::mem::offset_of!(xpvcv__bindgen_ty_4, xcv_hek) - 0usize];
};
impl ::std::fmt::Debug for xpvcv__bindgen_ty_4 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpvcv__bindgen_ty_4 {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpvcv__bindgen_ty_5 {
    pub xcv_padlist: *mut PADLIST,
    pub xcv_hscxt: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    [
        "Size of xpvcv__bindgen_ty_5",
    ][::std::mem::size_of::<xpvcv__bindgen_ty_5>() - 8usize];
    [
        "Alignment of xpvcv__bindgen_ty_5",
    ][::std::mem::align_of::<xpvcv__bindgen_ty_5>() - 8usize];
    [
        "Offset of field: xpvcv__bindgen_ty_5::xcv_padlist",
    ][::std::mem::offset_of!(xpvcv__bindgen_ty_5, xcv_padlist) - 0usize];
    [
        "Offset of field: xpvcv__bindgen_ty_5::xcv_hscxt",
    ][::std::mem::offset_of!(xpvcv__bindgen_ty_5, xcv_hscxt) - 0usize];
};
impl ::std::fmt::Debug for xpvcv__bindgen_ty_5 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpvcv__bindgen_ty_5 {{ union }}")
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of xpvcv"][::std::mem::size_of::<xpvcv>() - 104usize];
    ["Alignment of xpvcv"][::std::mem::align_of::<xpvcv>() - 8usize];
    [
        "Offset of field: xpvcv::xmg_stash",
    ][::std::mem::offset_of!(xpvcv, xmg_stash) - 0usize];
    ["Offset of field: xpvcv::xmg_u"][::std::mem::offset_of!(xpvcv, xmg_u) - 8usize];
    [
        "Offset of field: xpvcv::xpv_cur",
    ][::std::mem::offset_of!(xpvcv, xpv_cur) - 16usize];
    [
        "Offset of field: xpvcv::xpv_len_u",
    ][::std::mem::offset_of!(xpvcv, xpv_len_u) - 24usize];
    [
        "Offset of field: xpvcv::xcv_stash",
    ][::std::mem::offset_of!(xpvcv, xcv_stash) - 32usize];
    [
        "Offset of field: xpvcv::xcv_start_u",
    ][::std::mem::offset_of!(xpvcv, xcv_start_u) - 40usize];
    [
        "Offset of field: xpvcv::xcv_root_u",
    ][::std::mem::offset_of!(xpvcv, xcv_root_u) - 48usize];
    [
        "Offset of field: xpvcv::xcv_gv_u",
    ][::std::mem::offset_of!(xpvcv, xcv_gv_u) - 56usize];
    [
        "Offset of field: xpvcv::xcv_file",
    ][::std::mem::offset_of!(xpvcv, xcv_file) - 64usize];
    [
        "Offset of field: xpvcv::xcv_padlist_u",
    ][::std::mem::offset_of!(xpvcv, xcv_padlist_u) - 72usize];
    [
        "Offset of field: xpvcv::xcv_outside",
    ][::std::mem::offset_of!(xpvcv, xcv_outside) - 80usize];
    [
        "Offset of field: xpvcv::xcv_outside_seq",
    ][::std::mem::offset_of!(xpvcv, xcv_outside_seq) - 88usize];
    [
        "Offset of field: xpvcv::xcv_flags",
    ][::std::mem::offset_of!(xpvcv, xcv_flags) - 92usize];
    [
        "Offset of field: xpvcv::xcv_depth",
    ][::std::mem::offset_of!(xpvcv, xcv_depth) - 96usize];
};
impl ::std::fmt::Debug for xpvcv {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "xpvcv {{ xmg_stash: {:?}, xmg_u: {:?}, xpv_len_u: {:?}, xcv_stash: {:?}, xcv_start_u: {:?}, xcv_root_u: {:?}, xcv_gv_u: {:?}, xcv_file: {:?}, xcv_padlist_u: {:?}, xcv_outside: {:?}, xcv_outside_seq: {:?}, xcv_flags: {:?}, xcv_depth: {:?} }}",
            self.xmg_stash,
            self.xmg_u,
            self.xpv_len_u,
            self.xcv_stash,
            self.xcv_start_u,
            self.xcv_root_u,
            self.xcv_gv_u,
            self.xcv_file,
            self.xcv_padlist_u,
            self.xcv_outside,
            self.xcv_outside_seq,
            self.xcv_flags,
            self.xcv_depth,
        )
    }
}
pub type Perl_call_checker = ::std::option::Option<
    unsafe extern "C" fn(
        my_perl: *mut PerlInterpreter,
        arg1: *mut OP,
        arg2: *mut GV,
        arg3: *mut SV,
    ) -> *mut OP,
>;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum opcode {
    OP_NULL = 0,
    OP_STUB = 1,
    OP_SCALAR = 2,
    OP_PUSHMARK = 3,
    OP_WANTARRAY = 4,
    OP_CONST = 5,
    OP_GVSV = 6,
    OP_GV = 7,
    OP_GELEM = 8,
    OP_PADSV = 9,
    OP_PADSV_STORE = 10,
    OP_PADAV = 11,
    OP_PADHV = 12,
    OP_PADANY = 13,
    OP_RV2GV = 14,
    OP_RV2SV = 15,
    OP_AV2ARYLEN = 16,
    OP_RV2CV = 17,
    OP_ANONCODE = 18,
    OP_PROTOTYPE = 19,
    OP_REFGEN = 20,
    OP_SREFGEN = 21,
    OP_REF = 22,
    OP_BLESS = 23,
    OP_BACKTICK = 24,
    OP_GLOB = 25,
    OP_READLINE = 26,
    OP_RCATLINE = 27,
    OP_REGCMAYBE = 28,
    OP_REGCRESET = 29,
    OP_REGCOMP = 30,
    OP_MATCH = 31,
    OP_QR = 32,
    OP_SUBST = 33,
    OP_SUBSTCONT = 34,
    OP_TRANS = 35,
    OP_TRANSR = 36,
    OP_SASSIGN = 37,
    OP_AASSIGN = 38,
    OP_CHOP = 39,
    OP_SCHOP = 40,
    OP_CHOMP = 41,
    OP_SCHOMP = 42,
    OP_DEFINED = 43,
    OP_UNDEF = 44,
    OP_STUDY = 45,
    OP_POS = 46,
    OP_PREINC = 47,
    OP_I_PREINC = 48,
    OP_PREDEC = 49,
    OP_I_PREDEC = 50,
    OP_POSTINC = 51,
    OP_I_POSTINC = 52,
    OP_POSTDEC = 53,
    OP_I_POSTDEC = 54,
    OP_POW = 55,
    OP_MULTIPLY = 56,
    OP_I_MULTIPLY = 57,
    OP_DIVIDE = 58,
    OP_I_DIVIDE = 59,
    OP_MODULO = 60,
    OP_I_MODULO = 61,
    OP_REPEAT = 62,
    OP_ADD = 63,
    OP_I_ADD = 64,
    OP_SUBTRACT = 65,
    OP_I_SUBTRACT = 66,
    OP_CONCAT = 67,
    OP_MULTICONCAT = 68,
    OP_STRINGIFY = 69,
    OP_LEFT_SHIFT = 70,
    OP_RIGHT_SHIFT = 71,
    OP_LT = 72,
    OP_I_LT = 73,
    OP_GT = 74,
    OP_I_GT = 75,
    OP_LE = 76,
    OP_I_LE = 77,
    OP_GE = 78,
    OP_I_GE = 79,
    OP_EQ = 80,
    OP_I_EQ = 81,
    OP_NE = 82,
    OP_I_NE = 83,
    OP_NCMP = 84,
    OP_I_NCMP = 85,
    OP_SLT = 86,
    OP_SGT = 87,
    OP_SLE = 88,
    OP_SGE = 89,
    OP_SEQ = 90,
    OP_SNE = 91,
    OP_SCMP = 92,
    OP_BIT_AND = 93,
    OP_BIT_XOR = 94,
    OP_BIT_OR = 95,
    OP_NBIT_AND = 96,
    OP_NBIT_XOR = 97,
    OP_NBIT_OR = 98,
    OP_SBIT_AND = 99,
    OP_SBIT_XOR = 100,
    OP_SBIT_OR = 101,
    OP_NEGATE = 102,
    OP_I_NEGATE = 103,
    OP_NOT = 104,
    OP_COMPLEMENT = 105,
    OP_NCOMPLEMENT = 106,
    OP_SCOMPLEMENT = 107,
    OP_SMARTMATCH = 108,
    OP_ATAN2 = 109,
    OP_SIN = 110,
    OP_COS = 111,
    OP_RAND = 112,
    OP_SRAND = 113,
    OP_EXP = 114,
    OP_LOG = 115,
    OP_SQRT = 116,
    OP_INT = 117,
    OP_HEX = 118,
    OP_OCT = 119,
    OP_ABS = 120,
    OP_LENGTH = 121,
    OP_SUBSTR = 122,
    OP_VEC = 123,
    OP_INDEX = 124,
    OP_RINDEX = 125,
    OP_SPRINTF = 126,
    OP_FORMLINE = 127,
    OP_ORD = 128,
    OP_CHR = 129,
    OP_CRYPT = 130,
    OP_UCFIRST = 131,
    OP_LCFIRST = 132,
    OP_UC = 133,
    OP_LC = 134,
    OP_QUOTEMETA = 135,
    OP_RV2AV = 136,
    OP_AELEMFAST = 137,
    OP_AELEMFAST_LEX = 138,
    OP_AELEMFASTLEX_STORE = 139,
    OP_AELEM = 140,
    OP_ASLICE = 141,
    OP_KVASLICE = 142,
    OP_AEACH = 143,
    OP_AVALUES = 144,
    OP_AKEYS = 145,
    OP_EACH = 146,
    OP_VALUES = 147,
    OP_KEYS = 148,
    OP_DELETE = 149,
    OP_EXISTS = 150,
    OP_RV2HV = 151,
    OP_HELEM = 152,
    OP_HSLICE = 153,
    OP_KVHSLICE = 154,
    OP_MULTIDEREF = 155,
    OP_UNPACK = 156,
    OP_PACK = 157,
    OP_SPLIT = 158,
    OP_JOIN = 159,
    OP_LIST = 160,
    OP_LSLICE = 161,
    OP_ANONLIST = 162,
    OP_ANONHASH = 163,
    OP_EMPTYAVHV = 164,
    OP_SPLICE = 165,
    OP_PUSH = 166,
    OP_POP = 167,
    OP_SHIFT = 168,
    OP_UNSHIFT = 169,
    OP_SORT = 170,
    OP_REVERSE = 171,
    OP_GREPSTART = 172,
    OP_GREPWHILE = 173,
    OP_MAPSTART = 174,
    OP_MAPWHILE = 175,
    OP_RANGE = 176,
    OP_FLIP = 177,
    OP_FLOP = 178,
    OP_AND = 179,
    OP_OR = 180,
    OP_XOR = 181,
    OP_DOR = 182,
    OP_COND_EXPR = 183,
    OP_ANDASSIGN = 184,
    OP_ORASSIGN = 185,
    OP_DORASSIGN = 186,
    OP_ENTERSUB = 187,
    OP_LEAVESUB = 188,
    OP_LEAVESUBLV = 189,
    OP_ARGCHECK = 190,
    OP_ARGELEM = 191,
    OP_ARGDEFELEM = 192,
    OP_CALLER = 193,
    OP_WARN = 194,
    OP_DIE = 195,
    OP_RESET = 196,
    OP_LINESEQ = 197,
    OP_NEXTSTATE = 198,
    OP_DBSTATE = 199,
    OP_UNSTACK = 200,
    OP_ENTER = 201,
    OP_LEAVE = 202,
    OP_SCOPE = 203,
    OP_ENTERITER = 204,
    OP_ITER = 205,
    OP_ENTERLOOP = 206,
    OP_LEAVELOOP = 207,
    OP_RETURN = 208,
    OP_LAST = 209,
    OP_NEXT = 210,
    OP_REDO = 211,
    OP_DUMP = 212,
    OP_GOTO = 213,
    OP_EXIT = 214,
    OP_METHOD = 215,
    OP_METHOD_NAMED = 216,
    OP_METHOD_SUPER = 217,
    OP_METHOD_REDIR = 218,
    OP_METHOD_REDIR_SUPER = 219,
    OP_ENTERGIVEN = 220,
    OP_LEAVEGIVEN = 221,
    OP_ENTERWHEN = 222,
    OP_LEAVEWHEN = 223,
    OP_BREAK = 224,
    OP_CONTINUE = 225,
    OP_OPEN = 226,
    OP_CLOSE = 227,
    OP_PIPE_OP = 228,
    OP_FILENO = 229,
    OP_UMASK = 230,
    OP_BINMODE = 231,
    OP_TIE = 232,
    OP_UNTIE = 233,
    OP_TIED = 234,
    OP_DBMOPEN = 235,
    OP_DBMCLOSE = 236,
    OP_SSELECT = 237,
    OP_SELECT = 238,
    OP_GETC = 239,
    OP_READ = 240,
    OP_ENTERWRITE = 241,
    OP_LEAVEWRITE = 242,
    OP_PRTF = 243,
    OP_PRINT = 244,
    OP_SAY = 245,
    OP_SYSOPEN = 246,
    OP_SYSSEEK = 247,
    OP_SYSREAD = 248,
    OP_SYSWRITE = 249,
    OP_EOF = 250,
    OP_TELL = 251,
    OP_SEEK = 252,
    OP_TRUNCATE = 253,
    OP_FCNTL = 254,
    OP_IOCTL = 255,
    OP_FLOCK = 256,
    OP_SEND = 257,
    OP_RECV = 258,
    OP_SOCKET = 259,
    OP_SOCKPAIR = 260,
    OP_BIND = 261,
    OP_CONNECT = 262,
    OP_LISTEN = 263,
    OP_ACCEPT = 264,
    OP_SHUTDOWN = 265,
    OP_GSOCKOPT = 266,
    OP_SSOCKOPT = 267,
    OP_GETSOCKNAME = 268,
    OP_GETPEERNAME = 269,
    OP_LSTAT = 270,
    OP_STAT = 271,
    OP_FTRREAD = 272,
    OP_FTRWRITE = 273,
    OP_FTREXEC = 274,
    OP_FTEREAD = 275,
    OP_FTEWRITE = 276,
    OP_FTEEXEC = 277,
    OP_FTIS = 278,
    OP_FTSIZE = 279,
    OP_FTMTIME = 280,
    OP_FTATIME = 281,
    OP_FTCTIME = 282,
    OP_FTROWNED = 283,
    OP_FTEOWNED = 284,
    OP_FTZERO = 285,
    OP_FTSOCK = 286,
    OP_FTCHR = 287,
    OP_FTBLK = 288,
    OP_FTFILE = 289,
    OP_FTDIR = 290,
    OP_FTPIPE = 291,
    OP_FTSUID = 292,
    OP_FTSGID = 293,
    OP_FTSVTX = 294,
    OP_FTLINK = 295,
    OP_FTTTY = 296,
    OP_FTTEXT = 297,
    OP_FTBINARY = 298,
    OP_CHDIR = 299,
    OP_CHOWN = 300,
    OP_CHROOT = 301,
    OP_UNLINK = 302,
    OP_CHMOD = 303,
    OP_UTIME = 304,
    OP_RENAME = 305,
    OP_LINK = 306,
    OP_SYMLINK = 307,
    OP_READLINK = 308,
    OP_MKDIR = 309,
    OP_RMDIR = 310,
    OP_OPEN_DIR = 311,
    OP_READDIR = 312,
    OP_TELLDIR = 313,
    OP_SEEKDIR = 314,
    OP_REWINDDIR = 315,
    OP_CLOSEDIR = 316,
    OP_FORK = 317,
    OP_WAIT = 318,
    OP_WAITPID = 319,
    OP_SYSTEM = 320,
    OP_EXEC = 321,
    OP_KILL = 322,
    OP_GETPPID = 323,
    OP_GETPGRP = 324,
    OP_SETPGRP = 325,
    OP_GETPRIORITY = 326,
    OP_SETPRIORITY = 327,
    OP_TIME = 328,
    OP_TMS = 329,
    OP_LOCALTIME = 330,
    OP_GMTIME = 331,
    OP_ALARM = 332,
    OP_SLEEP = 333,
    OP_SHMGET = 334,
    OP_SHMCTL = 335,
    OP_SHMREAD = 336,
    OP_SHMWRITE = 337,
    OP_MSGGET = 338,
    OP_MSGCTL = 339,
    OP_MSGSND = 340,
    OP_MSGRCV = 341,
    OP_SEMOP = 342,
    OP_SEMGET = 343,
    OP_SEMCTL = 344,
    OP_REQUIRE = 345,
    OP_DOFILE = 346,
    OP_HINTSEVAL = 347,
    OP_ENTEREVAL = 348,
    OP_LEAVEEVAL = 349,
    OP_ENTERTRY = 350,
    OP_LEAVETRY = 351,
    OP_GHBYNAME = 352,
    OP_GHBYADDR = 353,
    OP_GHOSTENT = 354,
    OP_GNBYNAME = 355,
    OP_GNBYADDR = 356,
    OP_GNETENT = 357,
    OP_GPBYNAME = 358,
    OP_GPBYNUMBER = 359,
    OP_GPROTOENT = 360,
    OP_GSBYNAME = 361,
    OP_GSBYPORT = 362,
    OP_GSERVENT = 363,
    OP_SHOSTENT = 364,
    OP_SNETENT = 365,
    OP_SPROTOENT = 366,
    OP_SSERVENT = 367,
    OP_EHOSTENT = 368,
    OP_ENETENT = 369,
    OP_EPROTOENT = 370,
    OP_ESERVENT = 371,
    OP_GPWNAM = 372,
    OP_GPWUID = 373,
    OP_GPWENT = 374,
    OP_SPWENT = 375,
    OP_EPWENT = 376,
    OP_GGRNAM = 377,
    OP_GGRGID = 378,
    OP_GGRENT = 379,
    OP_SGRENT = 380,
    OP_EGRENT = 381,
    OP_GETLOGIN = 382,
    OP_SYSCALL = 383,
    OP_LOCK = 384,
    OP_ONCE = 385,
    OP_CUSTOM = 386,
    OP_COREARGS = 387,
    OP_AVHVSWITCH = 388,
    OP_RUNCV = 389,
    OP_FC = 390,
    OP_PADCV = 391,
    OP_INTROCV = 392,
    OP_CLONECV = 393,
    OP_PADRANGE = 394,
    OP_REFASSIGN = 395,
    OP_LVREF = 396,
    OP_LVREFSLICE = 397,
    OP_LVAVREF = 398,
    OP_ANONCONST = 399,
    OP_ISA = 400,
    OP_CMPCHAIN_AND = 401,
    OP_CMPCHAIN_DUP = 402,
    OP_ENTERTRYCATCH = 403,
    OP_LEAVETRYCATCH = 404,
    OP_POPTRY = 405,
    OP_CATCH = 406,
    OP_PUSHDEFER = 407,
    OP_IS_BOOL = 408,
    OP_IS_WEAK = 409,
    OP_WEAKEN = 410,
    OP_UNWEAKEN = 411,
    OP_BLESSED = 412,
    OP_REFADDR = 413,
    OP_REFTYPE = 414,
    OP_CEIL = 415,
    OP_FLOOR = 416,
    OP_IS_TAINTED = 417,
    OP_HELEMEXISTSOR = 418,
    OP_METHSTART = 419,
    OP_INITFIELD = 420,
    OP_CLASSNAME = 421,
    OP_max = 422,
}
pub type Optype = U16;
#[repr(C)]
#[derive(Copy, Clone)]
pub union UNOP_AUX_item {
    pub pad_offset: PADOFFSET,
    pub sv: *mut SV,
    pub iv: IV,
    pub uv: UV,
    pub pv: *mut ::std::os::raw::c_char,
    pub ssize: isize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of UNOP_AUX_item"][::std::mem::size_of::<UNOP_AUX_item>() - 8usize];
    ["Alignment of UNOP_AUX_item"][::std::mem::align_of::<UNOP_AUX_item>() - 8usize];
    [
        "Offset of field: UNOP_AUX_item::pad_offset",
    ][::std::mem::offset_of!(UNOP_AUX_item, pad_offset) - 0usize];
    [
        "Offset of field: UNOP_AUX_item::sv",
    ][::std::mem::offset_of!(UNOP_AUX_item, sv) - 0usize];
    [
        "Offset of field: UNOP_AUX_item::iv",
    ][::std::mem::offset_of!(UNOP_AUX_item, iv) - 0usize];
    [
        "Offset of field: UNOP_AUX_item::uv",
    ][::std::mem::offset_of!(UNOP_AUX_item, uv) - 0usize];
    [
        "Offset of field: UNOP_AUX_item::pv",
    ][::std::mem::offset_of!(UNOP_AUX_item, pv) - 0usize];
    [
        "Offset of field: UNOP_AUX_item::ssize",
    ][::std::mem::offset_of!(UNOP_AUX_item, ssize) - 0usize];
};
impl ::std::fmt::Debug for UNOP_AUX_item {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "UNOP_AUX_item {{ union }}")
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct op {
    pub op_next: *mut OP,
    pub op_sibparent: *mut OP,
    pub op_ppaddr: ::std::option::Option<
        unsafe extern "C" fn(my_perl: *mut PerlInterpreter) -> *mut OP,
    >,
    pub op_targ: PADOFFSET,
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub op_flags: U8,
    pub op_private: U8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of op"][::std::mem::size_of::<op>() - 40usize];
    ["Alignment of op"][::std::mem::align_of::<op>() - 8usize];
    ["Offset of field: op::op_next"][::std::mem::offset_of!(op, op_next) - 0usize];
    [
        "Offset of field: op::op_sibparent",
    ][::std::mem::offset_of!(op, op_sibparent) - 8usize];
    ["Offset of field: op::op_ppaddr"][::std::mem::offset_of!(op, op_ppaddr) - 16usize];
    ["Offset of field: op::op_targ"][::std::mem::offset_of!(op, op_targ) - 24usize];
    ["Offset of field: op::op_flags"][::std::mem::offset_of!(op, op_flags) - 34usize];
    [
        "Offset of field: op::op_private",
    ][::std::mem::offset_of!(op, op_private) - 35usize];
};
impl op {
    #[inline]
    pub fn op_type(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 9u8) as u16) }
    }
    #[inline]
    pub fn set_op_type(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_type_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 0usize, 9u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_type_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                9u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_opt(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_opt(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_opt_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 9usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_opt_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                9usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_slabbed(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_slabbed(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_slabbed_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 10usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_slabbed_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                10usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_savefree(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_savefree(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_savefree_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 11usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_savefree_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                11usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_static(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_static(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_static_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 12usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_static_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                12usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_folded(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_folded(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_folded_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 13usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_folded_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                13usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_moresib(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_moresib(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_moresib_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 14usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_moresib_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                14usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_spare(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_spare(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_spare_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 15usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_spare_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                15usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        op_type: U16,
        op_opt: U16,
        op_slabbed: U16,
        op_savefree: U16,
        op_static: U16,
        op_folded: U16,
        op_moresib: U16,
        op_spare: U16,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                9u8,
                {
                    let op_type: u16 = unsafe { ::std::mem::transmute(op_type) };
                    op_type as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                9usize,
                1u8,
                {
                    let op_opt: u16 = unsafe { ::std::mem::transmute(op_opt) };
                    op_opt as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                10usize,
                1u8,
                {
                    let op_slabbed: u16 = unsafe { ::std::mem::transmute(op_slabbed) };
                    op_slabbed as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                11usize,
                1u8,
                {
                    let op_savefree: u16 = unsafe { ::std::mem::transmute(op_savefree) };
                    op_savefree as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                12usize,
                1u8,
                {
                    let op_static: u16 = unsafe { ::std::mem::transmute(op_static) };
                    op_static as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                13usize,
                1u8,
                {
                    let op_folded: u16 = unsafe { ::std::mem::transmute(op_folded) };
                    op_folded as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                14usize,
                1u8,
                {
                    let op_moresib: u16 = unsafe { ::std::mem::transmute(op_moresib) };
                    op_moresib as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                15usize,
                1u8,
                {
                    let op_spare: u16 = unsafe { ::std::mem::transmute(op_spare) };
                    op_spare as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct unop {
    pub op_next: *mut OP,
    pub op_sibparent: *mut OP,
    pub op_ppaddr: ::std::option::Option<
        unsafe extern "C" fn(my_perl: *mut PerlInterpreter) -> *mut OP,
    >,
    pub op_targ: PADOFFSET,
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub op_flags: U8,
    pub op_private: U8,
    pub op_first: *mut OP,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of unop"][::std::mem::size_of::<unop>() - 48usize];
    ["Alignment of unop"][::std::mem::align_of::<unop>() - 8usize];
    ["Offset of field: unop::op_next"][::std::mem::offset_of!(unop, op_next) - 0usize];
    [
        "Offset of field: unop::op_sibparent",
    ][::std::mem::offset_of!(unop, op_sibparent) - 8usize];
    [
        "Offset of field: unop::op_ppaddr",
    ][::std::mem::offset_of!(unop, op_ppaddr) - 16usize];
    ["Offset of field: unop::op_targ"][::std::mem::offset_of!(unop, op_targ) - 24usize];
    [
        "Offset of field: unop::op_flags",
    ][::std::mem::offset_of!(unop, op_flags) - 34usize];
    [
        "Offset of field: unop::op_private",
    ][::std::mem::offset_of!(unop, op_private) - 35usize];
    [
        "Offset of field: unop::op_first",
    ][::std::mem::offset_of!(unop, op_first) - 40usize];
};
impl unop {
    #[inline]
    pub fn op_type(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 9u8) as u16) }
    }
    #[inline]
    pub fn set_op_type(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_type_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 0usize, 9u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_type_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                9u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_opt(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_opt(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_opt_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 9usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_opt_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                9usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_slabbed(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_slabbed(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_slabbed_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 10usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_slabbed_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                10usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_savefree(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_savefree(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_savefree_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 11usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_savefree_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                11usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_static(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_static(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_static_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 12usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_static_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                12usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_folded(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_folded(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_folded_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 13usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_folded_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                13usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_moresib(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_moresib(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_moresib_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 14usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_moresib_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                14usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_spare(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_spare(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_spare_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 15usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_spare_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                15usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        op_type: U16,
        op_opt: U16,
        op_slabbed: U16,
        op_savefree: U16,
        op_static: U16,
        op_folded: U16,
        op_moresib: U16,
        op_spare: U16,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                9u8,
                {
                    let op_type: u16 = unsafe { ::std::mem::transmute(op_type) };
                    op_type as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                9usize,
                1u8,
                {
                    let op_opt: u16 = unsafe { ::std::mem::transmute(op_opt) };
                    op_opt as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                10usize,
                1u8,
                {
                    let op_slabbed: u16 = unsafe { ::std::mem::transmute(op_slabbed) };
                    op_slabbed as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                11usize,
                1u8,
                {
                    let op_savefree: u16 = unsafe { ::std::mem::transmute(op_savefree) };
                    op_savefree as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                12usize,
                1u8,
                {
                    let op_static: u16 = unsafe { ::std::mem::transmute(op_static) };
                    op_static as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                13usize,
                1u8,
                {
                    let op_folded: u16 = unsafe { ::std::mem::transmute(op_folded) };
                    op_folded as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                14usize,
                1u8,
                {
                    let op_moresib: u16 = unsafe { ::std::mem::transmute(op_moresib) };
                    op_moresib as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                15usize,
                1u8,
                {
                    let op_spare: u16 = unsafe { ::std::mem::transmute(op_spare) };
                    op_spare as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct unop_aux {
    pub op_next: *mut OP,
    pub op_sibparent: *mut OP,
    pub op_ppaddr: ::std::option::Option<
        unsafe extern "C" fn(my_perl: *mut PerlInterpreter) -> *mut OP,
    >,
    pub op_targ: PADOFFSET,
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub op_flags: U8,
    pub op_private: U8,
    pub op_first: *mut OP,
    pub op_aux: *mut UNOP_AUX_item,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of unop_aux"][::std::mem::size_of::<unop_aux>() - 56usize];
    ["Alignment of unop_aux"][::std::mem::align_of::<unop_aux>() - 8usize];
    [
        "Offset of field: unop_aux::op_next",
    ][::std::mem::offset_of!(unop_aux, op_next) - 0usize];
    [
        "Offset of field: unop_aux::op_sibparent",
    ][::std::mem::offset_of!(unop_aux, op_sibparent) - 8usize];
    [
        "Offset of field: unop_aux::op_ppaddr",
    ][::std::mem::offset_of!(unop_aux, op_ppaddr) - 16usize];
    [
        "Offset of field: unop_aux::op_targ",
    ][::std::mem::offset_of!(unop_aux, op_targ) - 24usize];
    [
        "Offset of field: unop_aux::op_flags",
    ][::std::mem::offset_of!(unop_aux, op_flags) - 34usize];
    [
        "Offset of field: unop_aux::op_private",
    ][::std::mem::offset_of!(unop_aux, op_private) - 35usize];
    [
        "Offset of field: unop_aux::op_first",
    ][::std::mem::offset_of!(unop_aux, op_first) - 40usize];
    [
        "Offset of field: unop_aux::op_aux",
    ][::std::mem::offset_of!(unop_aux, op_aux) - 48usize];
};
impl unop_aux {
    #[inline]
    pub fn op_type(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 9u8) as u16) }
    }
    #[inline]
    pub fn set_op_type(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_type_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 0usize, 9u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_type_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                9u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_opt(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_opt(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_opt_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 9usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_opt_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                9usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_slabbed(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_slabbed(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_slabbed_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 10usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_slabbed_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                10usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_savefree(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_savefree(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_savefree_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 11usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_savefree_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                11usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_static(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_static(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_static_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 12usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_static_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                12usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_folded(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_folded(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_folded_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 13usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_folded_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                13usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_moresib(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_moresib(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_moresib_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 14usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_moresib_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                14usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_spare(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_spare(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_spare_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 15usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_spare_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                15usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        op_type: U16,
        op_opt: U16,
        op_slabbed: U16,
        op_savefree: U16,
        op_static: U16,
        op_folded: U16,
        op_moresib: U16,
        op_spare: U16,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                9u8,
                {
                    let op_type: u16 = unsafe { ::std::mem::transmute(op_type) };
                    op_type as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                9usize,
                1u8,
                {
                    let op_opt: u16 = unsafe { ::std::mem::transmute(op_opt) };
                    op_opt as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                10usize,
                1u8,
                {
                    let op_slabbed: u16 = unsafe { ::std::mem::transmute(op_slabbed) };
                    op_slabbed as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                11usize,
                1u8,
                {
                    let op_savefree: u16 = unsafe { ::std::mem::transmute(op_savefree) };
                    op_savefree as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                12usize,
                1u8,
                {
                    let op_static: u16 = unsafe { ::std::mem::transmute(op_static) };
                    op_static as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                13usize,
                1u8,
                {
                    let op_folded: u16 = unsafe { ::std::mem::transmute(op_folded) };
                    op_folded as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                14usize,
                1u8,
                {
                    let op_moresib: u16 = unsafe { ::std::mem::transmute(op_moresib) };
                    op_moresib as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                15usize,
                1u8,
                {
                    let op_spare: u16 = unsafe { ::std::mem::transmute(op_spare) };
                    op_spare as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct binop {
    pub op_next: *mut OP,
    pub op_sibparent: *mut OP,
    pub op_ppaddr: ::std::option::Option<
        unsafe extern "C" fn(my_perl: *mut PerlInterpreter) -> *mut OP,
    >,
    pub op_targ: PADOFFSET,
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub op_flags: U8,
    pub op_private: U8,
    pub op_first: *mut OP,
    pub op_last: *mut OP,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of binop"][::std::mem::size_of::<binop>() - 56usize];
    ["Alignment of binop"][::std::mem::align_of::<binop>() - 8usize];
    ["Offset of field: binop::op_next"][::std::mem::offset_of!(binop, op_next) - 0usize];
    [
        "Offset of field: binop::op_sibparent",
    ][::std::mem::offset_of!(binop, op_sibparent) - 8usize];
    [
        "Offset of field: binop::op_ppaddr",
    ][::std::mem::offset_of!(binop, op_ppaddr) - 16usize];
    [
        "Offset of field: binop::op_targ",
    ][::std::mem::offset_of!(binop, op_targ) - 24usize];
    [
        "Offset of field: binop::op_flags",
    ][::std::mem::offset_of!(binop, op_flags) - 34usize];
    [
        "Offset of field: binop::op_private",
    ][::std::mem::offset_of!(binop, op_private) - 35usize];
    [
        "Offset of field: binop::op_first",
    ][::std::mem::offset_of!(binop, op_first) - 40usize];
    [
        "Offset of field: binop::op_last",
    ][::std::mem::offset_of!(binop, op_last) - 48usize];
};
impl binop {
    #[inline]
    pub fn op_type(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 9u8) as u16) }
    }
    #[inline]
    pub fn set_op_type(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_type_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 0usize, 9u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_type_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                9u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_opt(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_opt(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_opt_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 9usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_opt_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                9usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_slabbed(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_slabbed(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_slabbed_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 10usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_slabbed_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                10usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_savefree(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_savefree(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_savefree_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 11usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_savefree_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                11usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_static(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_static(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_static_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 12usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_static_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                12usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_folded(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_folded(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_folded_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 13usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_folded_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                13usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_moresib(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_moresib(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_moresib_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 14usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_moresib_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                14usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_spare(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_spare(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_spare_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 15usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_spare_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                15usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        op_type: U16,
        op_opt: U16,
        op_slabbed: U16,
        op_savefree: U16,
        op_static: U16,
        op_folded: U16,
        op_moresib: U16,
        op_spare: U16,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                9u8,
                {
                    let op_type: u16 = unsafe { ::std::mem::transmute(op_type) };
                    op_type as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                9usize,
                1u8,
                {
                    let op_opt: u16 = unsafe { ::std::mem::transmute(op_opt) };
                    op_opt as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                10usize,
                1u8,
                {
                    let op_slabbed: u16 = unsafe { ::std::mem::transmute(op_slabbed) };
                    op_slabbed as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                11usize,
                1u8,
                {
                    let op_savefree: u16 = unsafe { ::std::mem::transmute(op_savefree) };
                    op_savefree as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                12usize,
                1u8,
                {
                    let op_static: u16 = unsafe { ::std::mem::transmute(op_static) };
                    op_static as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                13usize,
                1u8,
                {
                    let op_folded: u16 = unsafe { ::std::mem::transmute(op_folded) };
                    op_folded as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                14usize,
                1u8,
                {
                    let op_moresib: u16 = unsafe { ::std::mem::transmute(op_moresib) };
                    op_moresib as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                15usize,
                1u8,
                {
                    let op_spare: u16 = unsafe { ::std::mem::transmute(op_spare) };
                    op_spare as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct logop {
    pub op_next: *mut OP,
    pub op_sibparent: *mut OP,
    pub op_ppaddr: ::std::option::Option<
        unsafe extern "C" fn(my_perl: *mut PerlInterpreter) -> *mut OP,
    >,
    pub op_targ: PADOFFSET,
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub op_flags: U8,
    pub op_private: U8,
    pub op_first: *mut OP,
    pub op_other: *mut OP,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of logop"][::std::mem::size_of::<logop>() - 56usize];
    ["Alignment of logop"][::std::mem::align_of::<logop>() - 8usize];
    ["Offset of field: logop::op_next"][::std::mem::offset_of!(logop, op_next) - 0usize];
    [
        "Offset of field: logop::op_sibparent",
    ][::std::mem::offset_of!(logop, op_sibparent) - 8usize];
    [
        "Offset of field: logop::op_ppaddr",
    ][::std::mem::offset_of!(logop, op_ppaddr) - 16usize];
    [
        "Offset of field: logop::op_targ",
    ][::std::mem::offset_of!(logop, op_targ) - 24usize];
    [
        "Offset of field: logop::op_flags",
    ][::std::mem::offset_of!(logop, op_flags) - 34usize];
    [
        "Offset of field: logop::op_private",
    ][::std::mem::offset_of!(logop, op_private) - 35usize];
    [
        "Offset of field: logop::op_first",
    ][::std::mem::offset_of!(logop, op_first) - 40usize];
    [
        "Offset of field: logop::op_other",
    ][::std::mem::offset_of!(logop, op_other) - 48usize];
};
impl logop {
    #[inline]
    pub fn op_type(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 9u8) as u16) }
    }
    #[inline]
    pub fn set_op_type(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_type_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 0usize, 9u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_type_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                9u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_opt(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_opt(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_opt_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 9usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_opt_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                9usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_slabbed(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_slabbed(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_slabbed_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 10usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_slabbed_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                10usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_savefree(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_savefree(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_savefree_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 11usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_savefree_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                11usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_static(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_static(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_static_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 12usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_static_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                12usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_folded(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_folded(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_folded_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 13usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_folded_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                13usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_moresib(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_moresib(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_moresib_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 14usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_moresib_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                14usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_spare(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_spare(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_spare_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 15usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_spare_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                15usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        op_type: U16,
        op_opt: U16,
        op_slabbed: U16,
        op_savefree: U16,
        op_static: U16,
        op_folded: U16,
        op_moresib: U16,
        op_spare: U16,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                9u8,
                {
                    let op_type: u16 = unsafe { ::std::mem::transmute(op_type) };
                    op_type as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                9usize,
                1u8,
                {
                    let op_opt: u16 = unsafe { ::std::mem::transmute(op_opt) };
                    op_opt as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                10usize,
                1u8,
                {
                    let op_slabbed: u16 = unsafe { ::std::mem::transmute(op_slabbed) };
                    op_slabbed as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                11usize,
                1u8,
                {
                    let op_savefree: u16 = unsafe { ::std::mem::transmute(op_savefree) };
                    op_savefree as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                12usize,
                1u8,
                {
                    let op_static: u16 = unsafe { ::std::mem::transmute(op_static) };
                    op_static as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                13usize,
                1u8,
                {
                    let op_folded: u16 = unsafe { ::std::mem::transmute(op_folded) };
                    op_folded as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                14usize,
                1u8,
                {
                    let op_moresib: u16 = unsafe { ::std::mem::transmute(op_moresib) };
                    op_moresib as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                15usize,
                1u8,
                {
                    let op_spare: u16 = unsafe { ::std::mem::transmute(op_spare) };
                    op_spare as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct listop {
    pub op_next: *mut OP,
    pub op_sibparent: *mut OP,
    pub op_ppaddr: ::std::option::Option<
        unsafe extern "C" fn(my_perl: *mut PerlInterpreter) -> *mut OP,
    >,
    pub op_targ: PADOFFSET,
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub op_flags: U8,
    pub op_private: U8,
    pub op_first: *mut OP,
    pub op_last: *mut OP,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of listop"][::std::mem::size_of::<listop>() - 56usize];
    ["Alignment of listop"][::std::mem::align_of::<listop>() - 8usize];
    [
        "Offset of field: listop::op_next",
    ][::std::mem::offset_of!(listop, op_next) - 0usize];
    [
        "Offset of field: listop::op_sibparent",
    ][::std::mem::offset_of!(listop, op_sibparent) - 8usize];
    [
        "Offset of field: listop::op_ppaddr",
    ][::std::mem::offset_of!(listop, op_ppaddr) - 16usize];
    [
        "Offset of field: listop::op_targ",
    ][::std::mem::offset_of!(listop, op_targ) - 24usize];
    [
        "Offset of field: listop::op_flags",
    ][::std::mem::offset_of!(listop, op_flags) - 34usize];
    [
        "Offset of field: listop::op_private",
    ][::std::mem::offset_of!(listop, op_private) - 35usize];
    [
        "Offset of field: listop::op_first",
    ][::std::mem::offset_of!(listop, op_first) - 40usize];
    [
        "Offset of field: listop::op_last",
    ][::std::mem::offset_of!(listop, op_last) - 48usize];
};
impl listop {
    #[inline]
    pub fn op_type(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 9u8) as u16) }
    }
    #[inline]
    pub fn set_op_type(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_type_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 0usize, 9u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_type_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                9u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_opt(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_opt(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_opt_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 9usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_opt_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                9usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_slabbed(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_slabbed(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_slabbed_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 10usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_slabbed_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                10usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_savefree(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_savefree(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_savefree_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 11usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_savefree_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                11usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_static(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_static(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_static_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 12usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_static_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                12usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_folded(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_folded(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_folded_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 13usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_folded_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                13usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_moresib(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_moresib(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_moresib_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 14usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_moresib_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                14usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn op_spare(&self) -> U16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_op_spare(&mut self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn op_spare_raw(this: *const Self) -> U16 {
        unsafe {
            ::std::mem::transmute(
                <__BindgenBitfieldUnit<
                    [u8; 2usize],
                >>::raw_get(::std::ptr::addr_of!((*this)._bitfield_1), 15usize, 1u8)
                    as u16,
            )
        }
    }
    #[inline]
    pub unsafe fn set_op_spare_raw(this: *mut Self, val: U16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<
                [u8; 2usize],
            >>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                15usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        op_type: U16,
        op_opt: U16,
        op_slabbed: U16,
        op_savefree: U16,
        op_static: U16,
        op_folded: U16,
        op_moresib: U16,
        op_spare: U16,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                9u8,
                {
                    let op_type: u16 = unsafe { ::std::mem::transmute(op_type) };
                    op_type as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                9usize,
                1u8,
                {
                    let op_opt: u16 = unsafe { ::std::mem::transmute(op_opt) };
                    op_opt as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                10usize,
                1u8,
                {
                    let op_slabbed: u16 = unsafe { ::std::mem::transmute(op_slabbed) };
                    op_slabbed as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                11usize,
                1u8,
                {
                    let op_savefree: u16 = unsafe { ::std::mem::transmute(op_savefree) };
                    op_savefree as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                12usize,
                1u8,
                {
                    let op_static: u16 = unsafe { ::std::mem::transmute(op_static) };
