/* automatically generated by rust-bindgen 0.69.5 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const PERL_UNICODE_ARGV: u8 = 65u8;
pub const PERL_UNICODE_LOCALE: u8 = 76u8;
pub const PERL_UNICODE_WIDESYSCALLS: u8 = 87u8;
pub const PERL_UNICODE_UTF8CACHEASSERT: u8 = 97u8;
pub const PERL_SIGNALS_UNSAFE_FLAG: u32 = 1;
pub const PERL_PV_ESCAPE_QUOTE: u32 = 1;
pub const PERL_PV_PRETTY_QUOTE: u32 = 1;
pub const PERL_PV_PRETTY_ELLIPSES: u32 = 2;
pub const PERL_PV_PRETTY_LTGT: u32 = 4;
pub const PERL_PV_PRETTY_EXACTSIZE: u32 = 8;
pub const PERL_PV_ESCAPE_UNI: u32 = 256;
pub const PERL_PV_ESCAPE_UNI_DETECT: u32 = 512;
pub const PERL_PV_ESCAPE_NONASCII: u32 = 1024;
pub const PERL_PV_ESCAPE_FIRSTCHAR: u32 = 2048;
pub const PERL_PV_ESCAPE_ALL: u32 = 4096;
pub const PERL_PV_ESCAPE_NOBACKSLASH: u32 = 8192;
pub const PERL_PV_ESCAPE_NOCLEAR: u32 = 16384;
pub const PERL_PV_PRETTY_NOCLEAR: u32 = 16384;
pub const PERL_PV_ESCAPE_RE: u32 = 32768;
pub const PERL_PV_ESCAPE_DWIM: u32 = 65536;
pub const PERL_PV_ESCAPE_DWIM_ALL_HEX: u32 = 131072;
pub const PERL_PV_ESCAPE_NON_WC: u32 = 262144;
pub const PERL_PV_ESCAPE_TRUNC_MIDDLE: u32 = 524288;
pub const PERL_PV_PRETTY_QUOTEDPREFIX: u32 = 787459;
pub const PERL_PV_PRETTY_DUMP: u32 = 3;
pub const PERL_PV_PRETTY_REGPROP: u32 = 33798;
pub const NV_NAN_BITS: u32 = 51;
pub const NV_NAN_QS_BYTE_OFFSET: u32 = 6;
pub const NV_NAN_QS_BIT_SHIFT: u32 = 3;
pub const NV_NAN_QS_BIT: u32 = 8;
pub const NV_NAN_QS_BIT_OFFSET: u32 = 51;
pub const PERL_MAX_NESTED_EVAL_BEGIN_BLOCKS_DEFAULT: u32 = 1000;
pub const PERL_VAR_MAX_NESTED_EVAL_BEGIN_BLOCKS: &[u8; 29] = b"\rAX_NESTED_EVAL_BEGIN_BLOCKS\0";
pub const PERL_STOP_PARSING_AFTER_N_ERRORS: u32 = 10;
pub const G_ARRAY: u32 = 3;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
pub type __clock_t = ::std::os::raw::c_long;
pub type __time_t = ::std::os::raw::c_long;
pub type __key_t = ::std::os::raw::c_int;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type gid_t = __gid_t;
pub type uid_t = __uid_t;
pub type off64_t = __off64_t;
pub type pid_t = __pid_t;
pub type time_t = __time_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    const UNINIT: ::std::mem::MaybeUninit<__sigset_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t)),
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(__sigset_t), "::", stringify!(__val)),
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    const UNINIT: ::std::mem::MaybeUninit<timespec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec)),
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(timespec), "::", stringify!(tv_sec)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_nsec) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(timespec), "::", stringify!(tv_nsec)),
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::std::os::raw::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___atomic_wide_counter__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<__atomic_wide_counter__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__atomic_wide_counter__bindgen_ty_1)),
    );
    assert_eq!(
        ::std::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__atomic_wide_counter__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__low) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter__bindgen_ty_1),
            "::",
            stringify!(__low),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__high) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter__bindgen_ty_1),
            "::",
            stringify!(__high),
        ),
    );
}
#[test]
fn bindgen_test_layout___atomic_wide_counter() {
    const UNINIT: ::std::mem::MaybeUninit<__atomic_wide_counter> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__atomic_wide_counter>(),
        8usize,
        concat!("Size of: ", stringify!(__atomic_wide_counter)),
    );
    assert_eq!(
        ::std::mem::align_of::<__atomic_wide_counter>(),
        8usize,
        concat!("Alignment of ", stringify!(__atomic_wide_counter)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__value64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter),
            "::",
            stringify!(__value64),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__value32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter),
            "::",
            stringify!(__value32),
        ),
    );
}
impl ::std::fmt::Debug for __atomic_wide_counter {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "__atomic_wide_counter {{ union }}")
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_internal_list> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list)),
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__prev) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next),
        ),
    );
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_mutex_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s)),
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__lock) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__lock),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__count),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__owner) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__owner),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__nusers) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__nusers),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__kind) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__kind),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__spins) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__spins),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__elision) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__elision),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__list) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__list),
        ),
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
    pub __unused_initialized_1: ::std::os::raw::c_uint,
    pub __unused_initialized_2: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_cond_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s)),
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wseq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wseq),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g1_start) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_start),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g_size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_size),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g1_orig_size) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_orig_size),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wrefs) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wrefs),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g_signals) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_signals),
        ),
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).__unused_initialized_1) as usize - ptr as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__unused_initialized_1),
        ),
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).__unused_initialized_2) as usize - ptr as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__unused_initialized_2),
        ),
    );
}
impl ::std::fmt::Debug for __pthread_cond_s {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "__pthread_cond_s {{ __wseq: {:?}, __g1_start: {:?}, __g_size: {:?}, __g1_orig_size: {:?}, __wrefs: {:?}, __g_signals: {:?}, __unused_initialized_1: {:?}, __unused_initialized_2: {:?} }}",
            self.__wseq,
            self.__g1_start,
            self.__g_size,
            self.__g1_orig_size,
            self.__wrefs,
            self.__g_signals,
            self.__unused_initialized_1,
            self.__unused_initialized_2,
        )
    }
}
pub type pthread_t = ::std::os::raw::c_ulong;
pub type pthread_key_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_mutex_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t)),
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align),
        ),
    );
}
impl ::std::fmt::Debug for pthread_mutex_t {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "pthread_mutex_t {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_cond_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t)),
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align),
        ),
    );
}
impl ::std::fmt::Debug for pthread_cond_t {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "pthread_cond_t {{ union }}")
    }
}
pub type wchar_t = ::std::os::raw::c_int;
pub type __gnuc_va_list = __builtin_va_list;
pub type va_list = __gnuc_va_list;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<__mbstate_t__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(__mbstate_t__bindgen_ty_1)),
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wch) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wch),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wchb) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wchb),
        ),
    );
}
impl ::std::fmt::Debug for __mbstate_t__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "__mbstate_t__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mbstate_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        8usize,
        concat!("Size of: ", stringify!(__mbstate_t)),
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__count) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(__mbstate_t), "::", stringify!(__count)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__value) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(__mbstate_t), "::", stringify!(__value)),
    );
}
impl ::std::fmt::Debug for __mbstate_t {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "__mbstate_t {{ __count: {:?}, __value: {:?} }}",
            self.__count,
            self.__value,
        )
    }
}
pub type mbstate_t = __mbstate_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    const UNINIT: ::std::mem::MaybeUninit<__locale_struct> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__locale_struct>(),
        232usize,
        concat!("Size of: ", stringify!(__locale_struct)),
    );
    assert_eq!(
        ::std::mem::align_of::<__locale_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(__locale_struct)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__locales) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__locales),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ctype_b) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_b),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ctype_tolower) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_tolower),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ctype_toupper) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_toupper),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__names) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__names),
        ),
    );
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type nl_item = ::std::os::raw::c_int;
pub const locale_category_index_LC_CTYPE_INDEX_: locale_category_index = 0;
pub const locale_category_index_LC_NUMERIC_INDEX_: locale_category_index = 1;
pub const locale_category_index_LC_COLLATE_INDEX_: locale_category_index = 2;
pub const locale_category_index_LC_TIME_INDEX_: locale_category_index = 3;
pub const locale_category_index_LC_MESSAGES_INDEX_: locale_category_index = 4;
pub const locale_category_index_LC_MONETARY_INDEX_: locale_category_index = 5;
pub const locale_category_index_LC_ADDRESS_INDEX_: locale_category_index = 6;
pub const locale_category_index_LC_IDENTIFICATION_INDEX_: locale_category_index = 7;
pub const locale_category_index_LC_MEASUREMENT_INDEX_: locale_category_index = 8;
pub const locale_category_index_LC_PAPER_INDEX_: locale_category_index = 9;
pub const locale_category_index_LC_TELEPHONE_INDEX_: locale_category_index = 10;
pub const locale_category_index_LC_NAME_INDEX_: locale_category_index = 11;
pub const locale_category_index_LC_ALL_INDEX_: locale_category_index = 12;
pub type locale_category_index = ::std::os::raw::c_uint;
pub const locale_utf8ness_t_LOCALE_NOT_UTF8: locale_utf8ness_t = 0;
pub const locale_utf8ness_t_LOCALE_IS_UTF8: locale_utf8ness_t = 1;
pub const locale_utf8ness_t_LOCALE_UTF8NESS_UNKNOWN: locale_utf8ness_t = 2;
pub type locale_utf8ness_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lconv_offset_t {
    pub name: *const ::std::os::raw::c_char,
    pub offset: usize,
}
#[test]
fn bindgen_test_layout_lconv_offset_t() {
    const UNINIT: ::std::mem::MaybeUninit<lconv_offset_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lconv_offset_t>(),
        16usize,
        concat!("Size of: ", stringify!(lconv_offset_t)),
    );
    assert_eq!(
        ::std::mem::align_of::<lconv_offset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lconv_offset_t)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(lconv_offset_t), "::", stringify!(name)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lconv_offset_t),
            "::",
            stringify!(offset),
        ),
    );
}
pub const calc_LC_ALL_format_INTERNAL_FORMAT: calc_LC_ALL_format = 0;
pub const calc_LC_ALL_format_EXTERNAL_FORMAT_FOR_SET: calc_LC_ALL_format = 1;
pub const calc_LC_ALL_format_EXTERNAL_FORMAT_FOR_QUERY: calc_LC_ALL_format = 2;
pub type calc_LC_ALL_format = ::std::os::raw::c_uint;
pub const calc_LC_ALL_return_WANT_VOID: calc_LC_ALL_return = 0;
pub const calc_LC_ALL_return_WANT_TEMP_PV: calc_LC_ALL_return = 1;
pub const calc_LC_ALL_return_WANT_PL_setlocale_buf: calc_LC_ALL_return = 2;
pub type calc_LC_ALL_return = ::std::os::raw::c_uint;
pub const parse_LC_ALL_STRING_action_no_override: parse_LC_ALL_STRING_action = 0;
pub const parse_LC_ALL_STRING_action_override_if_ignored: parse_LC_ALL_STRING_action = 1;
pub const parse_LC_ALL_STRING_action_check_that_overridden: parse_LC_ALL_STRING_action = 2;
pub type parse_LC_ALL_STRING_action = ::std::os::raw::c_uint;
pub const parse_LC_ALL_string_return_invalid: parse_LC_ALL_string_return = 0;
pub const parse_LC_ALL_string_return_no_array: parse_LC_ALL_string_return = 1;
pub const parse_LC_ALL_string_return_only_element_0: parse_LC_ALL_string_return = 2;
pub const parse_LC_ALL_string_return_full_array: parse_LC_ALL_string_return = 3;
pub type parse_LC_ALL_string_return = ::std::os::raw::c_uint;
pub type __jmp_buf = [::std::os::raw::c_long; 8usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __jmp_buf_tag {
    pub __jmpbuf: __jmp_buf,
    pub __mask_was_saved: ::std::os::raw::c_int,
    pub __saved_mask: __sigset_t,
}
#[test]
fn bindgen_test_layout___jmp_buf_tag() {
    const UNINIT: ::std::mem::MaybeUninit<__jmp_buf_tag> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__jmp_buf_tag>(),
        200usize,
        concat!("Size of: ", stringify!(__jmp_buf_tag)),
    );
    assert_eq!(
        ::std::mem::align_of::<__jmp_buf_tag>(),
        8usize,
        concat!("Alignment of ", stringify!(__jmp_buf_tag)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__jmpbuf) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__jmp_buf_tag),
            "::",
            stringify!(__jmpbuf),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__mask_was_saved) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(__jmp_buf_tag),
            "::",
            stringify!(__mask_was_saved),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__saved_mask) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(__jmp_buf_tag),
            "::",
            stringify!(__saved_mask),
        ),
    );
}
pub type sigjmp_buf = [__jmp_buf_tag; 1usize];
#[repr(C)]
#[derive(Copy, Clone)]
pub union sigval {
    pub sival_int: ::std::os::raw::c_int,
    pub sival_ptr: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_sigval() {
    const UNINIT: ::std::mem::MaybeUninit<sigval> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sigval>(),
        8usize,
        concat!("Size of: ", stringify!(sigval)),
    );
    assert_eq!(
        ::std::mem::align_of::<sigval>(),
        8usize,
        concat!("Alignment of ", stringify!(sigval)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sival_int) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(sigval), "::", stringify!(sival_int)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sival_ptr) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(sigval), "::", stringify!(sival_ptr)),
    );
}
impl ::std::fmt::Debug for sigval {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "sigval {{ union }}")
    }
}
pub type __sigval_t = sigval;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct siginfo_t {
    pub si_signo: ::std::os::raw::c_int,
    pub si_errno: ::std::os::raw::c_int,
    pub si_code: ::std::os::raw::c_int,
    pub __pad0: ::std::os::raw::c_int,
    pub _sifields: siginfo_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union siginfo_t__bindgen_ty_1 {
    pub _pad: [::std::os::raw::c_int; 28usize],
    pub _kill: siginfo_t__bindgen_ty_1__bindgen_ty_1,
    pub _timer: siginfo_t__bindgen_ty_1__bindgen_ty_2,
    pub _rt: siginfo_t__bindgen_ty_1__bindgen_ty_3,
    pub _sigchld: siginfo_t__bindgen_ty_1__bindgen_ty_4,
    pub _sigfault: siginfo_t__bindgen_ty_1__bindgen_ty_5,
    pub _sigpoll: siginfo_t__bindgen_ty_1__bindgen_ty_6,
    pub _sigsys: siginfo_t__bindgen_ty_1__bindgen_ty_7,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_1 {
    pub si_pid: __pid_t,
    pub si_uid: __uid_t,
}
#[test]
fn bindgen_test_layout_siginfo_t__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<siginfo_t__bindgen_ty_1__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_1)),
    );
    assert_eq!(
        ::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).si_pid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(si_pid),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).si_uid) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(si_uid),
        ),
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_2 {
    pub si_tid: ::std::os::raw::c_int,
    pub si_overrun: ::std::os::raw::c_int,
    pub si_sigval: __sigval_t,
}
#[test]
fn bindgen_test_layout_siginfo_t__bindgen_ty_1__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<siginfo_t__bindgen_ty_1__bindgen_ty_2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_2>(),
        16usize,
        concat!("Size of: ", stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_2)),
    );
    assert_eq!(
        ::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_2)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).si_tid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(si_tid),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).si_overrun) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(si_overrun),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).si_sigval) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(si_sigval),
        ),
    );
}
impl ::std::fmt::Debug for siginfo_t__bindgen_ty_1__bindgen_ty_2 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "siginfo_t__bindgen_ty_1__bindgen_ty_2 {{ si_tid: {:?}, si_overrun: {:?}, si_sigval: {:?} }}",
            self.si_tid,
            self.si_overrun,
            self.si_sigval,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_3 {
    pub si_pid: __pid_t,
    pub si_uid: __uid_t,
    pub si_sigval: __sigval_t,
}
#[test]
fn bindgen_test_layout_siginfo_t__bindgen_ty_1__bindgen_ty_3() {
    const UNINIT: ::std::mem::MaybeUninit<siginfo_t__bindgen_ty_1__bindgen_ty_3> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_3>(),
        16usize,
        concat!("Size of: ", stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_3)),
    );
    assert_eq!(
        ::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_3>(),
        8usize,
        concat!("Alignment of ", stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_3)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).si_pid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(si_pid),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).si_uid) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(si_uid),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).si_sigval) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(si_sigval),
        ),
    );
}
impl ::std::fmt::Debug for siginfo_t__bindgen_ty_1__bindgen_ty_3 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "siginfo_t__bindgen_ty_1__bindgen_ty_3 {{ si_pid: {:?}, si_uid: {:?}, si_sigval: {:?} }}",
            self.si_pid,
            self.si_uid,
            self.si_sigval,
        )
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_4 {
    pub si_pid: __pid_t,
    pub si_uid: __uid_t,
    pub si_status: ::std::os::raw::c_int,
    pub si_utime: __clock_t,
    pub si_stime: __clock_t,
}
#[test]
fn bindgen_test_layout_siginfo_t__bindgen_ty_1__bindgen_ty_4() {
    const UNINIT: ::std::mem::MaybeUninit<siginfo_t__bindgen_ty_1__bindgen_ty_4> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_4>(),
        32usize,
        concat!("Size of: ", stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_4)),
    );
    assert_eq!(
        ::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_4>(),
        8usize,
        concat!("Alignment of ", stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_4)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).si_pid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(si_pid),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).si_uid) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(si_uid),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).si_status) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(si_status),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).si_utime) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(si_utime),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).si_stime) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(si_stime),
        ),
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_5 {
    pub si_addr: *mut ::std::os::raw::c_void,
    pub si_addr_lsb: ::std::os::raw::c_short,
    pub _bounds: siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1 {
    pub _addr_bnd: siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1,
    pub _pkey: __uint32_t,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1 {
    pub _lower: *mut ::std::os::raw::c_void,
    pub _upper: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<
        siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1,
    > = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<
            siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1,
        >(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1),
        ),
    );
    assert_eq!(
        ::std::mem::align_of::<
            siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1,
        >(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._lower) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(
                siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1
            ),
            "::",
            stringify!(_lower),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._upper) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(
                siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1
            ),
            "::",
            stringify!(_upper),
        ),
    );
}
#[test]
fn bindgen_test_layout_siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<
        siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1,
    > = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1),
        ),
    );
    assert_eq!(
        ::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._addr_bnd) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1),
            "::",
            stringify!(_addr_bnd),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pkey) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1),
            "::",
            stringify!(_pkey),
        ),
    );
}
impl ::std::fmt::Debug for siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_siginfo_t__bindgen_ty_1__bindgen_ty_5() {
    const UNINIT: ::std::mem::MaybeUninit<siginfo_t__bindgen_ty_1__bindgen_ty_5> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_5>(),
        32usize,
        concat!("Size of: ", stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_5)),
    );
    assert_eq!(
        ::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_5>(),
        8usize,
        concat!("Alignment of ", stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_5)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).si_addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_5),
            "::",
            stringify!(si_addr),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).si_addr_lsb) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_5),
            "::",
            stringify!(si_addr_lsb),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._bounds) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_5),
            "::",
            stringify!(_bounds),
        ),
    );
}
impl ::std::fmt::Debug for siginfo_t__bindgen_ty_1__bindgen_ty_5 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "siginfo_t__bindgen_ty_1__bindgen_ty_5 {{ si_addr: {:?}, si_addr_lsb: {:?}, _bounds: {:?} }}",
            self.si_addr,
            self.si_addr_lsb,
            self._bounds,
        )
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_6 {
    pub si_band: ::std::os::raw::c_long,
    pub si_fd: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_siginfo_t__bindgen_ty_1__bindgen_ty_6() {
    const UNINIT: ::std::mem::MaybeUninit<siginfo_t__bindgen_ty_1__bindgen_ty_6> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_6>(),
        16usize,
        concat!("Size of: ", stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_6)),
    );
    assert_eq!(
        ::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_6>(),
        8usize,
        concat!("Alignment of ", stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_6)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).si_band) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_6),
            "::",
            stringify!(si_band),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).si_fd) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_6),
            "::",
            stringify!(si_fd),
        ),
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_7 {
    pub _call_addr: *mut ::std::os::raw::c_void,
    pub _syscall: ::std::os::raw::c_int,
    pub _arch: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_siginfo_t__bindgen_ty_1__bindgen_ty_7() {
    const UNINIT: ::std::mem::MaybeUninit<siginfo_t__bindgen_ty_1__bindgen_ty_7> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_7>(),
        16usize,
        concat!("Size of: ", stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_7)),
    );
    assert_eq!(
        ::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_7>(),
        8usize,
        concat!("Alignment of ", stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_7)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._call_addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_7),
            "::",
            stringify!(_call_addr),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._syscall) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_7),
            "::",
            stringify!(_syscall),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._arch) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(siginfo_t__bindgen_ty_1__bindgen_ty_7),
            "::",
            stringify!(_arch),
        ),
    );
}
#[test]
fn bindgen_test_layout_siginfo_t__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<siginfo_t__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<siginfo_t__bindgen_ty_1>(),
        112usize,
        concat!("Size of: ", stringify!(siginfo_t__bindgen_ty_1)),
    );
    assert_eq!(
        ::std::mem::align_of::<siginfo_t__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(siginfo_t__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pad) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(siginfo_t__bindgen_ty_1),
            "::",
            stringify!(_pad),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._kill) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(siginfo_t__bindgen_ty_1),
            "::",
            stringify!(_kill),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._timer) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(siginfo_t__bindgen_ty_1),
            "::",
            stringify!(_timer),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._rt) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(siginfo_t__bindgen_ty_1),
            "::",
            stringify!(_rt),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._sigchld) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(siginfo_t__bindgen_ty_1),
            "::",
            stringify!(_sigchld),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._sigfault) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(siginfo_t__bindgen_ty_1),
            "::",
            stringify!(_sigfault),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._sigpoll) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(siginfo_t__bindgen_ty_1),
            "::",
            stringify!(_sigpoll),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._sigsys) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(siginfo_t__bindgen_ty_1),
            "::",
            stringify!(_sigsys),
        ),
    );
}
impl ::std::fmt::Debug for siginfo_t__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "siginfo_t__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_siginfo_t() {
    const UNINIT: ::std::mem::MaybeUninit<siginfo_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<siginfo_t>(),
        128usize,
        concat!("Size of: ", stringify!(siginfo_t)),
    );
    assert_eq!(
        ::std::mem::align_of::<siginfo_t>(),
        8usize,
        concat!("Alignment of ", stringify!(siginfo_t)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).si_signo) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(siginfo_t), "::", stringify!(si_signo)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).si_errno) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(siginfo_t), "::", stringify!(si_errno)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).si_code) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(siginfo_t), "::", stringify!(si_code)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad0) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(siginfo_t), "::", stringify!(__pad0)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._sifields) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(siginfo_t), "::", stringify!(_sifields)),
    );
}
impl ::std::fmt::Debug for siginfo_t {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "siginfo_t {{ si_signo: {:?}, si_errno: {:?}, si_code: {:?}, __pad0: {:?}, _sifields: {:?} }}",
            self.si_signo,
            self.si_errno,
            self.si_code,
            self.__pad0,
            self._sifields,
        )
    }
}
pub type __sighandler_t = ::std::option::Option<
    unsafe extern "C" fn(arg1: ::std::os::raw::c_int),
>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sigaction {
    pub __sigaction_handler: sigaction__bindgen_ty_1,
    pub sa_mask: __sigset_t,
    pub sa_flags: ::std::os::raw::c_int,
    pub sa_restorer: ::std::option::Option<unsafe extern "C" fn()>,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union sigaction__bindgen_ty_1 {
    pub sa_handler: __sighandler_t,
    pub sa_sigaction: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: ::std::os::raw::c_int,
            arg2: *mut siginfo_t,
            arg3: *mut ::std::os::raw::c_void,
        ),
    >,
}
#[test]
fn bindgen_test_layout_sigaction__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<sigaction__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sigaction__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(sigaction__bindgen_ty_1)),
    );
    assert_eq!(
        ::std::mem::align_of::<sigaction__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(sigaction__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_handler) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sigaction__bindgen_ty_1),
            "::",
            stringify!(sa_handler),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_sigaction) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sigaction__bindgen_ty_1),
            "::",
            stringify!(sa_sigaction),
        ),
    );
}
impl ::std::fmt::Debug for sigaction__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "sigaction__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_sigaction() {
    const UNINIT: ::std::mem::MaybeUninit<sigaction> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sigaction>(),
        152usize,
        concat!("Size of: ", stringify!(sigaction)),
    );
    assert_eq!(
        ::std::mem::align_of::<sigaction>(),
        8usize,
        concat!("Alignment of ", stringify!(sigaction)),
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).__sigaction_handler) as usize - ptr as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sigaction),
            "::",
            stringify!(__sigaction_handler),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_mask) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(sigaction), "::", stringify!(sa_mask)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_flags) as usize - ptr as usize },
        136usize,
        concat!("Offset of field: ", stringify!(sigaction), "::", stringify!(sa_flags)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_restorer) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(sigaction),
            "::",
            stringify!(sa_restorer),
        ),
    );
}
impl ::std::fmt::Debug for sigaction {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "sigaction {{ __sigaction_handler: {:?}, sa_mask: {:?}, sa_flags: {:?}, sa_restorer: {:?} }}",
            self.__sigaction_handler,
            self.sa_mask,
            self.sa_flags,
            self.sa_restorer,
        )
    }
}
pub type PERL_INTMAX_T = intmax_t;
pub type PERL_UINTMAX_T = uintmax_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stat {
    pub st_dev: __dev_t,
    pub st_ino: __ino_t,
    pub st_nlink: __nlink_t,
    pub st_mode: __mode_t,
    pub st_uid: __uid_t,
    pub st_gid: __gid_t,
    pub __pad0: ::std::os::raw::c_int,
    pub st_rdev: __dev_t,
    pub st_size: __off_t,
    pub st_blksize: __blksize_t,
    pub st_blocks: __blkcnt_t,
    pub st_atim: timespec,
    pub st_mtim: timespec,
    pub st_ctim: timespec,
    pub __glibc_reserved: [__syscall_slong_t; 3usize],
}
#[test]
fn bindgen_test_layout_stat() {
    const UNINIT: ::std::mem::MaybeUninit<stat> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<stat>(),
        144usize,
        concat!("Size of: ", stringify!(stat)),
    );
    assert_eq!(
        ::std::mem::align_of::<stat>(),
        8usize,
        concat!("Alignment of ", stringify!(stat)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_dev) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(stat), "::", stringify!(st_dev)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_ino) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(stat), "::", stringify!(st_ino)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_nlink) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(stat), "::", stringify!(st_nlink)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_mode) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(stat), "::", stringify!(st_mode)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_uid) as usize - ptr as usize },
        28usize,
        concat!("Offset of field: ", stringify!(stat), "::", stringify!(st_uid)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_gid) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(stat), "::", stringify!(st_gid)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad0) as usize - ptr as usize },
        36usize,
        concat!("Offset of field: ", stringify!(stat), "::", stringify!(__pad0)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_rdev) as usize - ptr as usize },
        40usize,
        concat!("Offset of field: ", stringify!(stat), "::", stringify!(st_rdev)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_size) as usize - ptr as usize },
        48usize,
        concat!("Offset of field: ", stringify!(stat), "::", stringify!(st_size)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_blksize) as usize - ptr as usize },
        56usize,
        concat!("Offset of field: ", stringify!(stat), "::", stringify!(st_blksize)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_blocks) as usize - ptr as usize },
        64usize,
        concat!("Offset of field: ", stringify!(stat), "::", stringify!(st_blocks)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_atim) as usize - ptr as usize },
        72usize,
        concat!("Offset of field: ", stringify!(stat), "::", stringify!(st_atim)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_mtim) as usize - ptr as usize },
        88usize,
        concat!("Offset of field: ", stringify!(stat), "::", stringify!(st_mtim)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_ctim) as usize - ptr as usize },
        104usize,
        concat!("Offset of field: ", stringify!(stat), "::", stringify!(st_ctim)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__glibc_reserved) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(stat),
            "::",
            stringify!(__glibc_reserved),
        ),
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_long,
    pub tm_zone: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_tm() {
    const UNINIT: ::std::mem::MaybeUninit<tm> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<tm>(),
        56usize,
        concat!("Size of: ", stringify!(tm)),
    );
    assert_eq!(
        ::std::mem::align_of::<tm>(),
        8usize,
        concat!("Alignment of ", stringify!(tm)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_sec) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(tm), "::", stringify!(tm_sec)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_min) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(tm), "::", stringify!(tm_min)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_hour) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(tm), "::", stringify!(tm_hour)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_mday) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(tm), "::", stringify!(tm_mday)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_mon) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(tm), "::", stringify!(tm_mon)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_year) as usize - ptr as usize },
        20usize,
        concat!("Offset of field: ", stringify!(tm), "::", stringify!(tm_year)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_wday) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(tm), "::", stringify!(tm_wday)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_yday) as usize - ptr as usize },
        28usize,
        concat!("Offset of field: ", stringify!(tm), "::", stringify!(tm_yday)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_isdst) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(tm), "::", stringify!(tm_isdst)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_gmtoff) as usize - ptr as usize },
        40usize,
        concat!("Offset of field: ", stringify!(tm), "::", stringify!(tm_gmtoff)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_zone) as usize - ptr as usize },
        48usize,
        concat!("Offset of field: ", stringify!(tm), "::", stringify!(tm_zone)),
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct netent {
    pub n_name: *mut ::std::os::raw::c_char,
    pub n_aliases: *mut *mut ::std::os::raw::c_char,
    pub n_addrtype: ::std::os::raw::c_int,
    pub n_net: u32,
}
#[test]
fn bindgen_test_layout_netent() {
    const UNINIT: ::std::mem::MaybeUninit<netent> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<netent>(),
        24usize,
        concat!("Size of: ", stringify!(netent)),
    );
    assert_eq!(
        ::std::mem::align_of::<netent>(),
        8usize,
        concat!("Alignment of ", stringify!(netent)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).n_name) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(netent), "::", stringify!(n_name)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).n_aliases) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(netent), "::", stringify!(n_aliases)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).n_addrtype) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(netent), "::", stringify!(n_addrtype)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).n_net) as usize - ptr as usize },
        20usize,
        concat!("Offset of field: ", stringify!(netent), "::", stringify!(n_net)),
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hostent {
    pub h_name: *mut ::std::os::raw::c_char,
    pub h_aliases: *mut *mut ::std::os::raw::c_char,
    pub h_addrtype: ::std::os::raw::c_int,
    pub h_length: ::std::os::raw::c_int,
    pub h_addr_list: *mut *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_hostent() {
    const UNINIT: ::std::mem::MaybeUninit<hostent> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<hostent>(),
        32usize,
        concat!("Size of: ", stringify!(hostent)),
    );
    assert_eq!(
        ::std::mem::align_of::<hostent>(),
        8usize,
        concat!("Alignment of ", stringify!(hostent)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).h_name) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(hostent), "::", stringify!(h_name)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).h_aliases) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(hostent), "::", stringify!(h_aliases)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).h_addrtype) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(hostent), "::", stringify!(h_addrtype)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).h_length) as usize - ptr as usize },
        20usize,
        concat!("Offset of field: ", stringify!(hostent), "::", stringify!(h_length)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).h_addr_list) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(hostent), "::", stringify!(h_addr_list)),
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct servent {
    pub s_name: *mut ::std::os::raw::c_char,
    pub s_aliases: *mut *mut ::std::os::raw::c_char,
    pub s_port: ::std::os::raw::c_int,
    pub s_proto: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_servent() {
    const UNINIT: ::std::mem::MaybeUninit<servent> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<servent>(),
        32usize,
        concat!("Size of: ", stringify!(servent)),
    );
    assert_eq!(
        ::std::mem::align_of::<servent>(),
        8usize,
        concat!("Alignment of ", stringify!(servent)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s_name) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(servent), "::", stringify!(s_name)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s_aliases) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(servent), "::", stringify!(s_aliases)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s_port) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(servent), "::", stringify!(s_port)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s_proto) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(servent), "::", stringify!(s_proto)),
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct protoent {
    pub p_name: *mut ::std::os::raw::c_char,
    pub p_aliases: *mut *mut ::std::os::raw::c_char,
    pub p_proto: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_protoent() {
    const UNINIT: ::std::mem::MaybeUninit<protoent> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<protoent>(),
        24usize,
        concat!("Size of: ", stringify!(protoent)),
    );
    assert_eq!(
        ::std::mem::align_of::<protoent>(),
        8usize,
        concat!("Alignment of ", stringify!(protoent)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_name) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(protoent), "::", stringify!(p_name)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_aliases) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(protoent), "::", stringify!(p_aliases)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p_proto) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(protoent), "::", stringify!(p_proto)),
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __dirstream {
    _unused: [u8; 0],
}
pub type DIR = __dirstream;
pub type IV = ::std::os::raw::c_long;
pub type UV = ::std::os::raw::c_ulong;
pub type NV = f64;
pub type STRLEN = usize;
pub type OP = op;
pub type COP = cop;
pub type UNOP = unop;
pub type UNOP_AUX = unop_aux;
pub type BINOP = binop;
pub type LISTOP = listop;
pub type LOGOP = logop;
pub type PMOP = pmop;
pub type SVOP = svop;
pub type PADOP = padop;
pub type PVOP = pvop;
pub type LOOP = loop_;
pub type METHOP = methop;
pub type OPSLAB = opslab;
pub type OPSLOT = opslot;
pub type BHK = block_hooks;
pub type XOP = custom_op;
pub type PerlInterpreter = interpreter;
pub type SV = sv;
pub type AV = av;
pub type HV = hv;
pub type CV = cv;
pub type REGEXP = p5rx;
pub type GP = gp;
pub type GV = gv;
pub type IO = io;
pub type PERL_CONTEXT = context;
pub type BLOCK = block;
pub type INVLIST = invlist;
pub type MAGIC = magic;
pub type XPV = xpv;
pub type XPVIV = xpviv;
pub type XPVUV = xpvuv;
pub type XPVNV = xpvnv;
pub type XPVMG = xpvmg;
pub type XPVLV = xpvlv;
pub type XINVLIST = xpvinvlist;
pub type XPVAV = xpvav;
pub type XPVHV = xpvhv;
pub type XPVGV = xpvgv;
pub type XPVCV = xpvcv;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xpvbm {
    _unused: [u8; 0],
}
pub type XPVBM = xpvbm;
pub type XPVFM = xpvfm;
pub type XPVIO = xpvio;
pub type XPVOBJ = xobject;
pub type MGVTBL = mgvtbl;
pub type ANY = any;
pub type PTR_TBL_ENT_t = ptr_tbl_ent;
pub type PTR_TBL_t = ptr_tbl;
pub type CLONE_PARAMS = clone_params;
pub type PADLIST = padlist;
pub type PAD = AV;
pub type PADNAMELIST = padnamelist;
pub type PADNAME = padname;
pub type I8 = ::std::os::raw::c_schar;
pub type U8 = ::std::os::raw::c_uchar;
pub type I16 = ::std::os::raw::c_short;
pub type U16 = ::std::os::raw::c_ushort;
pub type I32 = ::std::os::raw::c_int;
pub type U32 = ::std::os::raw::c_uint;
pub type U64 = ::std::os::raw::c_ulong;
pub type PERL_INT_FAST8_T = int_fast8_t;
pub type PERL_UINT_FAST8_T = uint_fast8_t;
extern "C" {
    pub static PL_charclass: [U32; 256usize];
}
pub type line_t = U32;
pub type Siginfo_t = siginfo_t;
pub type perl_os_thread = pthread_t;
pub type perl_mutex = pthread_mutex_t;
pub type perl_cond = pthread_cond_t;
pub type perl_key = pthread_key_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct perl_RnW1_mutex_t {
    pub lock: perl_mutex,
    pub wakeup: perl_cond,
    pub readers_count: isize,
}
#[test]
fn bindgen_test_layout_perl_RnW1_mutex_t() {
    const UNINIT: ::std::mem::MaybeUninit<perl_RnW1_mutex_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<perl_RnW1_mutex_t>(),
        96usize,
        concat!("Size of: ", stringify!(perl_RnW1_mutex_t)),
    );
    assert_eq!(
        ::std::mem::align_of::<perl_RnW1_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(perl_RnW1_mutex_t)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lock) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(perl_RnW1_mutex_t),
            "::",
            stringify!(lock),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wakeup) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(perl_RnW1_mutex_t),
            "::",
            stringify!(wakeup),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).readers_count) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(perl_RnW1_mutex_t),
            "::",
            stringify!(readers_count),
        ),
    );
}
impl ::std::fmt::Debug for perl_RnW1_mutex_t {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "perl_RnW1_mutex_t {{ lock: {:?}, wakeup: {:?} }}",
            self.lock,
            self.wakeup,
        )
    }
}
extern "C" {
    pub fn perl_tsa_mutex_lock(mutex: *mut perl_mutex) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn perl_tsa_mutex_unlock(mutex: *mut perl_mutex) -> ::std::os::raw::c_int;
}
pub type Stack_off_t = I32;
#[repr(C)]
#[derive(Copy, Clone)]
pub union any {
    pub any_ptr: *mut ::std::os::raw::c_void,
    pub any_sv: *mut SV,
    pub any_svp: *mut *mut SV,
    pub any_gv: *mut GV,
    pub any_av: *mut AV,
    pub any_hv: *mut HV,
    pub any_op: *mut OP,
    pub any_pv: *mut ::std::os::raw::c_char,
    pub any_pvp: *mut *mut ::std::os::raw::c_char,
    pub any_i32: I32,
    pub any_u32: U32,
    pub any_iv: IV,
    pub any_uv: UV,
    pub any_long: ::std::os::raw::c_long,
    pub any_bool: bool,
    pub any_size: usize,
    pub any_ssize: isize,
    pub any_strlen: STRLEN,
    pub any_dptr: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void),
    >,
    pub any_dxptr: ::std::option::Option<
        unsafe extern "C" fn(
            my_perl: *mut PerlInterpreter,
            arg1: *mut ::std::os::raw::c_void,
        ),
    >,
}
#[test]
fn bindgen_test_layout_any() {
    const UNINIT: ::std::mem::MaybeUninit<any> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<any>(),
        8usize,
        concat!("Size of: ", stringify!(any)),
    );
    assert_eq!(
        ::std::mem::align_of::<any>(),
        8usize,
        concat!("Alignment of ", stringify!(any)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).any_ptr) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(any), "::", stringify!(any_ptr)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).any_sv) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(any), "::", stringify!(any_sv)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).any_svp) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(any), "::", stringify!(any_svp)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).any_gv) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(any), "::", stringify!(any_gv)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).any_av) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(any), "::", stringify!(any_av)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).any_hv) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(any), "::", stringify!(any_hv)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).any_op) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(any), "::", stringify!(any_op)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).any_pv) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(any), "::", stringify!(any_pv)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).any_pvp) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(any), "::", stringify!(any_pvp)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).any_i32) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(any), "::", stringify!(any_i32)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).any_u32) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(any), "::", stringify!(any_u32)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).any_iv) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(any), "::", stringify!(any_iv)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).any_uv) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(any), "::", stringify!(any_uv)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).any_long) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(any), "::", stringify!(any_long)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).any_bool) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(any), "::", stringify!(any_bool)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).any_size) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(any), "::", stringify!(any_size)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).any_ssize) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(any), "::", stringify!(any_ssize)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).any_strlen) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(any), "::", stringify!(any_strlen)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).any_dptr) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(any), "::", stringify!(any_dptr)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).any_dxptr) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(any), "::", stringify!(any_dxptr)),
    );
}
impl ::std::fmt::Debug for any {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "any {{ union }}")
    }
}
pub type filter_t = ::std::option::Option<
    unsafe extern "C" fn(
        my_perl: *mut PerlInterpreter,
        arg1: ::std::os::raw::c_int,
        arg2: *mut SV,
        arg3: ::std::os::raw::c_int,
    ) -> I32,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PerlIO {
    _unused: [u8; 0],
}
pub type PerlIOl = _PerlIO;
pub type PerlIO = *mut PerlIOl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PerlIO_list_s {
    _unused: [u8; 0],
}
pub type PerlIO_list_t = PerlIO_list_s;
pub type Sighandler1_t = ::std::option::Option<
    unsafe extern "C" fn(arg1: ::std::os::raw::c_int),
>;
pub type Sighandler3_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: ::std::os::raw::c_int,
        arg2: *mut Siginfo_t,
        arg3: *mut ::std::os::raw::c_void,
    ),
>;
pub type Sighandler_t = Sighandler1_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union YYSTYPE {
    pub ival: I32,
    pub pval: *mut ::std::os::raw::c_void,
    pub opval: *mut OP,
    pub gvval: *mut GV,
}
#[test]
fn bindgen_test_layout_YYSTYPE() {
    const UNINIT: ::std::mem::MaybeUninit<YYSTYPE> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<YYSTYPE>(),
        8usize,
        concat!("Size of: ", stringify!(YYSTYPE)),
    );
    assert_eq!(
        ::std::mem::align_of::<YYSTYPE>(),
        8usize,
        concat!("Alignment of ", stringify!(YYSTYPE)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ival) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(YYSTYPE), "::", stringify!(ival)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pval) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(YYSTYPE), "::", stringify!(pval)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).opval) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(YYSTYPE), "::", stringify!(opval)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gvval) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(YYSTYPE), "::", stringify!(gvval)),
    );
}
impl ::std::fmt::Debug for YYSTYPE {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "YYSTYPE {{ union }}")
    }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum svtype {
    SVt_NULL = 0,
    SVt_IV = 1,
    SVt_NV = 2,
    SVt_PV = 3,
    SVt_INVLIST = 4,
    SVt_PVIV = 5,
    SVt_PVNV = 6,
    SVt_PVMG = 7,
    SVt_REGEXP = 8,
    SVt_PVGV = 9,
    SVt_PVLV = 10,
    SVt_PVAV = 11,
    SVt_PVHV = 12,
    SVt_PVCV = 13,
    SVt_PVFM = 14,
    SVt_PVIO = 15,
    SVt_PVOBJ = 16,
    SVt_LAST = 17,
}
pub type HE = he;
pub type HEK = hek;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sv {
    pub sv_any: *mut ::std::os::raw::c_void,
    pub sv_refcnt: U32,
    pub sv_flags: U32,
    pub sv_u: sv__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union sv__bindgen_ty_1 {
    pub svu_pv: *mut ::std::os::raw::c_char,
    pub svu_iv: IV,
    pub svu_uv: UV,
    pub svu_nv: NV,
    pub svu_rv: *mut SV,
    pub svu_array: *mut *mut SV,
    pub svu_hash: *mut *mut HE,
    pub svu_gp: *mut GP,
    pub svu_fp: *mut PerlIO,
}
#[test]
fn bindgen_test_layout_sv__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<sv__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sv__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(sv__bindgen_ty_1)),
    );
    assert_eq!(
        ::std::mem::align_of::<sv__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(sv__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_pv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sv__bindgen_ty_1),
            "::",
            stringify!(svu_pv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_iv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sv__bindgen_ty_1),
            "::",
            stringify!(svu_iv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_uv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sv__bindgen_ty_1),
            "::",
            stringify!(svu_uv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_nv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sv__bindgen_ty_1),
            "::",
            stringify!(svu_nv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_rv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sv__bindgen_ty_1),
            "::",
            stringify!(svu_rv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_array) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sv__bindgen_ty_1),
            "::",
            stringify!(svu_array),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_hash) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sv__bindgen_ty_1),
            "::",
            stringify!(svu_hash),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_gp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sv__bindgen_ty_1),
            "::",
            stringify!(svu_gp),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_fp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sv__bindgen_ty_1),
            "::",
            stringify!(svu_fp),
        ),
    );
}
impl ::std::fmt::Debug for sv__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "sv__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_sv() {
    const UNINIT: ::std::mem::MaybeUninit<sv> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sv>(),
        24usize,
        concat!("Size of: ", stringify!(sv)),
    );
    assert_eq!(
        ::std::mem::align_of::<sv>(),
        8usize,
        concat!("Alignment of ", stringify!(sv)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_any) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(sv), "::", stringify!(sv_any)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_refcnt) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(sv), "::", stringify!(sv_refcnt)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_flags) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(sv), "::", stringify!(sv_flags)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_u) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(sv), "::", stringify!(sv_u)),
    );
}
impl ::std::fmt::Debug for sv {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "sv {{ sv_any: {:?}, sv_refcnt: {:?}, sv_flags: {:?}, sv_u: {:?} }}",
            self.sv_any,
            self.sv_refcnt,
            self.sv_flags,
            self.sv_u,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct gv {
    pub sv_any: *mut XPVGV,
    pub sv_refcnt: U32,
    pub sv_flags: U32,
    pub sv_u: gv__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union gv__bindgen_ty_1 {
    pub svu_pv: *mut ::std::os::raw::c_char,
    pub svu_iv: IV,
    pub svu_uv: UV,
    pub svu_nv: NV,
    pub svu_rv: *mut SV,
    pub svu_array: *mut *mut SV,
    pub svu_hash: *mut *mut HE,
    pub svu_gp: *mut GP,
    pub svu_fp: *mut PerlIO,
}
#[test]
fn bindgen_test_layout_gv__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<gv__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gv__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(gv__bindgen_ty_1)),
    );
    assert_eq!(
        ::std::mem::align_of::<gv__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(gv__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_pv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gv__bindgen_ty_1),
            "::",
            stringify!(svu_pv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_iv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gv__bindgen_ty_1),
            "::",
            stringify!(svu_iv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_uv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gv__bindgen_ty_1),
            "::",
            stringify!(svu_uv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_nv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gv__bindgen_ty_1),
            "::",
            stringify!(svu_nv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_rv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gv__bindgen_ty_1),
            "::",
            stringify!(svu_rv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_array) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gv__bindgen_ty_1),
            "::",
            stringify!(svu_array),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_hash) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gv__bindgen_ty_1),
            "::",
            stringify!(svu_hash),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_gp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gv__bindgen_ty_1),
            "::",
            stringify!(svu_gp),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_fp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gv__bindgen_ty_1),
            "::",
            stringify!(svu_fp),
        ),
    );
}
impl ::std::fmt::Debug for gv__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "gv__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_gv() {
    const UNINIT: ::std::mem::MaybeUninit<gv> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gv>(),
        24usize,
        concat!("Size of: ", stringify!(gv)),
    );
    assert_eq!(
        ::std::mem::align_of::<gv>(),
        8usize,
        concat!("Alignment of ", stringify!(gv)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_any) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(gv), "::", stringify!(sv_any)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_refcnt) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(gv), "::", stringify!(sv_refcnt)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_flags) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(gv), "::", stringify!(sv_flags)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_u) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(gv), "::", stringify!(sv_u)),
    );
}
impl ::std::fmt::Debug for gv {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "gv {{ sv_any: {:?}, sv_refcnt: {:?}, sv_flags: {:?}, sv_u: {:?} }}",
            self.sv_any,
            self.sv_refcnt,
            self.sv_flags,
            self.sv_u,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cv {
    pub sv_any: *mut XPVCV,
    pub sv_refcnt: U32,
    pub sv_flags: U32,
    pub sv_u: cv__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union cv__bindgen_ty_1 {
    pub svu_pv: *mut ::std::os::raw::c_char,
    pub svu_iv: IV,
    pub svu_uv: UV,
    pub svu_nv: NV,
    pub svu_rv: *mut SV,
    pub svu_array: *mut *mut SV,
    pub svu_hash: *mut *mut HE,
    pub svu_gp: *mut GP,
    pub svu_fp: *mut PerlIO,
}
#[test]
fn bindgen_test_layout_cv__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<cv__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cv__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(cv__bindgen_ty_1)),
    );
    assert_eq!(
        ::std::mem::align_of::<cv__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(cv__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_pv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cv__bindgen_ty_1),
            "::",
            stringify!(svu_pv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_iv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cv__bindgen_ty_1),
            "::",
            stringify!(svu_iv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_uv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cv__bindgen_ty_1),
            "::",
            stringify!(svu_uv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_nv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cv__bindgen_ty_1),
            "::",
            stringify!(svu_nv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_rv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cv__bindgen_ty_1),
            "::",
            stringify!(svu_rv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_array) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cv__bindgen_ty_1),
            "::",
            stringify!(svu_array),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_hash) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cv__bindgen_ty_1),
            "::",
            stringify!(svu_hash),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_gp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cv__bindgen_ty_1),
            "::",
            stringify!(svu_gp),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_fp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cv__bindgen_ty_1),
            "::",
            stringify!(svu_fp),
        ),
    );
}
impl ::std::fmt::Debug for cv__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "cv__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_cv() {
    const UNINIT: ::std::mem::MaybeUninit<cv> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cv>(),
        24usize,
        concat!("Size of: ", stringify!(cv)),
    );
    assert_eq!(
        ::std::mem::align_of::<cv>(),
        8usize,
        concat!("Alignment of ", stringify!(cv)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_any) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(cv), "::", stringify!(sv_any)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_refcnt) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(cv), "::", stringify!(sv_refcnt)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_flags) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(cv), "::", stringify!(sv_flags)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_u) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(cv), "::", stringify!(sv_u)),
    );
}
impl ::std::fmt::Debug for cv {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "cv {{ sv_any: {:?}, sv_refcnt: {:?}, sv_flags: {:?}, sv_u: {:?} }}",
            self.sv_any,
            self.sv_refcnt,
            self.sv_flags,
            self.sv_u,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct av {
    pub sv_any: *mut XPVAV,
    pub sv_refcnt: U32,
    pub sv_flags: U32,
    pub sv_u: av__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union av__bindgen_ty_1 {
    pub svu_pv: *mut ::std::os::raw::c_char,
    pub svu_iv: IV,
    pub svu_uv: UV,
    pub svu_nv: NV,
    pub svu_rv: *mut SV,
    pub svu_array: *mut *mut SV,
    pub svu_hash: *mut *mut HE,
    pub svu_gp: *mut GP,
    pub svu_fp: *mut PerlIO,
}
#[test]
fn bindgen_test_layout_av__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<av__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<av__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(av__bindgen_ty_1)),
    );
    assert_eq!(
        ::std::mem::align_of::<av__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(av__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_pv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(av__bindgen_ty_1),
            "::",
            stringify!(svu_pv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_iv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(av__bindgen_ty_1),
            "::",
            stringify!(svu_iv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_uv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(av__bindgen_ty_1),
            "::",
            stringify!(svu_uv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_nv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(av__bindgen_ty_1),
            "::",
            stringify!(svu_nv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_rv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(av__bindgen_ty_1),
            "::",
            stringify!(svu_rv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_array) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(av__bindgen_ty_1),
            "::",
            stringify!(svu_array),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_hash) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(av__bindgen_ty_1),
            "::",
            stringify!(svu_hash),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_gp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(av__bindgen_ty_1),
            "::",
            stringify!(svu_gp),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_fp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(av__bindgen_ty_1),
            "::",
            stringify!(svu_fp),
        ),
    );
}
impl ::std::fmt::Debug for av__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "av__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_av() {
    const UNINIT: ::std::mem::MaybeUninit<av> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<av>(),
        24usize,
        concat!("Size of: ", stringify!(av)),
    );
    assert_eq!(
        ::std::mem::align_of::<av>(),
        8usize,
        concat!("Alignment of ", stringify!(av)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_any) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(av), "::", stringify!(sv_any)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_refcnt) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(av), "::", stringify!(sv_refcnt)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_flags) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(av), "::", stringify!(sv_flags)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_u) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(av), "::", stringify!(sv_u)),
    );
}
impl ::std::fmt::Debug for av {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "av {{ sv_any: {:?}, sv_refcnt: {:?}, sv_flags: {:?}, sv_u: {:?} }}",
            self.sv_any,
            self.sv_refcnt,
            self.sv_flags,
            self.sv_u,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct hv {
    pub sv_any: *mut XPVHV,
    pub sv_refcnt: U32,
    pub sv_flags: U32,
    pub sv_u: hv__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union hv__bindgen_ty_1 {
    pub svu_pv: *mut ::std::os::raw::c_char,
    pub svu_iv: IV,
    pub svu_uv: UV,
    pub svu_nv: NV,
    pub svu_rv: *mut SV,
    pub svu_array: *mut *mut SV,
    pub svu_hash: *mut *mut HE,
    pub svu_gp: *mut GP,
    pub svu_fp: *mut PerlIO,
}
#[test]
fn bindgen_test_layout_hv__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<hv__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<hv__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(hv__bindgen_ty_1)),
    );
    assert_eq!(
        ::std::mem::align_of::<hv__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(hv__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_pv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hv__bindgen_ty_1),
            "::",
            stringify!(svu_pv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_iv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hv__bindgen_ty_1),
            "::",
            stringify!(svu_iv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_uv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hv__bindgen_ty_1),
            "::",
            stringify!(svu_uv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_nv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hv__bindgen_ty_1),
            "::",
            stringify!(svu_nv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_rv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hv__bindgen_ty_1),
            "::",
            stringify!(svu_rv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_array) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hv__bindgen_ty_1),
            "::",
            stringify!(svu_array),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_hash) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hv__bindgen_ty_1),
            "::",
            stringify!(svu_hash),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_gp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hv__bindgen_ty_1),
            "::",
            stringify!(svu_gp),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_fp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hv__bindgen_ty_1),
            "::",
            stringify!(svu_fp),
        ),
    );
}
impl ::std::fmt::Debug for hv__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "hv__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_hv() {
    const UNINIT: ::std::mem::MaybeUninit<hv> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<hv>(),
        24usize,
        concat!("Size of: ", stringify!(hv)),
    );
    assert_eq!(
        ::std::mem::align_of::<hv>(),
        8usize,
        concat!("Alignment of ", stringify!(hv)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_any) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(hv), "::", stringify!(sv_any)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_refcnt) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(hv), "::", stringify!(sv_refcnt)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_flags) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(hv), "::", stringify!(sv_flags)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_u) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(hv), "::", stringify!(sv_u)),
    );
}
impl ::std::fmt::Debug for hv {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "hv {{ sv_any: {:?}, sv_refcnt: {:?}, sv_flags: {:?}, sv_u: {:?} }}",
            self.sv_any,
            self.sv_refcnt,
            self.sv_flags,
            self.sv_u,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct io {
    pub sv_any: *mut XPVIO,
    pub sv_refcnt: U32,
    pub sv_flags: U32,
    pub sv_u: io__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union io__bindgen_ty_1 {
    pub svu_pv: *mut ::std::os::raw::c_char,
    pub svu_iv: IV,
    pub svu_uv: UV,
    pub svu_nv: NV,
    pub svu_rv: *mut SV,
    pub svu_array: *mut *mut SV,
    pub svu_hash: *mut *mut HE,
    pub svu_gp: *mut GP,
    pub svu_fp: *mut PerlIO,
}
#[test]
fn bindgen_test_layout_io__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<io__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<io__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(io__bindgen_ty_1)),
    );
    assert_eq!(
        ::std::mem::align_of::<io__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(io__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_pv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(io__bindgen_ty_1),
            "::",
            stringify!(svu_pv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_iv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(io__bindgen_ty_1),
            "::",
            stringify!(svu_iv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_uv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(io__bindgen_ty_1),
            "::",
            stringify!(svu_uv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_nv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(io__bindgen_ty_1),
            "::",
            stringify!(svu_nv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_rv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(io__bindgen_ty_1),
            "::",
            stringify!(svu_rv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_array) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(io__bindgen_ty_1),
            "::",
            stringify!(svu_array),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_hash) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(io__bindgen_ty_1),
            "::",
            stringify!(svu_hash),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_gp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(io__bindgen_ty_1),
            "::",
            stringify!(svu_gp),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_fp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(io__bindgen_ty_1),
            "::",
            stringify!(svu_fp),
        ),
    );
}
impl ::std::fmt::Debug for io__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "io__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_io() {
    const UNINIT: ::std::mem::MaybeUninit<io> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<io>(),
        24usize,
        concat!("Size of: ", stringify!(io)),
    );
    assert_eq!(
        ::std::mem::align_of::<io>(),
        8usize,
        concat!("Alignment of ", stringify!(io)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_any) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(io), "::", stringify!(sv_any)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_refcnt) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(io), "::", stringify!(sv_refcnt)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_flags) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(io), "::", stringify!(sv_flags)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_u) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(io), "::", stringify!(sv_u)),
    );
}
impl ::std::fmt::Debug for io {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "io {{ sv_any: {:?}, sv_refcnt: {:?}, sv_flags: {:?}, sv_u: {:?} }}",
            self.sv_any,
            self.sv_refcnt,
            self.sv_flags,
            self.sv_u,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct p5rx {
    pub sv_any: *mut regexp,
    pub sv_refcnt: U32,
    pub sv_flags: U32,
    pub sv_u: p5rx__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union p5rx__bindgen_ty_1 {
    pub svu_pv: *mut ::std::os::raw::c_char,
    pub svu_iv: IV,
    pub svu_uv: UV,
    pub svu_nv: NV,
    pub svu_rv: *mut SV,
    pub svu_array: *mut *mut SV,
    pub svu_hash: *mut *mut HE,
    pub svu_gp: *mut GP,
    pub svu_fp: *mut PerlIO,
}
#[test]
fn bindgen_test_layout_p5rx__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<p5rx__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<p5rx__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(p5rx__bindgen_ty_1)),
    );
    assert_eq!(
        ::std::mem::align_of::<p5rx__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(p5rx__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_pv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(p5rx__bindgen_ty_1),
            "::",
            stringify!(svu_pv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_iv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(p5rx__bindgen_ty_1),
            "::",
            stringify!(svu_iv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_uv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(p5rx__bindgen_ty_1),
            "::",
            stringify!(svu_uv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_nv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(p5rx__bindgen_ty_1),
            "::",
            stringify!(svu_nv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_rv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(p5rx__bindgen_ty_1),
            "::",
            stringify!(svu_rv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_array) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(p5rx__bindgen_ty_1),
            "::",
            stringify!(svu_array),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_hash) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(p5rx__bindgen_ty_1),
            "::",
            stringify!(svu_hash),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_gp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(p5rx__bindgen_ty_1),
            "::",
            stringify!(svu_gp),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_fp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(p5rx__bindgen_ty_1),
            "::",
            stringify!(svu_fp),
        ),
    );
}
impl ::std::fmt::Debug for p5rx__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "p5rx__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_p5rx() {
    const UNINIT: ::std::mem::MaybeUninit<p5rx> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<p5rx>(),
        24usize,
        concat!("Size of: ", stringify!(p5rx)),
    );
    assert_eq!(
        ::std::mem::align_of::<p5rx>(),
        8usize,
        concat!("Alignment of ", stringify!(p5rx)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_any) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(p5rx), "::", stringify!(sv_any)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_refcnt) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(p5rx), "::", stringify!(sv_refcnt)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_flags) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(p5rx), "::", stringify!(sv_flags)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_u) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(p5rx), "::", stringify!(sv_u)),
    );
}
impl ::std::fmt::Debug for p5rx {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "p5rx {{ sv_any: {:?}, sv_refcnt: {:?}, sv_flags: {:?}, sv_u: {:?} }}",
            self.sv_any,
            self.sv_refcnt,
            self.sv_flags,
            self.sv_u,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct invlist {
    pub sv_any: *mut XINVLIST,
    pub sv_refcnt: U32,
    pub sv_flags: U32,
    pub sv_u: invlist__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union invlist__bindgen_ty_1 {
    pub svu_pv: *mut ::std::os::raw::c_char,
    pub svu_iv: IV,
    pub svu_uv: UV,
    pub svu_nv: NV,
    pub svu_rv: *mut SV,
    pub svu_array: *mut *mut SV,
    pub svu_hash: *mut *mut HE,
    pub svu_gp: *mut GP,
    pub svu_fp: *mut PerlIO,
}
#[test]
fn bindgen_test_layout_invlist__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<invlist__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<invlist__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(invlist__bindgen_ty_1)),
    );
    assert_eq!(
        ::std::mem::align_of::<invlist__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(invlist__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_pv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(invlist__bindgen_ty_1),
            "::",
            stringify!(svu_pv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_iv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(invlist__bindgen_ty_1),
            "::",
            stringify!(svu_iv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_uv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(invlist__bindgen_ty_1),
            "::",
            stringify!(svu_uv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_nv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(invlist__bindgen_ty_1),
            "::",
            stringify!(svu_nv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_rv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(invlist__bindgen_ty_1),
            "::",
            stringify!(svu_rv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_array) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(invlist__bindgen_ty_1),
            "::",
            stringify!(svu_array),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_hash) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(invlist__bindgen_ty_1),
            "::",
            stringify!(svu_hash),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_gp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(invlist__bindgen_ty_1),
            "::",
            stringify!(svu_gp),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svu_fp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(invlist__bindgen_ty_1),
            "::",
            stringify!(svu_fp),
        ),
    );
}
impl ::std::fmt::Debug for invlist__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "invlist__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_invlist() {
    const UNINIT: ::std::mem::MaybeUninit<invlist> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<invlist>(),
        24usize,
        concat!("Size of: ", stringify!(invlist)),
    );
    assert_eq!(
        ::std::mem::align_of::<invlist>(),
        8usize,
        concat!("Alignment of ", stringify!(invlist)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_any) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(invlist), "::", stringify!(sv_any)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_refcnt) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(invlist), "::", stringify!(sv_refcnt)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_flags) as usize - ptr as usize },
        12usize,
        concat!("Offset of field: ", stringify!(invlist), "::", stringify!(sv_flags)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv_u) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(invlist), "::", stringify!(sv_u)),
    );
}
impl ::std::fmt::Debug for invlist {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "invlist {{ sv_any: {:?}, sv_refcnt: {:?}, sv_flags: {:?}, sv_u: {:?} }}",
            self.sv_any,
            self.sv_refcnt,
            self.sv_flags,
            self.sv_u,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _xnvu {
    pub xnv_nv: NV,
    pub xgv_stash: *mut HV,
    pub xnv_lines: line_t,
    pub xnv_bm_tail: bool,
}
#[test]
fn bindgen_test_layout__xnvu() {
    const UNINIT: ::std::mem::MaybeUninit<_xnvu> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_xnvu>(),
        8usize,
        concat!("Size of: ", stringify!(_xnvu)),
    );
    assert_eq!(
        ::std::mem::align_of::<_xnvu>(),
        8usize,
        concat!("Alignment of ", stringify!(_xnvu)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xnv_nv) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(_xnvu), "::", stringify!(xnv_nv)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xgv_stash) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(_xnvu), "::", stringify!(xgv_stash)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xnv_lines) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(_xnvu), "::", stringify!(xnv_lines)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xnv_bm_tail) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(_xnvu), "::", stringify!(xnv_bm_tail)),
    );
}
impl ::std::fmt::Debug for _xnvu {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "_xnvu {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _xivu {
    pub xivu_iv: IV,
    pub xivu_uv: UV,
    pub xivu_namehek: *mut HEK,
    pub xivu_eval_seen: bool,
}
#[test]
fn bindgen_test_layout__xivu() {
    const UNINIT: ::std::mem::MaybeUninit<_xivu> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_xivu>(),
        8usize,
        concat!("Size of: ", stringify!(_xivu)),
    );
    assert_eq!(
        ::std::mem::align_of::<_xivu>(),
        8usize,
        concat!("Alignment of ", stringify!(_xivu)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xivu_iv) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(_xivu), "::", stringify!(xivu_iv)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xivu_uv) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(_xivu), "::", stringify!(xivu_uv)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xivu_namehek) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(_xivu), "::", stringify!(xivu_namehek)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xivu_eval_seen) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(_xivu), "::", stringify!(xivu_eval_seen)),
    );
}
impl ::std::fmt::Debug for _xivu {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "_xivu {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _xmgu {
    pub xmg_magic: *mut MAGIC,
    pub xmg_hash_index: STRLEN,
}
#[test]
fn bindgen_test_layout__xmgu() {
    const UNINIT: ::std::mem::MaybeUninit<_xmgu> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_xmgu>(),
        8usize,
        concat!("Size of: ", stringify!(_xmgu)),
    );
    assert_eq!(
        ::std::mem::align_of::<_xmgu>(),
        8usize,
        concat!("Alignment of ", stringify!(_xmgu)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xmg_magic) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(_xmgu), "::", stringify!(xmg_magic)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xmg_hash_index) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(_xmgu), "::", stringify!(xmg_hash_index)),
    );
}
impl ::std::fmt::Debug for _xmgu {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "_xmgu {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct xpv {
    pub xmg_stash: *mut HV,
    pub xmg_u: _xmgu,
    pub xpv_cur: STRLEN,
    pub xpv_len_u: xpv__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpv__bindgen_ty_1 {
    pub xpvlenu_len: STRLEN,
    pub xpvlenu_rx: *mut regexp,
}
#[test]
fn bindgen_test_layout_xpv__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<xpv__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<xpv__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(xpv__bindgen_ty_1)),
    );
    assert_eq!(
        ::std::mem::align_of::<xpv__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(xpv__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpvlenu_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xpv__bindgen_ty_1),
            "::",
            stringify!(xpvlenu_len),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpvlenu_rx) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xpv__bindgen_ty_1),
            "::",
            stringify!(xpvlenu_rx),
        ),
    );
}
impl ::std::fmt::Debug for xpv__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpv__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_xpv() {
    const UNINIT: ::std::mem::MaybeUninit<xpv> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<xpv>(),
        32usize,
        concat!("Size of: ", stringify!(xpv)),
    );
    assert_eq!(
        ::std::mem::align_of::<xpv>(),
        8usize,
        concat!("Alignment of ", stringify!(xpv)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xmg_stash) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(xpv), "::", stringify!(xmg_stash)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xmg_u) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(xpv), "::", stringify!(xmg_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpv_cur) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(xpv), "::", stringify!(xpv_cur)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpv_len_u) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(xpv), "::", stringify!(xpv_len_u)),
    );
}
impl ::std::fmt::Debug for xpv {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "xpv {{ xmg_stash: {:?}, xmg_u: {:?}, xpv_len_u: {:?} }}",
            self.xmg_stash,
            self.xmg_u,
            self.xpv_len_u,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct xpviv {
    pub xmg_stash: *mut HV,
    pub xmg_u: _xmgu,
    pub xpv_cur: STRLEN,
    pub xpv_len_u: xpviv__bindgen_ty_1,
    pub xiv_u: _xivu,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpviv__bindgen_ty_1 {
    pub xpvlenu_len: STRLEN,
    pub xpvlenu_rx: *mut regexp,
}
#[test]
fn bindgen_test_layout_xpviv__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<xpviv__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<xpviv__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(xpviv__bindgen_ty_1)),
    );
    assert_eq!(
        ::std::mem::align_of::<xpviv__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(xpviv__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpvlenu_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xpviv__bindgen_ty_1),
            "::",
            stringify!(xpvlenu_len),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpvlenu_rx) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xpviv__bindgen_ty_1),
            "::",
            stringify!(xpvlenu_rx),
        ),
    );
}
impl ::std::fmt::Debug for xpviv__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpviv__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_xpviv() {
    const UNINIT: ::std::mem::MaybeUninit<xpviv> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<xpviv>(),
        40usize,
        concat!("Size of: ", stringify!(xpviv)),
    );
    assert_eq!(
        ::std::mem::align_of::<xpviv>(),
        8usize,
        concat!("Alignment of ", stringify!(xpviv)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xmg_stash) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(xpviv), "::", stringify!(xmg_stash)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xmg_u) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(xpviv), "::", stringify!(xmg_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpv_cur) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(xpviv), "::", stringify!(xpv_cur)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpv_len_u) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(xpviv), "::", stringify!(xpv_len_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xiv_u) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(xpviv), "::", stringify!(xiv_u)),
    );
}
impl ::std::fmt::Debug for xpviv {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "xpviv {{ xmg_stash: {:?}, xmg_u: {:?}, xpv_len_u: {:?}, xiv_u: {:?} }}",
            self.xmg_stash,
            self.xmg_u,
            self.xpv_len_u,
            self.xiv_u,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct xpvuv {
    pub xmg_stash: *mut HV,
    pub xmg_u: _xmgu,
    pub xpv_cur: STRLEN,
    pub xpv_len_u: xpvuv__bindgen_ty_1,
    pub xuv_u: _xivu,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpvuv__bindgen_ty_1 {
    pub xpvlenu_len: STRLEN,
    pub xpvlenu_rx: *mut regexp,
}
#[test]
fn bindgen_test_layout_xpvuv__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<xpvuv__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<xpvuv__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(xpvuv__bindgen_ty_1)),
    );
    assert_eq!(
        ::std::mem::align_of::<xpvuv__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(xpvuv__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpvlenu_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xpvuv__bindgen_ty_1),
            "::",
            stringify!(xpvlenu_len),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpvlenu_rx) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xpvuv__bindgen_ty_1),
            "::",
            stringify!(xpvlenu_rx),
        ),
    );
}
impl ::std::fmt::Debug for xpvuv__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpvuv__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_xpvuv() {
    const UNINIT: ::std::mem::MaybeUninit<xpvuv> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<xpvuv>(),
        40usize,
        concat!("Size of: ", stringify!(xpvuv)),
    );
    assert_eq!(
        ::std::mem::align_of::<xpvuv>(),
        8usize,
        concat!("Alignment of ", stringify!(xpvuv)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xmg_stash) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(xpvuv), "::", stringify!(xmg_stash)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xmg_u) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(xpvuv), "::", stringify!(xmg_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpv_cur) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(xpvuv), "::", stringify!(xpv_cur)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpv_len_u) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(xpvuv), "::", stringify!(xpv_len_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xuv_u) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(xpvuv), "::", stringify!(xuv_u)),
    );
}
impl ::std::fmt::Debug for xpvuv {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "xpvuv {{ xmg_stash: {:?}, xmg_u: {:?}, xpv_len_u: {:?}, xuv_u: {:?} }}",
            self.xmg_stash,
            self.xmg_u,
            self.xpv_len_u,
            self.xuv_u,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct xpvnv {
    pub xmg_stash: *mut HV,
    pub xmg_u: _xmgu,
    pub xpv_cur: STRLEN,
    pub xpv_len_u: xpvnv__bindgen_ty_1,
    pub xiv_u: _xivu,
    pub xnv_u: _xnvu,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpvnv__bindgen_ty_1 {
    pub xpvlenu_len: STRLEN,
    pub xpvlenu_rx: *mut regexp,
}
#[test]
fn bindgen_test_layout_xpvnv__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<xpvnv__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<xpvnv__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(xpvnv__bindgen_ty_1)),
    );
    assert_eq!(
        ::std::mem::align_of::<xpvnv__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(xpvnv__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpvlenu_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xpvnv__bindgen_ty_1),
            "::",
            stringify!(xpvlenu_len),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpvlenu_rx) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xpvnv__bindgen_ty_1),
            "::",
            stringify!(xpvlenu_rx),
        ),
    );
}
impl ::std::fmt::Debug for xpvnv__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpvnv__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_xpvnv() {
    const UNINIT: ::std::mem::MaybeUninit<xpvnv> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<xpvnv>(),
        48usize,
        concat!("Size of: ", stringify!(xpvnv)),
    );
    assert_eq!(
        ::std::mem::align_of::<xpvnv>(),
        8usize,
        concat!("Alignment of ", stringify!(xpvnv)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xmg_stash) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(xpvnv), "::", stringify!(xmg_stash)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xmg_u) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(xpvnv), "::", stringify!(xmg_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpv_cur) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(xpvnv), "::", stringify!(xpv_cur)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpv_len_u) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(xpvnv), "::", stringify!(xpv_len_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xiv_u) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(xpvnv), "::", stringify!(xiv_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xnv_u) as usize - ptr as usize },
        40usize,
        concat!("Offset of field: ", stringify!(xpvnv), "::", stringify!(xnv_u)),
    );
}
impl ::std::fmt::Debug for xpvnv {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "xpvnv {{ xmg_stash: {:?}, xmg_u: {:?}, xpv_len_u: {:?}, xiv_u: {:?}, xnv_u: {:?} }}",
            self.xmg_stash,
            self.xmg_u,
            self.xpv_len_u,
            self.xiv_u,
            self.xnv_u,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct xpvmg {
    pub xmg_stash: *mut HV,
    pub xmg_u: _xmgu,
    pub xpv_cur: STRLEN,
    pub xpv_len_u: xpvmg__bindgen_ty_1,
    pub xiv_u: _xivu,
    pub xnv_u: _xnvu,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpvmg__bindgen_ty_1 {
    pub xpvlenu_len: STRLEN,
    pub xpvlenu_rx: *mut regexp,
}
#[test]
fn bindgen_test_layout_xpvmg__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<xpvmg__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<xpvmg__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(xpvmg__bindgen_ty_1)),
    );
    assert_eq!(
        ::std::mem::align_of::<xpvmg__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(xpvmg__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpvlenu_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xpvmg__bindgen_ty_1),
            "::",
            stringify!(xpvlenu_len),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpvlenu_rx) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xpvmg__bindgen_ty_1),
            "::",
            stringify!(xpvlenu_rx),
        ),
    );
}
impl ::std::fmt::Debug for xpvmg__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpvmg__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_xpvmg() {
    const UNINIT: ::std::mem::MaybeUninit<xpvmg> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<xpvmg>(),
        48usize,
        concat!("Size of: ", stringify!(xpvmg)),
    );
    assert_eq!(
        ::std::mem::align_of::<xpvmg>(),
        8usize,
        concat!("Alignment of ", stringify!(xpvmg)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xmg_stash) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(xpvmg), "::", stringify!(xmg_stash)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xmg_u) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(xpvmg), "::", stringify!(xmg_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpv_cur) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(xpvmg), "::", stringify!(xpv_cur)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpv_len_u) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(xpvmg), "::", stringify!(xpv_len_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xiv_u) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(xpvmg), "::", stringify!(xiv_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xnv_u) as usize - ptr as usize },
        40usize,
        concat!("Offset of field: ", stringify!(xpvmg), "::", stringify!(xnv_u)),
    );
}
impl ::std::fmt::Debug for xpvmg {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "xpvmg {{ xmg_stash: {:?}, xmg_u: {:?}, xpv_len_u: {:?}, xiv_u: {:?}, xnv_u: {:?} }}",
            self.xmg_stash,
            self.xmg_u,
            self.xpv_len_u,
            self.xiv_u,
            self.xnv_u,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct xpvlv {
    pub xmg_stash: *mut HV,
    pub xmg_u: _xmgu,
    pub xpv_cur: STRLEN,
    pub xpv_len_u: xpvlv__bindgen_ty_1,
    pub xiv_u: _xivu,
    pub xnv_u: _xnvu,
    pub xlv_targoff_u: xpvlv__bindgen_ty_2,
    pub xlv_targlen: STRLEN,
    pub xlv_targ: *mut SV,
    pub xlv_type: ::std::os::raw::c_char,
    pub xlv_flags: ::std::os::raw::c_char,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpvlv__bindgen_ty_1 {
    pub xpvlenu_len: STRLEN,
    pub xpvlenu_rx: *mut regexp,
}
#[test]
fn bindgen_test_layout_xpvlv__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<xpvlv__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<xpvlv__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(xpvlv__bindgen_ty_1)),
    );
    assert_eq!(
        ::std::mem::align_of::<xpvlv__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(xpvlv__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpvlenu_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xpvlv__bindgen_ty_1),
            "::",
            stringify!(xpvlenu_len),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpvlenu_rx) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xpvlv__bindgen_ty_1),
            "::",
            stringify!(xpvlenu_rx),
        ),
    );
}
impl ::std::fmt::Debug for xpvlv__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpvlv__bindgen_ty_1 {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpvlv__bindgen_ty_2 {
    pub xlvu_targoff: STRLEN,
    pub xlvu_stargoff: isize,
}
#[test]
fn bindgen_test_layout_xpvlv__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<xpvlv__bindgen_ty_2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<xpvlv__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(xpvlv__bindgen_ty_2)),
    );
    assert_eq!(
        ::std::mem::align_of::<xpvlv__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(xpvlv__bindgen_ty_2)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xlvu_targoff) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xpvlv__bindgen_ty_2),
            "::",
            stringify!(xlvu_targoff),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xlvu_stargoff) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xpvlv__bindgen_ty_2),
            "::",
            stringify!(xlvu_stargoff),
        ),
    );
}
impl ::std::fmt::Debug for xpvlv__bindgen_ty_2 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpvlv__bindgen_ty_2 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_xpvlv() {
    const UNINIT: ::std::mem::MaybeUninit<xpvlv> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<xpvlv>(),
        80usize,
        concat!("Size of: ", stringify!(xpvlv)),
    );
    assert_eq!(
        ::std::mem::align_of::<xpvlv>(),
        8usize,
        concat!("Alignment of ", stringify!(xpvlv)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xmg_stash) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(xpvlv), "::", stringify!(xmg_stash)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xmg_u) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(xpvlv), "::", stringify!(xmg_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpv_cur) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(xpvlv), "::", stringify!(xpv_cur)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpv_len_u) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(xpvlv), "::", stringify!(xpv_len_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xiv_u) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(xpvlv), "::", stringify!(xiv_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xnv_u) as usize - ptr as usize },
        40usize,
        concat!("Offset of field: ", stringify!(xpvlv), "::", stringify!(xnv_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xlv_targoff_u) as usize - ptr as usize },
        48usize,
        concat!("Offset of field: ", stringify!(xpvlv), "::", stringify!(xlv_targoff_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xlv_targlen) as usize - ptr as usize },
        56usize,
        concat!("Offset of field: ", stringify!(xpvlv), "::", stringify!(xlv_targlen)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xlv_targ) as usize - ptr as usize },
        64usize,
        concat!("Offset of field: ", stringify!(xpvlv), "::", stringify!(xlv_targ)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xlv_type) as usize - ptr as usize },
        72usize,
        concat!("Offset of field: ", stringify!(xpvlv), "::", stringify!(xlv_type)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xlv_flags) as usize - ptr as usize },
        73usize,
        concat!("Offset of field: ", stringify!(xpvlv), "::", stringify!(xlv_flags)),
    );
}
impl ::std::fmt::Debug for xpvlv {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "xpvlv {{ xmg_stash: {:?}, xmg_u: {:?}, xpv_len_u: {:?}, xiv_u: {:?}, xnv_u: {:?}, xlv_targoff_u: {:?}, xlv_targ: {:?}, xlv_type: {:?}, xlv_flags: {:?} }}",
            self.xmg_stash,
            self.xmg_u,
            self.xpv_len_u,
            self.xiv_u,
            self.xnv_u,
            self.xlv_targoff_u,
            self.xlv_targ,
            self.xlv_type,
            self.xlv_flags,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct xpvinvlist {
    pub xmg_stash: *mut HV,
    pub xmg_u: _xmgu,
    pub xpv_cur: STRLEN,
    pub xpv_len_u: xpvinvlist__bindgen_ty_1,
    pub prev_index: IV,
    pub iterator: STRLEN,
    pub is_offset: bool,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpvinvlist__bindgen_ty_1 {
    pub xpvlenu_len: STRLEN,
    pub xpvlenu_rx: *mut regexp,
}
#[test]
fn bindgen_test_layout_xpvinvlist__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<xpvinvlist__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<xpvinvlist__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(xpvinvlist__bindgen_ty_1)),
    );
    assert_eq!(
        ::std::mem::align_of::<xpvinvlist__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(xpvinvlist__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpvlenu_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xpvinvlist__bindgen_ty_1),
            "::",
            stringify!(xpvlenu_len),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpvlenu_rx) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xpvinvlist__bindgen_ty_1),
            "::",
            stringify!(xpvlenu_rx),
        ),
    );
}
impl ::std::fmt::Debug for xpvinvlist__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpvinvlist__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_xpvinvlist() {
    const UNINIT: ::std::mem::MaybeUninit<xpvinvlist> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<xpvinvlist>(),
        56usize,
        concat!("Size of: ", stringify!(xpvinvlist)),
    );
    assert_eq!(
        ::std::mem::align_of::<xpvinvlist>(),
        8usize,
        concat!("Alignment of ", stringify!(xpvinvlist)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xmg_stash) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(xpvinvlist), "::", stringify!(xmg_stash)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xmg_u) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(xpvinvlist), "::", stringify!(xmg_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpv_cur) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(xpvinvlist), "::", stringify!(xpv_cur)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpv_len_u) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(xpvinvlist), "::", stringify!(xpv_len_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prev_index) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(xpvinvlist),
            "::",
            stringify!(prev_index),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iterator) as usize - ptr as usize },
        40usize,
        concat!("Offset of field: ", stringify!(xpvinvlist), "::", stringify!(iterator)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_offset) as usize - ptr as usize },
        48usize,
        concat!("Offset of field: ", stringify!(xpvinvlist), "::", stringify!(is_offset)),
    );
}
impl ::std::fmt::Debug for xpvinvlist {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "xpvinvlist {{ xmg_stash: {:?}, xmg_u: {:?}, xpv_len_u: {:?}, prev_index: {:?}, is_offset: {:?} }}",
            self.xmg_stash,
            self.xmg_u,
            self.xpv_len_u,
            self.prev_index,
            self.is_offset,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct xpvgv {
    pub xmg_stash: *mut HV,
    pub xmg_u: _xmgu,
    pub xpv_cur: STRLEN,
    pub xpv_len_u: xpvgv__bindgen_ty_1,
    pub xiv_u: _xivu,
    pub xnv_u: _xnvu,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpvgv__bindgen_ty_1 {
    pub xpvlenu_len: STRLEN,
    pub xpvlenu_rx: *mut regexp,
}
#[test]
fn bindgen_test_layout_xpvgv__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<xpvgv__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<xpvgv__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(xpvgv__bindgen_ty_1)),
    );
    assert_eq!(
        ::std::mem::align_of::<xpvgv__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(xpvgv__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpvlenu_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xpvgv__bindgen_ty_1),
            "::",
            stringify!(xpvlenu_len),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpvlenu_rx) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xpvgv__bindgen_ty_1),
            "::",
            stringify!(xpvlenu_rx),
        ),
    );
}
impl ::std::fmt::Debug for xpvgv__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpvgv__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_xpvgv() {
    const UNINIT: ::std::mem::MaybeUninit<xpvgv> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<xpvgv>(),
        48usize,
        concat!("Size of: ", stringify!(xpvgv)),
    );
    assert_eq!(
        ::std::mem::align_of::<xpvgv>(),
        8usize,
        concat!("Alignment of ", stringify!(xpvgv)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xmg_stash) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(xpvgv), "::", stringify!(xmg_stash)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xmg_u) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(xpvgv), "::", stringify!(xmg_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpv_cur) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(xpvgv), "::", stringify!(xpv_cur)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpv_len_u) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(xpvgv), "::", stringify!(xpv_len_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xiv_u) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(xpvgv), "::", stringify!(xiv_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xnv_u) as usize - ptr as usize },
        40usize,
        concat!("Offset of field: ", stringify!(xpvgv), "::", stringify!(xnv_u)),
    );
}
impl ::std::fmt::Debug for xpvgv {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "xpvgv {{ xmg_stash: {:?}, xmg_u: {:?}, xpv_len_u: {:?}, xiv_u: {:?}, xnv_u: {:?} }}",
            self.xmg_stash,
            self.xmg_u,
            self.xpv_len_u,
            self.xiv_u,
            self.xnv_u,
        )
    }
}
pub type cv_flags_t = U32;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct xpvfm {
    pub xmg_stash: *mut HV,
    pub xmg_u: _xmgu,
    pub xpv_cur: STRLEN,
    pub xpv_len_u: xpvfm__bindgen_ty_1,
    pub xcv_stash: *mut HV,
    pub xcv_start_u: xpvfm__bindgen_ty_2,
    pub xcv_root_u: xpvfm__bindgen_ty_3,
    pub xcv_gv_u: xpvfm__bindgen_ty_4,
    pub xcv_file: *mut ::std::os::raw::c_char,
    pub xcv_padlist_u: xpvfm__bindgen_ty_5,
    pub xcv_outside: *mut CV,
    pub xcv_outside_seq: U32,
    pub xcv_flags: cv_flags_t,
    pub xcv_depth: I32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpvfm__bindgen_ty_1 {
    pub xpvlenu_len: STRLEN,
    pub xpvlenu_rx: *mut regexp,
}
#[test]
fn bindgen_test_layout_xpvfm__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<xpvfm__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<xpvfm__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(xpvfm__bindgen_ty_1)),
    );
    assert_eq!(
        ::std::mem::align_of::<xpvfm__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(xpvfm__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpvlenu_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xpvfm__bindgen_ty_1),
            "::",
            stringify!(xpvlenu_len),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpvlenu_rx) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xpvfm__bindgen_ty_1),
            "::",
            stringify!(xpvlenu_rx),
        ),
    );
}
impl ::std::fmt::Debug for xpvfm__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpvfm__bindgen_ty_1 {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpvfm__bindgen_ty_2 {
    pub xcv_start: *mut OP,
    pub xcv_xsubany: ANY,
}
#[test]
fn bindgen_test_layout_xpvfm__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<xpvfm__bindgen_ty_2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<xpvfm__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(xpvfm__bindgen_ty_2)),
    );
    assert_eq!(
        ::std::mem::align_of::<xpvfm__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(xpvfm__bindgen_ty_2)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xcv_start) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xpvfm__bindgen_ty_2),
            "::",
            stringify!(xcv_start),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xcv_xsubany) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xpvfm__bindgen_ty_2),
            "::",
            stringify!(xcv_xsubany),
        ),
    );
}
impl ::std::fmt::Debug for xpvfm__bindgen_ty_2 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpvfm__bindgen_ty_2 {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpvfm__bindgen_ty_3 {
    pub xcv_root: *mut OP,
    pub xcv_xsub: ::std::option::Option<
        unsafe extern "C" fn(my_perl: *mut PerlInterpreter, arg1: *mut CV),
    >,
}
#[test]
fn bindgen_test_layout_xpvfm__bindgen_ty_3() {
    const UNINIT: ::std::mem::MaybeUninit<xpvfm__bindgen_ty_3> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<xpvfm__bindgen_ty_3>(),
        8usize,
        concat!("Size of: ", stringify!(xpvfm__bindgen_ty_3)),
    );
    assert_eq!(
        ::std::mem::align_of::<xpvfm__bindgen_ty_3>(),
        8usize,
        concat!("Alignment of ", stringify!(xpvfm__bindgen_ty_3)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xcv_root) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xpvfm__bindgen_ty_3),
            "::",
            stringify!(xcv_root),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xcv_xsub) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xpvfm__bindgen_ty_3),
            "::",
            stringify!(xcv_xsub),
        ),
    );
}
impl ::std::fmt::Debug for xpvfm__bindgen_ty_3 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpvfm__bindgen_ty_3 {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpvfm__bindgen_ty_4 {
    pub xcv_gv: *mut GV,
    pub xcv_hek: *mut HEK,
}
#[test]
fn bindgen_test_layout_xpvfm__bindgen_ty_4() {
    const UNINIT: ::std::mem::MaybeUninit<xpvfm__bindgen_ty_4> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<xpvfm__bindgen_ty_4>(),
        8usize,
        concat!("Size of: ", stringify!(xpvfm__bindgen_ty_4)),
    );
    assert_eq!(
        ::std::mem::align_of::<xpvfm__bindgen_ty_4>(),
        8usize,
        concat!("Alignment of ", stringify!(xpvfm__bindgen_ty_4)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xcv_gv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xpvfm__bindgen_ty_4),
            "::",
            stringify!(xcv_gv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xcv_hek) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xpvfm__bindgen_ty_4),
            "::",
            stringify!(xcv_hek),
        ),
    );
}
impl ::std::fmt::Debug for xpvfm__bindgen_ty_4 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpvfm__bindgen_ty_4 {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpvfm__bindgen_ty_5 {
    pub xcv_padlist: *mut PADLIST,
    pub xcv_hscxt: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_xpvfm__bindgen_ty_5() {
    const UNINIT: ::std::mem::MaybeUninit<xpvfm__bindgen_ty_5> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<xpvfm__bindgen_ty_5>(),
        8usize,
        concat!("Size of: ", stringify!(xpvfm__bindgen_ty_5)),
    );
    assert_eq!(
        ::std::mem::align_of::<xpvfm__bindgen_ty_5>(),
        8usize,
        concat!("Alignment of ", stringify!(xpvfm__bindgen_ty_5)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xcv_padlist) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xpvfm__bindgen_ty_5),
            "::",
            stringify!(xcv_padlist),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xcv_hscxt) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xpvfm__bindgen_ty_5),
            "::",
            stringify!(xcv_hscxt),
        ),
    );
}
impl ::std::fmt::Debug for xpvfm__bindgen_ty_5 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpvfm__bindgen_ty_5 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_xpvfm() {
    const UNINIT: ::std::mem::MaybeUninit<xpvfm> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<xpvfm>(),
        104usize,
        concat!("Size of: ", stringify!(xpvfm)),
    );
    assert_eq!(
        ::std::mem::align_of::<xpvfm>(),
        8usize,
        concat!("Alignment of ", stringify!(xpvfm)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xmg_stash) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(xpvfm), "::", stringify!(xmg_stash)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xmg_u) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(xpvfm), "::", stringify!(xmg_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpv_cur) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(xpvfm), "::", stringify!(xpv_cur)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpv_len_u) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(xpvfm), "::", stringify!(xpv_len_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xcv_stash) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(xpvfm), "::", stringify!(xcv_stash)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xcv_start_u) as usize - ptr as usize },
        40usize,
        concat!("Offset of field: ", stringify!(xpvfm), "::", stringify!(xcv_start_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xcv_root_u) as usize - ptr as usize },
        48usize,
        concat!("Offset of field: ", stringify!(xpvfm), "::", stringify!(xcv_root_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xcv_gv_u) as usize - ptr as usize },
        56usize,
        concat!("Offset of field: ", stringify!(xpvfm), "::", stringify!(xcv_gv_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xcv_file) as usize - ptr as usize },
        64usize,
        concat!("Offset of field: ", stringify!(xpvfm), "::", stringify!(xcv_file)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xcv_padlist_u) as usize - ptr as usize },
        72usize,
        concat!("Offset of field: ", stringify!(xpvfm), "::", stringify!(xcv_padlist_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xcv_outside) as usize - ptr as usize },
        80usize,
        concat!("Offset of field: ", stringify!(xpvfm), "::", stringify!(xcv_outside)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xcv_outside_seq) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(xpvfm),
            "::",
            stringify!(xcv_outside_seq),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xcv_flags) as usize - ptr as usize },
        92usize,
        concat!("Offset of field: ", stringify!(xpvfm), "::", stringify!(xcv_flags)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xcv_depth) as usize - ptr as usize },
        96usize,
        concat!("Offset of field: ", stringify!(xpvfm), "::", stringify!(xcv_depth)),
    );
}
impl ::std::fmt::Debug for xpvfm {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "xpvfm {{ xmg_stash: {:?}, xmg_u: {:?}, xpv_len_u: {:?}, xcv_stash: {:?}, xcv_start_u: {:?}, xcv_root_u: {:?}, xcv_gv_u: {:?}, xcv_file: {:?}, xcv_padlist_u: {:?}, xcv_outside: {:?}, xcv_outside_seq: {:?}, xcv_flags: {:?}, xcv_depth: {:?} }}",
            self.xmg_stash,
            self.xmg_u,
            self.xpv_len_u,
            self.xcv_stash,
            self.xcv_start_u,
            self.xcv_root_u,
            self.xcv_gv_u,
            self.xcv_file,
            self.xcv_padlist_u,
            self.xcv_outside,
            self.xcv_outside_seq,
            self.xcv_flags,
            self.xcv_depth,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct xpvio {
    pub xmg_stash: *mut HV,
    pub xmg_u: _xmgu,
    pub xpv_cur: STRLEN,
    pub xpv_len_u: xpvio__bindgen_ty_1,
    pub xiv_u: _xivu,
    pub xio_ofp: *mut PerlIO,
    pub xio_dirpu: xpvio__bindgen_ty_2,
    pub xio_page: IV,
    pub xio_page_len: IV,
    pub xio_lines_left: IV,
    pub xio_top_name: *mut ::std::os::raw::c_char,
    pub xio_top_gv: *mut GV,
    pub xio_fmt_name: *mut ::std::os::raw::c_char,
    pub xio_fmt_gv: *mut GV,
    pub xio_bottom_name: *mut ::std::os::raw::c_char,
    pub xio_bottom_gv: *mut GV,
    pub xio_type: ::std::os::raw::c_char,
    pub xio_flags: U8,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpvio__bindgen_ty_1 {
    pub xpvlenu_len: STRLEN,
    pub xpvlenu_rx: *mut regexp,
}
#[test]
fn bindgen_test_layout_xpvio__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<xpvio__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<xpvio__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(xpvio__bindgen_ty_1)),
    );
    assert_eq!(
        ::std::mem::align_of::<xpvio__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(xpvio__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpvlenu_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xpvio__bindgen_ty_1),
            "::",
            stringify!(xpvlenu_len),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpvlenu_rx) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xpvio__bindgen_ty_1),
            "::",
            stringify!(xpvlenu_rx),
        ),
    );
}
impl ::std::fmt::Debug for xpvio__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpvio__bindgen_ty_1 {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xpvio__bindgen_ty_2 {
    pub xiou_dirp: *mut DIR,
    pub xiou_any: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_xpvio__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<xpvio__bindgen_ty_2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<xpvio__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(xpvio__bindgen_ty_2)),
    );
    assert_eq!(
        ::std::mem::align_of::<xpvio__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(xpvio__bindgen_ty_2)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xiou_dirp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xpvio__bindgen_ty_2),
            "::",
            stringify!(xiou_dirp),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xiou_any) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xpvio__bindgen_ty_2),
            "::",
            stringify!(xiou_any),
        ),
    );
}
impl ::std::fmt::Debug for xpvio__bindgen_ty_2 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "xpvio__bindgen_ty_2 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_xpvio() {
    const UNINIT: ::std::mem::MaybeUninit<xpvio> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<xpvio>(),
        136usize,
        concat!("Size of: ", stringify!(xpvio)),
    );
    assert_eq!(
        ::std::mem::align_of::<xpvio>(),
        8usize,
        concat!("Alignment of ", stringify!(xpvio)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xmg_stash) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(xpvio), "::", stringify!(xmg_stash)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xmg_u) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(xpvio), "::", stringify!(xmg_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpv_cur) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(xpvio), "::", stringify!(xpv_cur)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpv_len_u) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(xpvio), "::", stringify!(xpv_len_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xiv_u) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(xpvio), "::", stringify!(xiv_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xio_ofp) as usize - ptr as usize },
        40usize,
        concat!("Offset of field: ", stringify!(xpvio), "::", stringify!(xio_ofp)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xio_dirpu) as usize - ptr as usize },
        48usize,
        concat!("Offset of field: ", stringify!(xpvio), "::", stringify!(xio_dirpu)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xio_page) as usize - ptr as usize },
        56usize,
        concat!("Offset of field: ", stringify!(xpvio), "::", stringify!(xio_page)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xio_page_len) as usize - ptr as usize },
        64usize,
        concat!("Offset of field: ", stringify!(xpvio), "::", stringify!(xio_page_len)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xio_lines_left) as usize - ptr as usize },
        72usize,
        concat!("Offset of field: ", stringify!(xpvio), "::", stringify!(xio_lines_left)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xio_top_name) as usize - ptr as usize },
        80usize,
        concat!("Offset of field: ", stringify!(xpvio), "::", stringify!(xio_top_name)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xio_top_gv) as usize - ptr as usize },
        88usize,
        concat!("Offset of field: ", stringify!(xpvio), "::", stringify!(xio_top_gv)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xio_fmt_name) as usize - ptr as usize },
        96usize,
        concat!("Offset of field: ", stringify!(xpvio), "::", stringify!(xio_fmt_name)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xio_fmt_gv) as usize - ptr as usize },
        104usize,
        concat!("Offset of field: ", stringify!(xpvio), "::", stringify!(xio_fmt_gv)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xio_bottom_name) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(xpvio),
            "::",
            stringify!(xio_bottom_name),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xio_bottom_gv) as usize - ptr as usize },
        120usize,
        concat!("Offset of field: ", stringify!(xpvio), "::", stringify!(xio_bottom_gv)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xio_type) as usize - ptr as usize },
        128usize,
        concat!("Offset of field: ", stringify!(xpvio), "::", stringify!(xio_type)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xio_flags) as usize - ptr as usize },
        129usize,
        concat!("Offset of field: ", stringify!(xpvio), "::", stringify!(xio_flags)),
    );
}
impl ::std::fmt::Debug for xpvio {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "xpvio {{ xmg_stash: {:?}, xmg_u: {:?}, xpv_len_u: {:?}, xiv_u: {:?}, xio_ofp: {:?}, xio_dirpu: {:?}, xio_page: {:?}, xio_page_len: {:?}, xio_lines_left: {:?}, xio_top_name: {:?}, xio_top_gv: {:?}, xio_fmt_name: {:?}, xio_fmt_gv: {:?}, xio_bottom_name: {:?}, xio_bottom_gv: {:?}, xio_type: {:?}, xio_flags: {:?} }}",
            self.xmg_stash,
            self.xmg_u,
            self.xpv_len_u,
            self.xiv_u,
            self.xio_ofp,
            self.xio_dirpu,
            self.xio_page,
            self.xio_page_len,
            self.xio_lines_left,
            self.xio_top_name,
            self.xio_top_gv,
            self.xio_fmt_name,
            self.xio_fmt_gv,
            self.xio_bottom_name,
            self.xio_bottom_gv,
            self.xio_type,
            self.xio_flags,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct xobject {
    pub xmg_stash: *mut HV,
    pub xmg_u: _xmgu,
    pub xobject_maxfield: isize,
    pub xobject_iter_sv_at: isize,
    pub xobject_fields: *mut *mut SV,
}
#[test]
fn bindgen_test_layout_xobject() {
    const UNINIT: ::std::mem::MaybeUninit<xobject> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<xobject>(),
        40usize,
        concat!("Size of: ", stringify!(xobject)),
    );
    assert_eq!(
        ::std::mem::align_of::<xobject>(),
        8usize,
        concat!("Alignment of ", stringify!(xobject)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xmg_stash) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(xobject), "::", stringify!(xmg_stash)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xmg_u) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(xobject), "::", stringify!(xmg_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xobject_maxfield) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(xobject),
            "::",
            stringify!(xobject_maxfield),
        ),
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).xobject_iter_sv_at) as usize - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(xobject),
            "::",
            stringify!(xobject_iter_sv_at),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xobject_fields) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(xobject),
            "::",
            stringify!(xobject_fields),
        ),
    );
}
impl ::std::fmt::Debug for xobject {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "xobject {{ xmg_stash: {:?}, xmg_u: {:?}, xobject_fields: {:?} }}",
            self.xmg_stash,
            self.xmg_u,
            self.xobject_fields,
        )
    }
}
pub const PL_SvPVtype_SvPVutf8_type_: PL_SvPVtype = 0;
pub const PL_SvPVtype_SvPVbyte_type_: PL_SvPVtype = 1;
pub const PL_SvPVtype_SvPVnormal_type_: PL_SvPVtype = 2;
pub const PL_SvPVtype_SvPVforce_type_: PL_SvPVtype = 3;
pub const PL_SvPVtype_SvPVutf8_pure_type_: PL_SvPVtype = 4;
pub const PL_SvPVtype_SvPVbyte_pure_type_: PL_SvPVtype = 5;
pub type PL_SvPVtype = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct clone_params {
    pub stashes: *mut AV,
    pub flags: UV,
    pub proto_perl: *mut PerlInterpreter,
    pub new_perl: *mut PerlInterpreter,
    pub unreferenced: *mut AV,
}
#[test]
fn bindgen_test_layout_clone_params() {
    const UNINIT: ::std::mem::MaybeUninit<clone_params> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<clone_params>(),
        40usize,
        concat!("Size of: ", stringify!(clone_params)),
    );
    assert_eq!(
        ::std::mem::align_of::<clone_params>(),
        8usize,
        concat!("Alignment of ", stringify!(clone_params)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stashes) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(clone_params), "::", stringify!(stashes)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(clone_params), "::", stringify!(flags)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).proto_perl) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(clone_params),
            "::",
            stringify!(proto_perl),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).new_perl) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(clone_params),
            "::",
            stringify!(new_perl),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unreferenced) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(clone_params),
            "::",
            stringify!(unreferenced),
        ),
    );
}
pub const utf8ness_t_UTF8NESS_NO: utf8ness_t = 0;
pub const utf8ness_t_UTF8NESS_IMMATERIAL: utf8ness_t = 1;
pub const utf8ness_t_UTF8NESS_YES: utf8ness_t = 2;
pub const utf8ness_t_UTF8NESS_UNKNOWN: utf8ness_t = -1;
pub type utf8ness_t = ::std::os::raw::c_int;
extern "C" {
    pub static PL_utf8skip: [::std::os::raw::c_uchar; 256usize];
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union regnode_head {
    pub data: regnode_head__bindgen_ty_1,
    pub data_u32: U32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct regnode_head__bindgen_ty_1 {
    pub u_8: regnode_head__bindgen_ty_1__bindgen_ty_1,
    pub type_: U8,
    pub next_off: U16,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union regnode_head__bindgen_ty_1__bindgen_ty_1 {
    pub flags: U8,
    pub str_len_u8: U8,
    pub first_byte: U8,
}
#[test]
fn bindgen_test_layout_regnode_head__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<regnode_head__bindgen_ty_1__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<regnode_head__bindgen_ty_1__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(regnode_head__bindgen_ty_1__bindgen_ty_1)),
    );
    assert_eq!(
        ::std::mem::align_of::<regnode_head__bindgen_ty_1__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(regnode_head__bindgen_ty_1__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regnode_head__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(flags),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).str_len_u8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regnode_head__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(str_len_u8),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).first_byte) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regnode_head__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(first_byte),
        ),
    );
}
impl ::std::fmt::Debug for regnode_head__bindgen_ty_1__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "regnode_head__bindgen_ty_1__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_regnode_head__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<regnode_head__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<regnode_head__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(regnode_head__bindgen_ty_1)),
    );
    assert_eq!(
        ::std::mem::align_of::<regnode_head__bindgen_ty_1>(),
        2usize,
        concat!("Alignment of ", stringify!(regnode_head__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u_8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regnode_head__bindgen_ty_1),
            "::",
            stringify!(u_8),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(regnode_head__bindgen_ty_1),
            "::",
            stringify!(type_),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next_off) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(regnode_head__bindgen_ty_1),
            "::",
            stringify!(next_off),
        ),
    );
}
impl ::std::fmt::Debug for regnode_head__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "regnode_head__bindgen_ty_1 {{ u_8: {:?}, type: {:?}, next_off: {:?} }}",
            self.u_8,
            self.type_,
            self.next_off,
        )
    }
}
#[test]
fn bindgen_test_layout_regnode_head() {
    const UNINIT: ::std::mem::MaybeUninit<regnode_head> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<regnode_head>(),
        4usize,
        concat!("Size of: ", stringify!(regnode_head)),
    );
    assert_eq!(
        ::std::mem::align_of::<regnode_head>(),
        4usize,
        concat!("Alignment of ", stringify!(regnode_head)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(regnode_head), "::", stringify!(data)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data_u32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regnode_head),
            "::",
            stringify!(data_u32),
        ),
    );
}
impl ::std::fmt::Debug for regnode_head {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "regnode_head {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct regnode {
    pub head: regnode_head,
}
#[test]
fn bindgen_test_layout_regnode() {
    const UNINIT: ::std::mem::MaybeUninit<regnode> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<regnode>(),
        4usize,
        concat!("Size of: ", stringify!(regnode)),
    );
    assert_eq!(
        ::std::mem::align_of::<regnode>(),
        4usize,
        concat!("Alignment of ", stringify!(regnode)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).head) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(regnode), "::", stringify!(head)),
    );
}
impl ::std::fmt::Debug for regnode {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "regnode {{ head: {:?} }}", self.head)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct reg_substr_datum {
    pub min_offset: isize,
    pub max_offset: isize,
    pub substr: *mut SV,
    pub utf8_substr: *mut SV,
    pub end_shift: isize,
}
#[test]
fn bindgen_test_layout_reg_substr_datum() {
    const UNINIT: ::std::mem::MaybeUninit<reg_substr_datum> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<reg_substr_datum>(),
        40usize,
        concat!("Size of: ", stringify!(reg_substr_datum)),
    );
    assert_eq!(
        ::std::mem::align_of::<reg_substr_datum>(),
        8usize,
        concat!("Alignment of ", stringify!(reg_substr_datum)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_offset) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_substr_datum),
            "::",
            stringify!(min_offset),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_offset) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_substr_datum),
            "::",
            stringify!(max_offset),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).substr) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_substr_datum),
            "::",
            stringify!(substr),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).utf8_substr) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_substr_datum),
            "::",
            stringify!(utf8_substr),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).end_shift) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_substr_datum),
            "::",
            stringify!(end_shift),
        ),
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct reg_substr_data {
    pub check_ix: U8,
    pub data: [reg_substr_datum; 3usize],
}
#[test]
fn bindgen_test_layout_reg_substr_data() {
    const UNINIT: ::std::mem::MaybeUninit<reg_substr_data> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<reg_substr_data>(),
        128usize,
        concat!("Size of: ", stringify!(reg_substr_data)),
    );
    assert_eq!(
        ::std::mem::align_of::<reg_substr_data>(),
        8usize,
        concat!("Alignment of ", stringify!(reg_substr_data)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).check_ix) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(reg_substr_data),
            "::",
            stringify!(check_ix),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(reg_substr_data), "::", stringify!(data)),
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regexp_paren_pair {
    pub start: isize,
    pub end: isize,
    pub start_tmp: isize,
}
#[test]
fn bindgen_test_layout_regexp_paren_pair() {
    const UNINIT: ::std::mem::MaybeUninit<regexp_paren_pair> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<regexp_paren_pair>(),
        24usize,
        concat!("Size of: ", stringify!(regexp_paren_pair)),
    );
    assert_eq!(
        ::std::mem::align_of::<regexp_paren_pair>(),
        8usize,
        concat!("Alignment of ", stringify!(regexp_paren_pair)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regexp_paren_pair),
            "::",
            stringify!(start),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).end) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(regexp_paren_pair),
            "::",
            stringify!(end),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start_tmp) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(regexp_paren_pair),
            "::",
            stringify!(start_tmp),
        ),
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct regexp {
    pub xmg_stash: *mut HV,
    pub xmg_u: _xmgu,
    pub xpv_cur: STRLEN,
    pub xpv_len_u: regexp__bindgen_ty_1,
    pub engine: *const regexp_engine,
    pub mother_re: *mut REGEXP,
    pub paren_names: *mut HV,
    pub nparens: U32,
    pub logical_nparens: U32,
    pub logical_to_parno: *mut I32,
    pub parno_to_logical: *mut I32,
    pub parno_to_logical_next: *mut I32,
    pub maxlen: isize,
    pub minlen: isize,
    pub minlenret: isize,
    pub gofs: STRLEN,
    pub substrs: *mut reg_substr_data,
    pub pprivate: *mut ::std::os::raw::c_void,
    pub extflags: U32,
    pub intflags: U32,
    pub lastparen: U32,
    pub lastcloseparen: U32,
    pub offs: *mut regexp_paren_pair,
    pub recurse_locinput: *mut *mut ::std::os::raw::c_char,
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub subbeg: *mut ::std::os::raw::c_char,
    pub saved_copy: *mut SV,
    pub sublen: isize,
    pub suboffset: isize,
    pub subcoffset: isize,
    pub qr_anoncv: *mut CV,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union regexp__bindgen_ty_1 {
    pub xpvlenu_len: STRLEN,
    pub xpvlenu_rx: *mut regexp,
}
#[test]
fn bindgen_test_layout_regexp__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<regexp__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<regexp__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(regexp__bindgen_ty_1)),
    );
    assert_eq!(
        ::std::mem::align_of::<regexp__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(regexp__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpvlenu_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regexp__bindgen_ty_1),
            "::",
            stringify!(xpvlenu_len),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpvlenu_rx) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regexp__bindgen_ty_1),
            "::",
            stringify!(xpvlenu_rx),
        ),
    );
}
impl ::std::fmt::Debug for regexp__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "regexp__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_regexp() {
    const UNINIT: ::std::mem::MaybeUninit<regexp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<regexp>(),
        224usize,
        concat!("Size of: ", stringify!(regexp)),
    );
    assert_eq!(
        ::std::mem::align_of::<regexp>(),
        8usize,
        concat!("Alignment of ", stringify!(regexp)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xmg_stash) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(regexp), "::", stringify!(xmg_stash)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xmg_u) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(regexp), "::", stringify!(xmg_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpv_cur) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(regexp), "::", stringify!(xpv_cur)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpv_len_u) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(regexp), "::", stringify!(xpv_len_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).engine) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(regexp), "::", stringify!(engine)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mother_re) as usize - ptr as usize },
        40usize,
        concat!("Offset of field: ", stringify!(regexp), "::", stringify!(mother_re)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).paren_names) as usize - ptr as usize },
        48usize,
        concat!("Offset of field: ", stringify!(regexp), "::", stringify!(paren_names)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nparens) as usize - ptr as usize },
        56usize,
        concat!("Offset of field: ", stringify!(regexp), "::", stringify!(nparens)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).logical_nparens) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(regexp),
            "::",
            stringify!(logical_nparens),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).logical_to_parno) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(regexp),
            "::",
            stringify!(logical_to_parno),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parno_to_logical) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(regexp),
            "::",
            stringify!(parno_to_logical),
        ),
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).parno_to_logical_next) as usize - ptr as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(regexp),
            "::",
            stringify!(parno_to_logical_next),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxlen) as usize - ptr as usize },
        88usize,
        concat!("Offset of field: ", stringify!(regexp), "::", stringify!(maxlen)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minlen) as usize - ptr as usize },
        96usize,
        concat!("Offset of field: ", stringify!(regexp), "::", stringify!(minlen)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minlenret) as usize - ptr as usize },
        104usize,
        concat!("Offset of field: ", stringify!(regexp), "::", stringify!(minlenret)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gofs) as usize - ptr as usize },
        112usize,
        concat!("Offset of field: ", stringify!(regexp), "::", stringify!(gofs)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).substrs) as usize - ptr as usize },
        120usize,
        concat!("Offset of field: ", stringify!(regexp), "::", stringify!(substrs)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pprivate) as usize - ptr as usize },
        128usize,
        concat!("Offset of field: ", stringify!(regexp), "::", stringify!(pprivate)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).extflags) as usize - ptr as usize },
        136usize,
        concat!("Offset of field: ", stringify!(regexp), "::", stringify!(extflags)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).intflags) as usize - ptr as usize },
        140usize,
        concat!("Offset of field: ", stringify!(regexp), "::", stringify!(intflags)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lastparen) as usize - ptr as usize },
        144usize,
        concat!("Offset of field: ", stringify!(regexp), "::", stringify!(lastparen)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lastcloseparen) as usize - ptr as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(regexp),
            "::",
            stringify!(lastcloseparen),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offs) as usize - ptr as usize },
        152usize,
        concat!("Offset of field: ", stringify!(regexp), "::", stringify!(offs)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recurse_locinput) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(regexp),
            "::",
            stringify!(recurse_locinput),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).subbeg) as usize - ptr as usize },
        176usize,
        concat!("Offset of field: ", stringify!(regexp), "::", stringify!(subbeg)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).saved_copy) as usize - ptr as usize },
        184usize,
        concat!("Offset of field: ", stringify!(regexp), "::", stringify!(saved_copy)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sublen) as usize - ptr as usize },
        192usize,
        concat!("Offset of field: ", stringify!(regexp), "::", stringify!(sublen)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).suboffset) as usize - ptr as usize },
        200usize,
        concat!("Offset of field: ", stringify!(regexp), "::", stringify!(suboffset)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).subcoffset) as usize - ptr as usize },
        208usize,
        concat!("Offset of field: ", stringify!(regexp), "::", stringify!(subcoffset)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).qr_anoncv) as usize - ptr as usize },
        216usize,
        concat!("Offset of field: ", stringify!(regexp), "::", stringify!(qr_anoncv)),
    );
}
impl ::std::fmt::Debug for regexp {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "regexp {{ xmg_stash: {:?}, xmg_u: {:?}, xpv_len_u: {:?}, engine: {:?}, mother_re: {:?}, paren_names: {:?}, nparens: {:?}, logical_nparens: {:?}, logical_to_parno: {:?}, parno_to_logical: {:?}, parno_to_logical_next: {:?}, substrs: {:?}, pprivate: {:?}, extflags: {:?}, intflags: {:?}, lastparen: {:?}, lastcloseparen: {:?}, offs: {:?}, recurse_locinput: {:?}, pre_prefix : {:?}, compflags : {:?}, subbeg: {:?}, saved_copy: {:?}, qr_anoncv: {:?} }}",
            self.xmg_stash,
            self.xmg_u,
            self.xpv_len_u,
            self.engine,
            self.mother_re,
            self.paren_names,
            self.nparens,
            self.logical_nparens,
            self.logical_to_parno,
            self.parno_to_logical,
            self.parno_to_logical_next,
            self.substrs,
            self.pprivate,
            self.extflags,
            self.intflags,
            self.lastparen,
            self.lastcloseparen,
            self.offs,
            self.recurse_locinput,
            self.pre_prefix(),
            self.compflags(),
            self.subbeg,
            self.saved_copy,
            self.qr_anoncv,
        )
    }
}
impl regexp {
    #[inline]
    pub fn pre_prefix(&self) -> U32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_pre_prefix(&mut self, val: U32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn compflags(&self) -> U32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 9u8) as u32) }
    }
    #[inline]
    pub fn set_compflags(&mut self, val: U32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        pre_prefix: U32,
        compflags: U32,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                4u8,
                {
                    let pre_prefix: u32 = unsafe { ::std::mem::transmute(pre_prefix) };
                    pre_prefix as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                4usize,
                9u8,
                {
                    let compflags: u32 = unsafe { ::std::mem::transmute(compflags) };
                    compflags as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct re_scream_pos_data_s {
    pub scream_olds: *mut *mut ::std::os::raw::c_char,
    pub scream_pos: *mut isize,
}
#[test]
fn bindgen_test_layout_re_scream_pos_data_s() {
    const UNINIT: ::std::mem::MaybeUninit<re_scream_pos_data_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<re_scream_pos_data_s>(),
        16usize,
        concat!("Size of: ", stringify!(re_scream_pos_data_s)),
    );
    assert_eq!(
        ::std::mem::align_of::<re_scream_pos_data_s>(),
        8usize,
        concat!("Alignment of ", stringify!(re_scream_pos_data_s)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scream_olds) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(re_scream_pos_data_s),
            "::",
            stringify!(scream_olds),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scream_pos) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(re_scream_pos_data_s),
            "::",
            stringify!(scream_pos),
        ),
    );
}
pub type re_scream_pos_data = re_scream_pos_data_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regexp_engine {
    pub comp: ::std::option::Option<
        unsafe extern "C" fn(
            my_perl: *mut PerlInterpreter,
            pattern: *mut SV,
            flags: U32,
        ) -> *mut REGEXP,
    >,
    pub exec: ::std::option::Option<
        unsafe extern "C" fn(
            my_perl: *mut PerlInterpreter,
            rx: *mut REGEXP,
            stringarg: *mut ::std::os::raw::c_char,
            strend: *mut ::std::os::raw::c_char,
            strbeg: *mut ::std::os::raw::c_char,
            minend: isize,
            sv: *mut SV,
            data: *mut ::std::os::raw::c_void,
            flags: U32,
        ) -> I32,
    >,
    pub intuit: ::std::option::Option<
        unsafe extern "C" fn(
            my_perl: *mut PerlInterpreter,
            rx: *mut REGEXP,
            sv: *mut SV,
            strbeg: *const ::std::os::raw::c_char,
            strpos: *mut ::std::os::raw::c_char,
            strend: *mut ::std::os::raw::c_char,
            flags: U32,
            data: *mut re_scream_pos_data,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub checkstr: ::std::option::Option<
        unsafe extern "C" fn(my_perl: *mut PerlInterpreter, rx: *mut REGEXP) -> *mut SV,
    >,
    pub rxfree: ::std::option::Option<
        unsafe extern "C" fn(my_perl: *mut PerlInterpreter, rx: *mut REGEXP),
    >,
    pub numbered_buff_FETCH: ::std::option::Option<
        unsafe extern "C" fn(
            my_perl: *mut PerlInterpreter,
            rx: *mut REGEXP,
            paren: I32,
            sv: *mut SV,
        ),
    >,
    pub numbered_buff_STORE: ::std::option::Option<
        unsafe extern "C" fn(
            my_perl: *mut PerlInterpreter,
            rx: *mut REGEXP,
            paren: I32,
            value: *const SV,
        ),
    >,
    pub numbered_buff_LENGTH: ::std::option::Option<
        unsafe extern "C" fn(
            my_perl: *mut PerlInterpreter,
            rx: *mut REGEXP,
            sv: *const SV,
            paren: I32,
        ) -> I32,
    >,
    pub named_buff: ::std::option::Option<
        unsafe extern "C" fn(
            my_perl: *mut PerlInterpreter,
            rx: *mut REGEXP,
            key: *mut SV,
            value: *mut SV,
            flags: U32,
        ) -> *mut SV,
    >,
    pub named_buff_iter: ::std::option::Option<
        unsafe extern "C" fn(
            my_perl: *mut PerlInterpreter,
            rx: *mut REGEXP,
            lastkey: *const SV,
            flags: U32,
        ) -> *mut SV,
    >,
    pub qr_package: ::std::option::Option<
        unsafe extern "C" fn(my_perl: *mut PerlInterpreter, rx: *mut REGEXP) -> *mut SV,
    >,
    pub dupe: ::std::option::Option<
        unsafe extern "C" fn(
            my_perl: *mut PerlInterpreter,
            rx: *mut REGEXP,
            param: *mut CLONE_PARAMS,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub op_comp: ::std::option::Option<
        unsafe extern "C" fn(
            my_perl: *mut PerlInterpreter,
            patternp: *mut *mut SV,
            pat_count: ::std::os::raw::c_int,
            expr: *mut OP,
            eng: *const regexp_engine,
            old_re: *mut REGEXP,
            is_bare_re: *mut bool,
            orig_rx_flags: U32,
            pm_flags: U32,
        ) -> *mut REGEXP,
    >,
}
#[test]
fn bindgen_test_layout_regexp_engine() {
    const UNINIT: ::std::mem::MaybeUninit<regexp_engine> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<regexp_engine>(),
        104usize,
        concat!("Size of: ", stringify!(regexp_engine)),
    );
    assert_eq!(
        ::std::mem::align_of::<regexp_engine>(),
        8usize,
        concat!("Alignment of ", stringify!(regexp_engine)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).comp) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(regexp_engine), "::", stringify!(comp)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).exec) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(regexp_engine), "::", stringify!(exec)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).intuit) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(regexp_engine), "::", stringify!(intuit)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).checkstr) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(regexp_engine),
            "::",
            stringify!(checkstr),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rxfree) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(regexp_engine), "::", stringify!(rxfree)),
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).numbered_buff_FETCH) as usize - ptr as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(regexp_engine),
            "::",
            stringify!(numbered_buff_FETCH),
        ),
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).numbered_buff_STORE) as usize - ptr as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(regexp_engine),
            "::",
            stringify!(numbered_buff_STORE),
        ),
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).numbered_buff_LENGTH) as usize - ptr as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(regexp_engine),
            "::",
            stringify!(numbered_buff_LENGTH),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).named_buff) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(regexp_engine),
            "::",
            stringify!(named_buff),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).named_buff_iter) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(regexp_engine),
            "::",
            stringify!(named_buff_iter),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).qr_package) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(regexp_engine),
            "::",
            stringify!(qr_package),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dupe) as usize - ptr as usize },
        88usize,
        concat!("Offset of field: ", stringify!(regexp_engine), "::", stringify!(dupe)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).op_comp) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(regexp_engine),
            "::",
            stringify!(op_comp),
        ),
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regmatch_info_aux_eval {
    pub rex: *mut regexp,
    pub curpm: *mut PMOP,
    pub saved_copy: *mut SV,
    pub subbeg: *mut ::std::os::raw::c_char,
    pub sublen: STRLEN,
    pub suboffset: STRLEN,
    pub subcoffset: STRLEN,
    pub sv: *mut SV,
    pub pos_magic: *mut MAGIC,
    pub pos: isize,
    pub pos_flags: U8,
}
#[test]
fn bindgen_test_layout_regmatch_info_aux_eval() {
    const UNINIT: ::std::mem::MaybeUninit<regmatch_info_aux_eval> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<regmatch_info_aux_eval>(),
        88usize,
        concat!("Size of: ", stringify!(regmatch_info_aux_eval)),
    );
    assert_eq!(
        ::std::mem::align_of::<regmatch_info_aux_eval>(),
        8usize,
        concat!("Alignment of ", stringify!(regmatch_info_aux_eval)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_info_aux_eval),
            "::",
            stringify!(rex),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).curpm) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_info_aux_eval),
            "::",
            stringify!(curpm),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).saved_copy) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_info_aux_eval),
            "::",
            stringify!(saved_copy),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).subbeg) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_info_aux_eval),
            "::",
            stringify!(subbeg),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sublen) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_info_aux_eval),
            "::",
            stringify!(sublen),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).suboffset) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_info_aux_eval),
            "::",
            stringify!(suboffset),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).subcoffset) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_info_aux_eval),
            "::",
            stringify!(subcoffset),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sv) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_info_aux_eval),
            "::",
            stringify!(sv),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pos_magic) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_info_aux_eval),
            "::",
            stringify!(pos_magic),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pos) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_info_aux_eval),
            "::",
            stringify!(pos),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pos_flags) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_info_aux_eval),
            "::",
            stringify!(pos_flags),
        ),
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regmatch_info_aux {
    pub info_aux_eval: *mut regmatch_info_aux_eval,
    pub old_regmatch_state: *mut regmatch_state,
    pub old_regmatch_slab: *mut regmatch_slab,
    pub poscache: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_regmatch_info_aux() {
    const UNINIT: ::std::mem::MaybeUninit<regmatch_info_aux> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<regmatch_info_aux>(),
        32usize,
        concat!("Size of: ", stringify!(regmatch_info_aux)),
    );
    assert_eq!(
        ::std::mem::align_of::<regmatch_info_aux>(),
        8usize,
        concat!("Alignment of ", stringify!(regmatch_info_aux)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).info_aux_eval) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_info_aux),
            "::",
            stringify!(info_aux_eval),
        ),
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).old_regmatch_state) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_info_aux),
            "::",
            stringify!(old_regmatch_state),
        ),
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).old_regmatch_slab) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_info_aux),
            "::",
            stringify!(old_regmatch_slab),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).poscache) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_info_aux),
            "::",
            stringify!(poscache),
        ),
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct next_matchable_info {
    pub first_byte_mask: U8,
    pub first_byte_anded: U8,
    pub mask32: U32,
    pub anded32: U32,
    pub count: PERL_INT_FAST8_T,
    pub min_length: PERL_UINT_FAST8_T,
    pub max_length: PERL_UINT_FAST8_T,
    pub initial_definitive: PERL_UINT_FAST8_T,
    pub initial_exact: PERL_UINT_FAST8_T,
    pub lengths: [PERL_UINT_FAST8_T; 6usize],
    pub matches: [U8; 18usize],
}
#[test]
fn bindgen_test_layout_next_matchable_info() {
    const UNINIT: ::std::mem::MaybeUninit<next_matchable_info> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<next_matchable_info>(),
        44usize,
        concat!("Size of: ", stringify!(next_matchable_info)),
    );
    assert_eq!(
        ::std::mem::align_of::<next_matchable_info>(),
        4usize,
        concat!("Alignment of ", stringify!(next_matchable_info)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).first_byte_mask) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(next_matchable_info),
            "::",
            stringify!(first_byte_mask),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).first_byte_anded) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(next_matchable_info),
            "::",
            stringify!(first_byte_anded),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mask32) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(next_matchable_info),
            "::",
            stringify!(mask32),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).anded32) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(next_matchable_info),
            "::",
            stringify!(anded32),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(next_matchable_info),
            "::",
            stringify!(count),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_length) as usize - ptr as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(next_matchable_info),
            "::",
            stringify!(min_length),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_length) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(next_matchable_info),
            "::",
            stringify!(max_length),
        ),
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).initial_definitive) as usize - ptr as usize
        },
        15usize,
        concat!(
            "Offset of field: ",
            stringify!(next_matchable_info),
            "::",
            stringify!(initial_definitive),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).initial_exact) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(next_matchable_info),
            "::",
            stringify!(initial_exact),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lengths) as usize - ptr as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(next_matchable_info),
            "::",
            stringify!(lengths),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).matches) as usize - ptr as usize },
        23usize,
        concat!(
            "Offset of field: ",
            stringify!(next_matchable_info),
            "::",
            stringify!(matches),
        ),
    );
}
pub type CHECKPOINT = I32;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct regmatch_state {
    pub resume_state: ::std::os::raw::c_int,
    pub locinput: *mut ::std::os::raw::c_char,
    pub loceol: *mut ::std::os::raw::c_char,
    pub sr0: *mut U8,
    pub u: regmatch_state__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union regmatch_state__bindgen_ty_1 {
    pub info_aux: regmatch_info_aux,
    pub info_aux_eval: regmatch_info_aux_eval,
    pub yes: regmatch_state__bindgen_ty_1__bindgen_ty_1,
    pub branchlike: regmatch_state__bindgen_ty_1__bindgen_ty_2,
    pub branch: regmatch_state__bindgen_ty_1__bindgen_ty_3,
    pub trie: regmatch_state__bindgen_ty_1__bindgen_ty_4,
    pub eval: regmatch_state__bindgen_ty_1__bindgen_ty_5,
    pub ifmatch: regmatch_state__bindgen_ty_1__bindgen_ty_6,
    pub mark: regmatch_state__bindgen_ty_1__bindgen_ty_7,
    pub keeper: regmatch_state__bindgen_ty_1__bindgen_ty_8,
    pub curlyx: regmatch_state__bindgen_ty_1__bindgen_ty_9,
    pub whilem: regmatch_state__bindgen_ty_1__bindgen_ty_10,
    pub curlym: regmatch_state__bindgen_ty_1__bindgen_ty_11,
    pub curly: regmatch_state__bindgen_ty_1__bindgen_ty_12,
    pub backref: regmatch_state__bindgen_ty_1__bindgen_ty_13,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regmatch_state__bindgen_ty_1__bindgen_ty_1 {
    pub prev_yes_state: *mut regmatch_state,
}
#[test]
fn bindgen_test_layout_regmatch_state__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<regmatch_state__bindgen_ty_1__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<regmatch_state__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_1)),
    );
    assert_eq!(
        ::std::mem::align_of::<regmatch_state__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prev_yes_state) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(prev_yes_state),
        ),
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regmatch_state__bindgen_ty_1__bindgen_ty_2 {
    pub prev_yes_state: *mut regmatch_state,
    pub lastparen: U32,
    pub lastcloseparen: U32,
    pub cp: CHECKPOINT,
    pub lastcp: CHECKPOINT,
    pub before_paren: U16,
    pub after_paren: U16,
}
#[test]
fn bindgen_test_layout_regmatch_state__bindgen_ty_1__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<regmatch_state__bindgen_ty_1__bindgen_ty_2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<regmatch_state__bindgen_ty_1__bindgen_ty_2>(),
        32usize,
        concat!("Size of: ", stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_2)),
    );
    assert_eq!(
        ::std::mem::align_of::<regmatch_state__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_2)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prev_yes_state) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(prev_yes_state),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lastparen) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(lastparen),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lastcloseparen) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(lastcloseparen),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cp) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(cp),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lastcp) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(lastcp),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).before_paren) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(before_paren),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).after_paren) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(after_paren),
        ),
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regmatch_state__bindgen_ty_1__bindgen_ty_3 {
    pub prev_yes_state: *mut regmatch_state,
    pub lastparen: U32,
    pub lastcloseparen: U32,
    pub cp: CHECKPOINT,
    pub lastcp: CHECKPOINT,
    pub before_paren: U16,
    pub after_paren: U16,
    pub next_branch: *mut regnode,
}
#[test]
fn bindgen_test_layout_regmatch_state__bindgen_ty_1__bindgen_ty_3() {
    const UNINIT: ::std::mem::MaybeUninit<regmatch_state__bindgen_ty_1__bindgen_ty_3> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<regmatch_state__bindgen_ty_1__bindgen_ty_3>(),
        40usize,
        concat!("Size of: ", stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_3)),
    );
    assert_eq!(
        ::std::mem::align_of::<regmatch_state__bindgen_ty_1__bindgen_ty_3>(),
        8usize,
        concat!("Alignment of ", stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_3)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prev_yes_state) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(prev_yes_state),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lastparen) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(lastparen),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lastcloseparen) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(lastcloseparen),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cp) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(cp),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lastcp) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(lastcp),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).before_paren) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(before_paren),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).after_paren) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(after_paren),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next_branch) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(next_branch),
        ),
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regmatch_state__bindgen_ty_1__bindgen_ty_4 {
    pub prev_yes_state: *mut regmatch_state,
    pub lastparen: U32,
    pub lastcloseparen: U32,
    pub cp: CHECKPOINT,
    pub lastcp: CHECKPOINT,
    pub before_paren: U16,
    pub after_paren: U16,
    pub accepted: U32,
    pub longfold: bool,
    pub jump: *mut U16,
    pub j_before_paren: *mut U16,
    pub j_after_paren: *mut U16,
    pub me: *mut regnode,
    pub firstpos: *mut U8,
    pub firstchars: U32,
    pub nextword: U16,
    pub topword: U16,
}
#[test]
fn bindgen_test_layout_regmatch_state__bindgen_ty_1__bindgen_ty_4() {
    const UNINIT: ::std::mem::MaybeUninit<regmatch_state__bindgen_ty_1__bindgen_ty_4> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<regmatch_state__bindgen_ty_1__bindgen_ty_4>(),
        88usize,
        concat!("Size of: ", stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_4)),
    );
    assert_eq!(
        ::std::mem::align_of::<regmatch_state__bindgen_ty_1__bindgen_ty_4>(),
        8usize,
        concat!("Alignment of ", stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_4)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prev_yes_state) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(prev_yes_state),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lastparen) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(lastparen),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lastcloseparen) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(lastcloseparen),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cp) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(cp),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lastcp) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(lastcp),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).before_paren) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(before_paren),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).after_paren) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(after_paren),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).accepted) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(accepted),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).longfold) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(longfold),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jump) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(jump),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).j_before_paren) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(j_before_paren),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).j_after_paren) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(j_after_paren),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).me) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(me),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).firstpos) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(firstpos),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).firstchars) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(firstchars),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nextword) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(nextword),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).topword) as usize - ptr as usize },
        86usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(topword),
        ),
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regmatch_state__bindgen_ty_1__bindgen_ty_5 {
    pub prev_yes_state: *mut regmatch_state,
    pub prev_curlyx: *mut regmatch_state,
    pub prev_eval: *mut regmatch_state,
    pub prev_rex: *mut REGEXP,
    pub cp: CHECKPOINT,
    pub lastcp: CHECKPOINT,
    pub close_paren: U32,
    pub B: *mut regnode,
    pub prev_recurse_locinput: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_regmatch_state__bindgen_ty_1__bindgen_ty_5() {
    const UNINIT: ::std::mem::MaybeUninit<regmatch_state__bindgen_ty_1__bindgen_ty_5> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<regmatch_state__bindgen_ty_1__bindgen_ty_5>(),
        64usize,
        concat!("Size of: ", stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_5)),
    );
    assert_eq!(
        ::std::mem::align_of::<regmatch_state__bindgen_ty_1__bindgen_ty_5>(),
        8usize,
        concat!("Alignment of ", stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_5)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prev_yes_state) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_5),
            "::",
            stringify!(prev_yes_state),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prev_curlyx) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_5),
            "::",
            stringify!(prev_curlyx),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prev_eval) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_5),
            "::",
            stringify!(prev_eval),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prev_rex) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_5),
            "::",
            stringify!(prev_rex),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cp) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_5),
            "::",
            stringify!(cp),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lastcp) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_5),
            "::",
            stringify!(lastcp),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).close_paren) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_5),
            "::",
            stringify!(close_paren),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).B) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_5),
            "::",
            stringify!(B),
        ),
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).prev_recurse_locinput) as usize - ptr as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_5),
            "::",
            stringify!(prev_recurse_locinput),
        ),
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regmatch_state__bindgen_ty_1__bindgen_ty_6 {
    pub prev_yes_state: *mut regmatch_state,
    pub wanted: I32,
    pub logical: I32,
    pub count: U8,
    pub start: *mut ::std::os::raw::c_char,
    pub end: *mut ::std::os::raw::c_char,
    pub me: *mut regnode,
    pub prev_match_end: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_regmatch_state__bindgen_ty_1__bindgen_ty_6() {
    const UNINIT: ::std::mem::MaybeUninit<regmatch_state__bindgen_ty_1__bindgen_ty_6> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<regmatch_state__bindgen_ty_1__bindgen_ty_6>(),
        56usize,
        concat!("Size of: ", stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_6)),
    );
    assert_eq!(
        ::std::mem::align_of::<regmatch_state__bindgen_ty_1__bindgen_ty_6>(),
        8usize,
        concat!("Alignment of ", stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_6)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prev_yes_state) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_6),
            "::",
            stringify!(prev_yes_state),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wanted) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_6),
            "::",
            stringify!(wanted),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).logical) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_6),
            "::",
            stringify!(logical),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_6),
            "::",
            stringify!(count),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_6),
            "::",
            stringify!(start),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).end) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_6),
            "::",
            stringify!(end),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).me) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_6),
            "::",
            stringify!(me),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prev_match_end) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_6),
            "::",
            stringify!(prev_match_end),
        ),
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regmatch_state__bindgen_ty_1__bindgen_ty_7 {
    pub prev_yes_state: *mut regmatch_state,
    pub prev_mark: *mut regmatch_state,
    pub mark_name: *mut SV,
    pub mark_loc: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_regmatch_state__bindgen_ty_1__bindgen_ty_7() {
    const UNINIT: ::std::mem::MaybeUninit<regmatch_state__bindgen_ty_1__bindgen_ty_7> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<regmatch_state__bindgen_ty_1__bindgen_ty_7>(),
        32usize,
        concat!("Size of: ", stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_7)),
    );
    assert_eq!(
        ::std::mem::align_of::<regmatch_state__bindgen_ty_1__bindgen_ty_7>(),
        8usize,
        concat!("Alignment of ", stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_7)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prev_yes_state) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_7),
            "::",
            stringify!(prev_yes_state),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prev_mark) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_7),
            "::",
            stringify!(prev_mark),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mark_name) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_7),
            "::",
            stringify!(mark_name),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mark_loc) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_7),
            "::",
            stringify!(mark_loc),
        ),
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regmatch_state__bindgen_ty_1__bindgen_ty_8 {
    pub val: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_regmatch_state__bindgen_ty_1__bindgen_ty_8() {
    const UNINIT: ::std::mem::MaybeUninit<regmatch_state__bindgen_ty_1__bindgen_ty_8> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<regmatch_state__bindgen_ty_1__bindgen_ty_8>(),
        4usize,
        concat!("Size of: ", stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_8)),
    );
    assert_eq!(
        ::std::mem::align_of::<regmatch_state__bindgen_ty_1__bindgen_ty_8>(),
        4usize,
        concat!("Alignment of ", stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_8)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_8),
            "::",
            stringify!(val),
        ),
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regmatch_state__bindgen_ty_1__bindgen_ty_9 {
    pub prev_yes_state: *mut regmatch_state,
    pub prev_curlyx: *mut regmatch_state,
    pub me: *mut regnode,
    pub B: *mut regnode,
    pub cp: CHECKPOINT,
    pub lastcp: CHECKPOINT,
    pub minmod: bool,
    pub parenfloor: ::std::os::raw::c_int,
    pub count: ::std::os::raw::c_int,
    pub lastloc: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_regmatch_state__bindgen_ty_1__bindgen_ty_9() {
    const UNINIT: ::std::mem::MaybeUninit<regmatch_state__bindgen_ty_1__bindgen_ty_9> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<regmatch_state__bindgen_ty_1__bindgen_ty_9>(),
        64usize,
        concat!("Size of: ", stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_9)),
    );
    assert_eq!(
        ::std::mem::align_of::<regmatch_state__bindgen_ty_1__bindgen_ty_9>(),
        8usize,
        concat!("Alignment of ", stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_9)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prev_yes_state) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_9),
            "::",
            stringify!(prev_yes_state),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prev_curlyx) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_9),
            "::",
            stringify!(prev_curlyx),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).me) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_9),
            "::",
            stringify!(me),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).B) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_9),
            "::",
            stringify!(B),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cp) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_9),
            "::",
            stringify!(cp),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lastcp) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_9),
            "::",
            stringify!(lastcp),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minmod) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_9),
            "::",
            stringify!(minmod),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parenfloor) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_9),
            "::",
            stringify!(parenfloor),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_9),
            "::",
            stringify!(count),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lastloc) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_9),
            "::",
            stringify!(lastloc),
        ),
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regmatch_state__bindgen_ty_1__bindgen_ty_10 {
    pub prev_yes_state: *mut regmatch_state,
    pub save_curlyx: *mut regmatch_state,
    pub cp: CHECKPOINT,
    pub lastcp: CHECKPOINT,
    pub save_lastloc: *mut ::std::os::raw::c_char,
    pub cache_offset: I32,
    pub cache_mask: I32,
}
#[test]
fn bindgen_test_layout_regmatch_state__bindgen_ty_1__bindgen_ty_10() {
    const UNINIT: ::std::mem::MaybeUninit<regmatch_state__bindgen_ty_1__bindgen_ty_10> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<regmatch_state__bindgen_ty_1__bindgen_ty_10>(),
        40usize,
        concat!("Size of: ", stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_10)),
    );
    assert_eq!(
        ::std::mem::align_of::<regmatch_state__bindgen_ty_1__bindgen_ty_10>(),
        8usize,
        concat!("Alignment of ", stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_10)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prev_yes_state) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_10),
            "::",
            stringify!(prev_yes_state),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).save_curlyx) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_10),
            "::",
            stringify!(save_curlyx),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cp) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_10),
            "::",
            stringify!(cp),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lastcp) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_10),
            "::",
            stringify!(lastcp),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).save_lastloc) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_10),
            "::",
            stringify!(save_lastloc),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cache_offset) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_10),
            "::",
            stringify!(cache_offset),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cache_mask) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_10),
            "::",
            stringify!(cache_mask),
        ),
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regmatch_state__bindgen_ty_1__bindgen_ty_11 {
    pub prev_yes_state: *mut regmatch_state,
    pub lastparen: U32,
    pub lastcloseparen: U32,
    pub cp: CHECKPOINT,
    pub lastcp: CHECKPOINT,
    pub alen: I32,
    pub count: I32,
    pub minmod: bool,
    pub A: *mut regnode,
    pub B: *mut regnode,
    pub me: *mut regnode,
    pub Binfo: next_matchable_info,
}
#[test]
fn bindgen_test_layout_regmatch_state__bindgen_ty_1__bindgen_ty_11() {
    const UNINIT: ::std::mem::MaybeUninit<regmatch_state__bindgen_ty_1__bindgen_ty_11> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<regmatch_state__bindgen_ty_1__bindgen_ty_11>(),
        112usize,
        concat!("Size of: ", stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_11)),
    );
    assert_eq!(
        ::std::mem::align_of::<regmatch_state__bindgen_ty_1__bindgen_ty_11>(),
        8usize,
        concat!("Alignment of ", stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_11)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prev_yes_state) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_11),
            "::",
            stringify!(prev_yes_state),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lastparen) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_11),
            "::",
            stringify!(lastparen),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lastcloseparen) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_11),
            "::",
            stringify!(lastcloseparen),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cp) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_11),
            "::",
            stringify!(cp),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lastcp) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_11),
            "::",
            stringify!(lastcp),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alen) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_11),
            "::",
            stringify!(alen),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_11),
            "::",
            stringify!(count),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minmod) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_11),
            "::",
            stringify!(minmod),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).A) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_11),
            "::",
            stringify!(A),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).B) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_11),
            "::",
            stringify!(B),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).me) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_11),
            "::",
            stringify!(me),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Binfo) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_11),
            "::",
            stringify!(Binfo),
        ),
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regmatch_state__bindgen_ty_1__bindgen_ty_12 {
    pub paren: U32,
    pub lastparen: U32,
    pub lastcloseparen: U32,
    pub cp: CHECKPOINT,
    pub lastcp: CHECKPOINT,
    pub maxpos: *mut ::std::os::raw::c_char,
    pub oldloc: *mut ::std::os::raw::c_char,
    pub count: ::std::os::raw::c_int,
    pub min: ::std::os::raw::c_int,
    pub max: ::std::os::raw::c_int,
    pub A: *mut regnode,
    pub B: *mut regnode,
    pub Binfo: next_matchable_info,
}
#[test]
fn bindgen_test_layout_regmatch_state__bindgen_ty_1__bindgen_ty_12() {
    const UNINIT: ::std::mem::MaybeUninit<regmatch_state__bindgen_ty_1__bindgen_ty_12> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<regmatch_state__bindgen_ty_1__bindgen_ty_12>(),
        120usize,
        concat!("Size of: ", stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_12)),
    );
    assert_eq!(
        ::std::mem::align_of::<regmatch_state__bindgen_ty_1__bindgen_ty_12>(),
        8usize,
        concat!("Alignment of ", stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_12)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).paren) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_12),
            "::",
            stringify!(paren),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lastparen) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_12),
            "::",
            stringify!(lastparen),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lastcloseparen) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_12),
            "::",
            stringify!(lastcloseparen),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cp) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_12),
            "::",
            stringify!(cp),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lastcp) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_12),
            "::",
            stringify!(lastcp),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxpos) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_12),
            "::",
            stringify!(maxpos),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).oldloc) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_12),
            "::",
            stringify!(oldloc),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_12),
            "::",
            stringify!(count),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_12),
            "::",
            stringify!(min),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_12),
            "::",
            stringify!(max),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).A) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_12),
            "::",
            stringify!(A),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).B) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_12),
            "::",
            stringify!(B),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Binfo) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_12),
            "::",
            stringify!(Binfo),
        ),
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct regmatch_state__bindgen_ty_1__bindgen_ty_13 {
    pub cp: CHECKPOINT,
    pub lastcp: CHECKPOINT,
}
#[test]
fn bindgen_test_layout_regmatch_state__bindgen_ty_1__bindgen_ty_13() {
    const UNINIT: ::std::mem::MaybeUninit<regmatch_state__bindgen_ty_1__bindgen_ty_13> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<regmatch_state__bindgen_ty_1__bindgen_ty_13>(),
        8usize,
        concat!("Size of: ", stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_13)),
    );
    assert_eq!(
        ::std::mem::align_of::<regmatch_state__bindgen_ty_1__bindgen_ty_13>(),
        4usize,
        concat!("Alignment of ", stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_13)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_13),
            "::",
            stringify!(cp),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lastcp) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1__bindgen_ty_13),
            "::",
            stringify!(lastcp),
        ),
    );
}
#[test]
fn bindgen_test_layout_regmatch_state__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<regmatch_state__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<regmatch_state__bindgen_ty_1>(),
        120usize,
        concat!("Size of: ", stringify!(regmatch_state__bindgen_ty_1)),
    );
    assert_eq!(
        ::std::mem::align_of::<regmatch_state__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(regmatch_state__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).info_aux) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1),
            "::",
            stringify!(info_aux),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).info_aux_eval) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1),
            "::",
            stringify!(info_aux_eval),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).yes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1),
            "::",
            stringify!(yes),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).branchlike) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1),
            "::",
            stringify!(branchlike),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).branch) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1),
            "::",
            stringify!(branch),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trie) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1),
            "::",
            stringify!(trie),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eval) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1),
            "::",
            stringify!(eval),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifmatch) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1),
            "::",
            stringify!(ifmatch),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mark) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1),
            "::",
            stringify!(mark),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).keeper) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1),
            "::",
            stringify!(keeper),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).curlyx) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1),
            "::",
            stringify!(curlyx),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).whilem) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1),
            "::",
            stringify!(whilem),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).curlym) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1),
            "::",
            stringify!(curlym),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).curly) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1),
            "::",
            stringify!(curly),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).backref) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state__bindgen_ty_1),
            "::",
            stringify!(backref),
        ),
    );
}
impl ::std::fmt::Debug for regmatch_state__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "regmatch_state__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_regmatch_state() {
    const UNINIT: ::std::mem::MaybeUninit<regmatch_state> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<regmatch_state>(),
        152usize,
        concat!("Size of: ", stringify!(regmatch_state)),
    );
    assert_eq!(
        ::std::mem::align_of::<regmatch_state>(),
        8usize,
        concat!("Alignment of ", stringify!(regmatch_state)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).resume_state) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state),
            "::",
            stringify!(resume_state),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).locinput) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state),
            "::",
            stringify!(locinput),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).loceol) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(regmatch_state),
            "::",
            stringify!(loceol),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sr0) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(regmatch_state), "::", stringify!(sr0)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(regmatch_state), "::", stringify!(u)),
    );
}
impl ::std::fmt::Debug for regmatch_state {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "regmatch_state {{ resume_state: {:?}, locinput: {:?}, loceol: {:?}, sr0: {:?}, u: {:?} }}",
            self.resume_state,
            self.locinput,
            self.loceol,
            self.sr0,
            self.u,
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct regmatch_slab {
    pub states: [regmatch_state; 26usize],
    pub prev: *mut regmatch_slab,
    pub next: *mut regmatch_slab,
}
#[test]
fn bindgen_test_layout_regmatch_slab() {
    const UNINIT: ::std::mem::MaybeUninit<regmatch_slab> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<regmatch_slab>(),
        3968usize,
        concat!("Size of: ", stringify!(regmatch_slab)),
    );
    assert_eq!(
        ::std::mem::align_of::<regmatch_slab>(),
        8usize,
        concat!("Alignment of ", stringify!(regmatch_slab)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).states) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(regmatch_slab), "::", stringify!(states)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prev) as usize - ptr as usize },
        3952usize,
        concat!("Offset of field: ", stringify!(regmatch_slab), "::", stringify!(prev)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        3960usize,
        concat!("Offset of field: ", stringify!(regmatch_slab), "::", stringify!(next)),
    );
}
impl ::std::fmt::Debug for regmatch_slab {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "regmatch_slab {{ states: {:?}, prev: {:?}, next: {:?} }}",
            self.states,
            self.prev,
            self.next,
        )
    }
}
pub type perl_drand48_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gp {
    pub gp_sv: *mut SV,
    pub gp_io: *mut io,
    pub gp_cv: *mut CV,
    pub gp_cvgen: U32,
    pub gp_refcnt: U32,
    pub gp_hv: *mut HV,
    pub gp_av: *mut AV,
    pub gp_form: *mut CV,
    pub gp_egv: *mut GV,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    pub gp_file_hek: *mut HEK,
}
#[test]
fn bindgen_test_layout_gp() {
    const UNINIT: ::std::mem::MaybeUninit<gp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<gp>(),
        80usize,
        concat!("Size of: ", stringify!(gp)),
    );
    assert_eq!(
        ::std::mem::align_of::<gp>(),
        8usize,
        concat!("Alignment of ", stringify!(gp)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gp_sv) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(gp), "::", stringify!(gp_sv)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gp_io) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(gp), "::", stringify!(gp_io)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gp_cv) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(gp), "::", stringify!(gp_cv)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gp_cvgen) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(gp), "::", stringify!(gp_cvgen)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gp_refcnt) as usize - ptr as usize },
        28usize,
        concat!("Offset of field: ", stringify!(gp), "::", stringify!(gp_refcnt)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gp_hv) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(gp), "::", stringify!(gp_hv)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gp_av) as usize - ptr as usize },
        40usize,
        concat!("Offset of field: ", stringify!(gp), "::", stringify!(gp_av)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gp_form) as usize - ptr as usize },
        48usize,
        concat!("Offset of field: ", stringify!(gp), "::", stringify!(gp_form)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gp_egv) as usize - ptr as usize },
        56usize,
        concat!("Offset of field: ", stringify!(gp), "::", stringify!(gp_egv)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gp_file_hek) as usize - ptr as usize },
        72usize,
        concat!("Offset of field: ", stringify!(gp), "::", stringify!(gp_file_hek)),
    );
}
impl gp {
    #[inline]
    pub fn gp_line(&self) -> U32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 31u8) as u32) }
    }
    #[inline]
    pub fn set_gp_line(&mut self, val: U32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 31u8, val as u64)
        }
    }
    #[inline]
    pub fn gp_flags(&self) -> U32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_gp_flags(&mut self, val: U32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        gp_line: U32,
        gp_flags: U32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit
            .set(
                0usize,
                31u8,
                {
                    let gp_line: u32 = unsafe { ::std::mem::transmute(gp_line) };
                    gp_line as u64
                },
            );
        __bindgen_bitfield_unit
            .set(
                31usize,
                1u8,
                {
                    let gp_flags: u32 = unsafe { ::std::mem::transmute(gp_flags) };
                    gp_flags as u64
                },
            );
        __bindgen_bitfield_unit
    }
}
pub type PADOFFSET = isize;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct padlist {
    pub xpadl_max: isize,
    pub xpadl_arr: padlist__bindgen_ty_1,
    pub xpadl_id: U32,
    pub xpadl_outid: U32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union padlist__bindgen_ty_1 {
    pub xpadlarr_alloc: *mut *mut PAD,
    pub xpadlarr_dbg: *mut padlist__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct padlist__bindgen_ty_1__bindgen_ty_1 {
    pub padnl: *mut PADNAMELIST,
    pub pad_1: *mut PAD,
    pub pad_2: *mut PAD,
}
#[test]
fn bindgen_test_layout_padlist__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<padlist__bindgen_ty_1__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<padlist__bindgen_ty_1__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(padlist__bindgen_ty_1__bindgen_ty_1)),
    );
    assert_eq!(
        ::std::mem::align_of::<padlist__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(padlist__bindgen_ty_1__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padnl) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(padlist__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(padnl),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pad_1) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(padlist__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(pad_1),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pad_2) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(padlist__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(pad_2),
        ),
    );
}
#[test]
fn bindgen_test_layout_padlist__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<padlist__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<padlist__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(padlist__bindgen_ty_1)),
    );
    assert_eq!(
        ::std::mem::align_of::<padlist__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(padlist__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpadlarr_alloc) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(padlist__bindgen_ty_1),
            "::",
            stringify!(xpadlarr_alloc),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpadlarr_dbg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(padlist__bindgen_ty_1),
            "::",
            stringify!(xpadlarr_dbg),
        ),
    );
}
impl ::std::fmt::Debug for padlist__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "padlist__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_padlist() {
    const UNINIT: ::std::mem::MaybeUninit<padlist> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<padlist>(),
        24usize,
        concat!("Size of: ", stringify!(padlist)),
    );
    assert_eq!(
        ::std::mem::align_of::<padlist>(),
        8usize,
        concat!("Alignment of ", stringify!(padlist)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpadl_max) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(padlist), "::", stringify!(xpadl_max)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpadl_arr) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(padlist), "::", stringify!(xpadl_arr)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpadl_id) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(padlist), "::", stringify!(xpadl_id)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpadl_outid) as usize - ptr as usize },
        20usize,
        concat!("Offset of field: ", stringify!(padlist), "::", stringify!(xpadl_outid)),
    );
}
impl ::std::fmt::Debug for padlist {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "padlist {{ xpadl_arr: {:?}, xpadl_id: {:?}, xpadl_outid: {:?} }}",
            self.xpadl_arr,
            self.xpadl_id,
            self.xpadl_outid,
        )
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct padnamelist {
    pub xpadnl_fill: isize,
    pub xpadnl_alloc: *mut *mut PADNAME,
    pub xpadnl_max: isize,
    pub xpadnl_max_named: PADOFFSET,
    pub xpadnl_refcnt: U32,
}
#[test]
fn bindgen_test_layout_padnamelist() {
    const UNINIT: ::std::mem::MaybeUninit<padnamelist> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<padnamelist>(),
        40usize,
        concat!("Size of: ", stringify!(padnamelist)),
    );
    assert_eq!(
        ::std::mem::align_of::<padnamelist>(),
        8usize,
        concat!("Alignment of ", stringify!(padnamelist)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpadnl_fill) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(padnamelist),
            "::",
            stringify!(xpadnl_fill),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpadnl_alloc) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(padnamelist),
            "::",
            stringify!(xpadnl_alloc),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpadnl_max) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(padnamelist),
            "::",
            stringify!(xpadnl_max),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpadnl_max_named) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(padnamelist),
            "::",
            stringify!(xpadnl_max_named),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpadnl_refcnt) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(padnamelist),
            "::",
            stringify!(xpadnl_refcnt),
        ),
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct padname {
    pub xpadn_pv: *mut ::std::os::raw::c_char,
    pub xpadn_ourstash: *mut HV,
    pub xpadn_type_u: padname__bindgen_ty_1,
    pub xpadn_fieldinfo: *mut padname_fieldinfo,
    pub xpadn_low: U32,
    pub xpadn_high: U32,
    pub xpadn_refcnt: U32,
    pub xpadn_gen: ::std::os::raw::c_int,
    pub xpadn_len: U8,
    pub xpadn_flags: U8,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union padname__bindgen_ty_1 {
    pub xpadn_typestash: *mut HV,
    pub xpadn_protocv: *mut CV,
}
#[test]
fn bindgen_test_layout_padname__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<padname__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<padname__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(padname__bindgen_ty_1)),
    );
    assert_eq!(
        ::std::mem::align_of::<padname__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(padname__bindgen_ty_1)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpadn_typestash) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(padname__bindgen_ty_1),
            "::",
            stringify!(xpadn_typestash),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpadn_protocv) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(padname__bindgen_ty_1),
            "::",
            stringify!(xpadn_protocv),
        ),
    );
}
impl ::std::fmt::Debug for padname__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "padname__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_padname() {
    const UNINIT: ::std::mem::MaybeUninit<padname> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<padname>(),
        56usize,
        concat!("Size of: ", stringify!(padname)),
    );
    assert_eq!(
        ::std::mem::align_of::<padname>(),
        8usize,
        concat!("Alignment of ", stringify!(padname)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpadn_pv) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(padname), "::", stringify!(xpadn_pv)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpadn_ourstash) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(padname),
            "::",
            stringify!(xpadn_ourstash),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpadn_type_u) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(padname), "::", stringify!(xpadn_type_u)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpadn_fieldinfo) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(padname),
            "::",
            stringify!(xpadn_fieldinfo),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpadn_low) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(padname), "::", stringify!(xpadn_low)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpadn_high) as usize - ptr as usize },
        36usize,
        concat!("Offset of field: ", stringify!(padname), "::", stringify!(xpadn_high)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpadn_refcnt) as usize - ptr as usize },
        40usize,
        concat!("Offset of field: ", stringify!(padname), "::", stringify!(xpadn_refcnt)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpadn_gen) as usize - ptr as usize },
        44usize,
        concat!("Offset of field: ", stringify!(padname), "::", stringify!(xpadn_gen)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpadn_len) as usize - ptr as usize },
        48usize,
        concat!("Offset of field: ", stringify!(padname), "::", stringify!(xpadn_len)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xpadn_flags) as usize - ptr as usize },
        49usize,
        concat!("Offset of field: ", stringify!(padname), "::", stringify!(xpadn_flags)),
    );
}
impl ::std::fmt::Debug for padname {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "padname {{ xpadn_pv: {:?}, xpadn_ourstash: {:?}, xpadn_type_u: {:?}, xpadn_fieldinfo: {:?}, xpadn_low: {:?}, xpadn_high: {:?}, xpadn_refcnt: {:?}, xpadn_gen: {:?}, xpadn_len: {:?}, xpadn_flags: {:?} }}",
            self.xpadn_pv,
            self.xpadn_ourstash,
            self.xpadn_type_u,
            self.xpadn_fieldinfo,
            self.xpadn_low,
            self.xpadn_high,
            self.xpadn_refcnt,
            self.xpadn_gen,
            self.xpadn_len,
            self.xpadn_flags,
        )
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct padname_fieldinfo {
    pub refcount: U32,
    pub fieldix: PADOFFSET,
    pub fieldstash: *mut HV,
    pub defop: *mut OP,
    pub paramname: *mut SV,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 7usize],
}
#[test]
fn bindgen_test_layout_padname_fieldinfo() {
    const UNINIT: ::std::mem::MaybeUninit<padname_fieldinfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<padname_fieldinfo>(),
        48usize,
        concat!("Size of: ", stringify!(padname_fieldinfo)),
    );
    assert_eq!(
        ::std::mem::align_of::<padname_fieldinfo>(),
        8usize,
        concat!("Alignment of ", stringify!(padname_fieldinfo)),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).refcount) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(padname_fieldinfo),
            "::",
            stringify!(refcount),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fieldix) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(padname_fieldinfo),
            "::",
            stringify!(fieldix),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fieldstash) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(padname_fieldinfo),
            "::",
            stringify!(fieldstash),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).defop) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(padname_fieldinfo),
            "::",
            stringify!(defop),
        ),
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).paramname) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(padname_fieldinfo),
            "::",
            stringify!(paramname),
